Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: 16 June 1998
de: 16. Juni 1998
es: 16 de Junio de 1998

source: apt - Advanced Package Tool
de: apt - Fortschrittliches Paketwerkzeug (Advanced Package Tool)
es: apt - Herramienta avanzada de paquetes

source: SYNOPSIS
de: ÜBERSICHT
es: SINOPSIS

source: DESCRIPTION
de: BESCHREIBUNG
es: DESCRIPCIÓN

source: APT is a management system for software packages. For normal day to day package management there are several frontends available, such as B<aptitude>(8) for the command line or B<synaptic>(8) for the X Window System. Some options are only implemented in B<apt-get>(8) though.
de: APT ist ein Verwaltungssystem für Softwarepakete. Für normale alltägliche Paketverwaltung sind mehrere Oberflächen, wie B<aptitude>(8) für die Befehlszeile oder B<synaptic>(8) für das X-Window-System, verfügbar. Einige Optionen sind jedoch nur in B<apt-get>(8) implementiert.
es: APT es un sistema de gestión de paquetes de software. Dispone de varias interfaces para la gestión de paquetes normal del día a día, tales como B<aptitude>(8) para la línea de órdenes o B<synaptic>(8) para el sistema de ventanas de X. Algunas opciones sólo están implementadas en B<apt-get>(8).

source: SEE ALSO
de: SIEHE AUCH
es: VÉASE TAMBIÉN

source: DIAGNOSTICS
de: DIAGNOSE
es: DIAGNÓSTICOS

source: apt returns zero on normal operation, decimal 100 on error.
de: APT gibt bei normalen Operationen 0 zurück, dezimal 100 bei Fehlern.
es: apt devuelve cero si no hay ningún error, y el valor 100 en caso de error.

source: BUGS
de: FEHLER
es: FALLOS

source: This manpage isn't even started.
de: Diese Handbuchseite wurde noch nicht mal begonnen.
es: Esta página de manual ni siquiera está iniciada.

source: See E<lt>http://bugs.debian.org/aptE<gt>. If you wish to report a bug in B<apt>, please see I</usr/share/doc/debian/bug-reporting.txt> or the B<reportbug>(1) command.
de: Siehe auch E<lt>http://bugs.debian.org/aptE<gt>. Wenn Sie einen Fehler in B<apt> berichten möchten, sehen Sie sich bitte I</usr/share/doc/debian/bug-reporting.txt> oder den Befehl B<reportbug>(1) an.
es: Consulte E<lt>http://bugs.debian.org/aptE<gt>. Si desea enviar un informe de error sobre B<apt>, por favor lea I</usr/share/doc/debian/bug-reporting.txt> o use la orden B<reportbug>(1).

source: AUTHOR
de: AUTOR
es: AUTOR

source: apt was written by the APT team E<lt>apt@packages.debian.orgE<gt>.
de: APT wurde vom APT-Team E<lt>apt@packages.debian.orgE<gt> geschrieben.
es: El equipo APT E<lt>apt@packages.debian.orgE<gt> escribió apt.

source: <!-- Boiler plate docinfo section --> <!ENTITY apt-docinfo " <refentryinfo> <address><email>apt@packages.debian.org</email></address> <author> <firstname>Jason</firstname> <surname>Gunthorpe</surname> <contrib></contrib> </author> <copyright><year>1998-2001</year> <holder>Jason Gunthorpe</holder></copyright> <date>28 October 2008</date> <productname>Linux</productname> </refentryinfo> ">
de: <!-- Vorformatierter Textblock docinfo-Abschnitt --> <!ENTITY apt-docinfo " <refentryinfo> <address><email>apt@packages.debian.org</email></address> <author> <firstname>Jason</firstname> <surname>Gunthorpe</surname> <contrib></contrib> </author> <copyright><year>1998-2001</year> <holder>Jason Gunthorpe</holder></copyright> <date>28. Oktober 2008</date> <productname>Linux</productname> </refentryinfo> ">
es: <!-- Boiler plate docinfo section --> <!ENTITY apt-docinfo " <refentryinfo> <address><email>apt@packages.debian.org</email></address> <author> <firstname>Jason</firstname> <surname>Gunthorpe</surname> <contrib></contrib> </author> <copyright><year>1998-2001</year> <holder>Jason Gunthorpe</holder></copyright> <date>28 de Octubre de 2008</date> <productname>Linux</productname> </refentryinfo> ">

source: <!ENTITY apt-qapage " <para> <ulink url='http://packages.qa.debian.org/a/apt.html'>QA Page</ulink> </para> ">
de: <!ENTITY apt-qapage " <para> <ulink url='http://packages.qa.debian.org/a/apt.html'>QA-Seite</ulink> </para> ">
es: <!ENTITY apt-qapage " <para> <ulink url='http://packages.qa.debian.org/a/apt.html'>Página de QA</ulink> </para> ">

source: <!-- Boiler plate Bug reporting section --> <!ENTITY manbugs " <refsect1><title>Bugs</title> <para><ulink url='http://bugs.debian.org/src:apt'>APT bug page</ulink>. If you wish to report a bug in APT, please see <filename>/usr/share/doc/debian/bug-reporting.txt</filename> or the &reportbug; command. </para> </refsect1> ">
de: <!-- Vorformatierter Textblock Fehlerbericht-Abschnitt --> <!ENTITY manbugs " <refsect1><title>Fehler</title> <para><ulink url='http://bugs.debian.org/src:apt'>APT-Fehlerseite</ulink>. Wenn Sie einen Fehler in APT berichten möchten, lesen Sie bitte <filename>/usr/share/doc/debian/bug-reporting.txt</filename> oder den &reportbug;-Befehl. Verfassen Sie Fehlerberichte bitte auf Englisch. </para> </refsect1> ">
es: <!-- Boiler plate Bug reporting section --> <!ENTITY manbugs " <refsect1><title>Bugs</title> <para><ulink url='http://bugs.debian.org/src:apt'>Página de errores de APT</ulink>. Si quiere informar de un error en APT, consulte <filename>/usr/share/doc/debian/bug-reporting.txt</filename> o use la orden &reportbug;. </para> </refsect1> ">

source: <!-- Boiler plate Author section --> <!ENTITY manauthor " <refsect1><title>Author</title> <para>APT was written by the APT team <email>apt@packages.debian.org</email>. </para> </refsect1> ">
de: <!-- Vorformatierter Textblock Autor-Abschnitt --> <!ENTITY manauthor " <refsect1><title>Autor</title> <para>APT wurde vom APT-Team geschrieben <email>apt@packages.debian.org</email>. </para> </refsect1> ">
es: <!-- Boiler plate Author section --> <!ENTITY manauthor " <refsect1><title>Autor</title> <para>El equipo APT <email>apt@packages.debian.org</email> escribió apt. </para> </refsect1> ">

source: <!-- Should be used within the option section of the text to put in the blurb about -h, -v, -c and -o --> <!ENTITY apt-commonoptions " <varlistentry><term><option>-h</option></term> <term><option>--help</option></term> <listitem><para>Show a short usage summary. </para> </listitem> </varlistentry>
de: <!-- Sollte innerhalb des Abschnitts Option des Textes benutzt werden, um Informationen über -h, -v, -c und -o einzufügen --> <!ENTITY apt-commonoptions " <varlistentry><term><option>-h</option></term> <term><option>--help</option></term> <listitem><para>Ein kurze Aufrufzusammenfassung zeigen. </para> </listitem> </varlistentry>
es: <!-- Should be used within the option section of the text to put in the blurb about -h, -v, -c and -o --> <!ENTITY apt-commonoptions " <varlistentry><term><option>-h</option></term> <term><option>--help</option></term> <listitem><para>Muestra un mensaje corto sobre el uso. </para> </listitem> </varlistentry>

source: <varlistentry> <term><option>-v</option></term> <term><option>--version</option></term> <listitem><para>Show the program version. </para> </listitem> </varlistentry>
de: <varlistentry> <term><option>-v</option></term> <term><option>--version</option></term> <listitem><para>Die Version des Programms anzeigen. </para> </listitem> </varlistentry>
es: <varlistentry> <term><option>-v</option></term> <term><option>--version</option></term> <listitem><para>Muestra la versión del programa. </para> </listitem> </varlistentry>

source: <varlistentry> <term><option>-c</option></term> <term><option>--config-file</option></term> <listitem><para>Configuration File; Specify a configuration file to use. The program will read the default configuration file and then this configuration file. If configuration settings need to be set before the default configuration files are parsed specify a file with the <envar>APT_CONFIG</envar> environment variable. See &apt-conf; for syntax information. </para> </listitem> </varlistentry>
de: <varlistentry> <term><option>-c</option></term> <term><option>--config-file</option></term> <listitem><para>Konfigurationsdatei; Gibt eine Konfigurationssdatei zum Benutzen an. Das Programm wird die Vorgabe-Konfigurationsdatei und dann diese Konfigurationsdatei lesen. Falls Konfigurationseinstellungen vor der Vorgabe-Konfiguration ausgewertet werden müssen, geben Sie eine Datei der Umgebungsvariable <envar>APT_CONFIG</envar> an Lesen Sie &apt-conf;, um Syntax-Informationen zu erhalten </para> </listitem> </varlistentry>
es: <varlistentry> <term><option>-c</option></term> <term><option>--config-file</option></term> <listitem><para>Fichero de configuración: Especifica el fichero de configuración a usar. El programa leerá el fichero de configuración predeterminado y, después, este fichero de configuración. Si necesita que ciertas opciones de configuración se definan antes que el análisis de los de los ficheros de configuración predeterminados, defina un fichero con la variable de entorno <envar>APT_CONFIG</envar>. Consulte &apt-conf; para información sobre la sintaxis. </para> </listitem> </varlistentry>

source: <varlistentry> <term><option>-o</option></term> <term><option>--option</option></term> <listitem><para>Set a Configuration Option; This will set an arbitrary configuration option. The syntax is <option>-o Foo::Bar=bar</option>. <option>-o</option> and <option>--option</option> can be used multiple times to set different options. </para> </listitem> </varlistentry> ">
de: <varlistentry> <term><option>-o</option></term> <term><option>--option</option></term> <listitem><para>Eine Konfigurationsoption setzen; Dies wird eine beliebige Konfigurationsoption setzen. Die Syntax lautet <option>-o Foo::Bar=bar</option>. <option>-o</option> und <option>--option</option> kann mehrfach benutzt werden, um verschiedene Optionen zu setzen. </para> </listitem> </varlistentry> ">
es: <varlistentry> <term><option>-o</option></term> <term><option>--option</option></term> <listitem><para>Define una opción de configuración: Esto definirá una opción arbitraria de configuración. La sintaxis es <option>-o Algo::Cosa=cosa</option>. <option>-o</option> y <option>--option</option> se pueden usar varias veces para definir diferentes opciones. </para> </listitem> </varlistentry> ">

source: <!-- Should be used within the option section of the text to put in the blurb about -h, -v, -c and -o --> <!ENTITY apt-cmdblurb " <para>All command line options may be set using the configuration file, the descriptions indicate the configuration option to set. For boolean options you can override the config file by using something like <option>-f-</option>,<option>--no-f</option>, <option>-f=no</option> or several other variations. </para> ">
de: <!-- Sollte innerhalb des Abschnitts Option des Textes benutzt werden, um Informationen über -h, -v, -c und -o einzufügen --> <!ENTITY apt-cmdblurb " <para>Alle Befehlszeilenoptionen können durch die Konfigurationsdatei gesetzt werden, die Beschreibung gibt die zu setzende Option an. Für boolesche Optionen können Sie die Konfigurationsdatei überschreiben, indem Sie etwas wie <option>-f-</option>, <option>--no-f</option>, <option>-f=no</option> oder etliche weitere Varianten benutzen. </para> ">
es: <!-- Should be used within the option section of the text to put in the blurb about -h, -v, -c and -o --> <!ENTITY apt-cmdblurb " <para>Todas las opciones de la línea de órdenes se pueden definir mediante el fichero de configuración, las descripciones indican la opción de la configuración a definir. Para opciones de tipo «boolean» puede invalidar el fichero de configuración utilizando algo como <option>-f-</option>,<option>--no-f</option>, <option>-f=no</option> u otras muchas variaciones. </para> ">

source: <!ENTITY file-aptconf " <varlistentry><term><filename>/etc/apt/apt.conf</filename></term> <listitem><para>APT configuration file. Configuration Item: <literal>Dir::Etc::Main</literal>.</para></listitem> </varlistentry>
de: <!ENTITY file-aptconf " <varlistentry><term><filename>/etc/apt/apt.conf</filename></term> <listitem><para>APT-Konfigurationsdatei. Konfigurationselement: <literal>Dir::Etc::Main</literal>.</para></listitem> </varlistentry>
es: <!ENTITY file-aptconf " <varlistentry><term><filename>/etc/apt/apt.conf</filename></term> <listitem><para>Fichero de configuración de APT. Opción de configuración: <literal>Dir::Etc::Main</literal>.</para></listitem> </varlistentry>

source: <varlistentry><term><filename>/etc/apt/apt.conf.d/</filename></term> <listitem><para>APT configuration file fragments. Configuration Item: <literal>Dir::Etc::Parts</literal>.</para></listitem> </varlistentry> ">
de: <varlistentry><term><filename>/etc/apt/apt.conf.d/</filename></term> <listitem><para>APT-Konfigurationsdatei-Fragmente. Konfigurationselement: <literal>Dir::Etc::Parts</literal>.</para></listitem> </varlistentry> ">
es: <varlistentry><term><filename>/etc/apt/apt.conf.d/</filename></term> <listitem><para>Fragmentos del fichero de configuración de APT. Opción de configuración: <literal>Dir::Etc::Parts</literal>.</para></listitem> </varlistentry> ">

source: <!ENTITY file-cachearchives " <varlistentry><term><filename>&cachedir;/archives/</filename></term> <listitem><para>Storage area for retrieved package files. Configuration Item: <literal>Dir::Cache::Archives</literal>.</para></listitem> </varlistentry>
de: <!ENTITY file-cachearchives " <varlistentry><term><filename>&cachedir;/archives/</filename></term> <listitem><para>Speicherbereich für aufgerufene Paketdateien. Konfigurationselement: <literal>Dir::Cache::Archives</literal>.</para></listitem> </varlistentry>
es: <!ENTITY file-cachearchives " <varlistentry><term><filename>&cachedir;/archives/</filename></term> <listitem><para>Área de almacenamiento para los ficheros de paquetes descargados. Opción de configuración: <literal>Dir::Cache::Archives</literal>.</para></listitem> </varlistentry>

source: <varlistentry><term><filename>&cachedir;/archives/partial/</filename></term> <listitem><para>Storage area for package files in transit. Configuration Item: <literal>Dir::Cache::Archives</literal> (implicit partial). </para></listitem> </varlistentry> ">
de: <varlistentry><term><filename>&cachedir;/archives/partial/</filename></term> <listitem><para>Speicherbereich für Paketdateien auf dem Transportweg. Konfigurationselement: <literal>Dir::Cache::Archives</literal> (implizit teilweise). </para></listitem> </varlistentry> ">
es: <varlistentry><term><filename>&cachedir;/archives/partial/</filename></term> <listitem><para>Área de almacenamiento para los ficheros de paquete en tránsito. Opción de configuración: <literal>Dir::Cache::Archives</literal> (parcialmente implícito). </para></listitem> </varlistentry> ">

source: <!ENTITY file-preferences " <varlistentry><term><filename>/etc/apt/preferences</filename></term> <listitem><para>Version preferences file. This is where you would specify &quot;pinning&quot;, i.e. a preference to get certain packages from a separate source or from a different version of a distribution. Configuration Item: <literal>Dir::Etc::Preferences</literal>.</para></listitem> </varlistentry>
de: <!ENTITY file-preferences " <varlistentry><term><filename>/etc/apt/preferences</filename></term> <listitem><para>Version-Einstellungsdatei. Hier können Sie &quot;pinning&quot; angeben, d.h. eine Einstellung, um bestimmte Pakete aus einer separaten Quelle oder von einer anderen Version einer Distribution zu erhalten. Konfigurationselement: <literal>Dir::Etc::Preferences</literal>.</para></listitem> </varlistentry>
es: <!ENTITY file-preferences " <varlistentry><term><filename>/etc/apt/preferences</filename></term> <listitem><para>Ficheros de preferencias de versión. Aquí puede especificar el anclaje (&quot;pinning&quot;), una preferencia para conseguir ciertos paquetes a partir de una fuente diferente o de una versión diferente de una distribución. Opción de configuración: <literal>Dir::Etc::Preferences</literal>.</para></listitem> </varlistentry>

source: <varlistentry><term><filename>/etc/apt/preferences.d/</filename></term> <listitem><para>File fragments for the version preferences. Configuration Item: <literal>Dir::Etc::PreferencesParts</literal>.</para></listitem> </varlistentry> ">
de: <varlistentry><term><filename>/etc/apt/preferences.d/</filename></term> <listitem><para>Dateifragmente für die Versionseinstellungen. Konfigurationselement: <literal>Dir::Etc::PreferencesParts</literal>.</para></listitem> </varlistentry> ">
es: <varlistentry><term><filename>/etc/apt/preferences.d/</filename></term> <listitem><para>Fragmentos de fichero para las preferencias de la versión. Opción de configuración: <literal>Dir::Etc::PreferencesParts</literal>.</para></listitem> </varlistentry> ">

source: <!ENTITY file-sourceslist " <varlistentry><term><filename>/etc/apt/sources.list</filename></term> <listitem><para>Locations to fetch packages from. Configuration Item: <literal>Dir::Etc::SourceList</literal>.</para></listitem> </varlistentry>
de: <!ENTITY file-sourceslist " <varlistentry><term><filename>/etc/apt/sources.list</filename></term> <listitem><para>Orte, von denen Pakete geladen werden. Konfigurationselement: <literal>Dir::Etc::SourceList</literal>.</para></listitem> </varlistentry>
es: <!ENTITY file-sourceslist " <varlistentry><term><filename>/etc/apt/sources.list</filename></term> <listitem><para>Ubicaciones de dónde conseguir los paquetes. Opción de configuración: <literal>Dir::Etc::SourceList</literal>.</para></listitem> </varlistentry>

source: <varlistentry><term><filename>/etc/apt/sources.list.d/</filename></term> <listitem><para>File fragments for locations to fetch packages from. Configuration Item: <literal>Dir::Etc::SourceParts</literal>.</para></listitem> </varlistentry> ">
de: <varlistentry><term><filename>/etc/apt/sources.list.d/</filename></term> <listitem><para>Dateifragmente für Orte, von denen Pakete geladen werden. Konfigurationselement: <literal>Dir::Etc::SourceParts</literal>.</para></listitem> </varlistentry> ">
es: <varlistentry><term><filename>/etc/apt/sources.list.d/</filename></term> <listitem><para>Fragmentos de fichero para las ubicaciones de dónde descargar los paquetes. Opción de configuración: <literal>Dir::Etc::SourceParts</literal>.</para></listitem> </varlistentry> ">

source: <!ENTITY file-statelists " <varlistentry><term><filename>&statedir;/lists/</filename></term> <listitem><para>Storage area for state information for each package resource specified in &sources-list; Configuration Item: <literal>Dir::State::Lists</literal>.</para></listitem> </varlistentry>
de: <!ENTITY file-statelists " <varlistentry><term><filename>&statedir;/lists/</filename></term> <listitem><para>Speicherbereich für Statusinformationen jeder in &sources-list; angegebenen Paketquelle Konfigurationselement: <literal>Dir::State::Lists</literal>.</para></listitem> </varlistentry>
es: <!ENTITY file-statelists " <varlistentry><term><filename>&statedir;/lists/</filename></term> <listitem><para>Área de almacenamiento para la información del estado de cada fuente de paquetes especificado en &sources-list; Opción de configuración: <literal>Dir::State::Lists</literal>.</para></listitem> </varlistentry>

source: <varlistentry><term><filename>&statedir;/lists/partial/</filename></term> <listitem><para>Storage area for state information in transit. Configuration Item: <literal>Dir::State::Lists</literal> (implicit partial).</para></listitem> </varlistentry> ">
de: <varlistentry><term><filename>&statedir;/lists/partial/</filename></term> <listitem><para>Speicherbereich für Statusinformationen auf dem Transportweg. Konfigurationselement: <literal>Dir::State::Lists</literal> (implizit teilweise).</para></listitem> </varlistentry> ">
es: <varlistentry><term><filename>&statedir;/lists/partial/</filename></term> <listitem><para>Área de almacenamiento para la información del estado en tránsito. Opción de configuración: <literal>Dir::State::Lists</literal> (parcialmente implícito).</para></listitem> </varlistentry> ">

source: <!ENTITY file-trustedgpg " <varlistentry><term><filename>/etc/apt/trusted.gpg</filename></term> <listitem><para>Keyring of local trusted keys, new keys will be added here. Configuration Item: <literal>Dir::Etc::Trusted</literal>.</para></listitem> </varlistentry>
de: <!ENTITY file-trustedgpg " <varlistentry><term><filename>/etc/apt/trusted.gpg</filename></term> <listitem><para>Schlüsselbund lokaler vertrauenswürdiger Schlüssel, neue Schlüssel werden hier hinzugefügt. Konfigurationselement: <literal>Dir::Etc::Trusted</literal>.</para></listitem> </varlistentry>
es: <!ENTITY file-trustedgpg " <varlistentry><term><filename>/etc/apt/trusted.gpg</filename></term> <listitem><para>Registro de claves de las claves locales de confianza, las claves nuevas se añadirán aquí. Elemento de configuración: <literal>Dir::Etc::Trusted</literal>.</para></listitem> </varlistentry>

source: <varlistentry><term><filename>/etc/apt/trusted.gpg.d/</filename></term> <listitem><para>File fragments for the trusted keys, additional keyrings can be stored here (by other packages or the administrator). Configuration Item <literal>Dir::Etc::TrustedParts</literal>.</para></listitem> </varlistentry> ">
de: <varlistentry><term><filename>/etc/apt/trusted.gpg.d/</filename></term> <listitem><para>Dateifragmente für vertrauenswürdige Schlüssel, zusätzliche Schlüsselbunde können hier (von anderen Paketen oder dem Administrator) gespeichert werden. Konfigurationselement: <literal>Dir::Etc::TrustedParts</literal>.</para></listitem> </varlistentry> ">
es: <varlistentry><term><filename>/etc/apt/trusted.gpg.d/</filename></term> <listitem><para>Fragmentos de fichero de claves de confianza, se pueden añadir en este directorio registros de claves adicionales (por otros paquetes o el administrador. Elemento de configuración: <literal>Dir::Etc::TrustedParts</literal>.</para></listitem> </varlistentry> ">

source: <!ENTITY file-extended_states " <varlistentry><term><filename>/var/lib/apt/extended_states</filename></term> <listitem><para>Status list of auto-installed packages. Configuration Item: <literal>Dir::State::extended_states</literal>. </para></listitem> </varlistentry> ">
de: <!ENTITY file-extended_states " <varlistentry><term><filename>/var/lib/apt/extended_states</filename></term> <listitem><para>Statusliste automatisch installierter Pakete. Konfigurationselement: <literal>Dir::State::extended_states</literal>. </para></listitem> </varlistentry> ">
es: <!ENTITY file-extended_states " <varlistentry><term><filename>/var/lib/apt/extended_states</filename></term> <listitem><para>Lista de estado de paquetes automáticamente instalados. Elemento de configuración: <literal>Dir::State::extended_states</literal>. </para></listitem> </varlistentry> ">

source: <!-- TRANSLATOR: This is the section header for the following paragraphs - comparable to the other headers like NAME and DESCRIPTION and should therefore be uppercase. --> <!ENTITY translation-title "TRANSLATION">
de: <!ENTITY translation-title "ÜBERSETZUNG">
es: <!-- TRANSLATOR: This is the section header for the following paragraphs - comparable to the other headers like NAME and DESCRIPTION and should therefore be uppercase. --> <!ENTITY translation-title "TRADUCCIÓN">
