Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: All of the settings defined in the <literal>TreeDefault</literal> section can be use in a <literal>Tree</literal> section as well as three new variables.
de: Alle im <literal>TreeDefault</literal>-Abschnitt definierten Einstellungen können in einem <literal>Tree</literal>-Abschnitt, sowie als drei neue Variablen benutzt werden.
es: Todos los valores definidos en la sección <literal>TreeDefault</literal> se pueden usar en la sección <literal>Tree</literal>, así como tres nuevas variables.

source: for i in Sections do for j in Architectures do Generate for DIST=scope SECTION=i ARCH=j
de: for i in Abschnitte do for j in Architekturen do Generiere for DIST=Geltungsbereich SECTION=i ARCH=j
es: for i in Sections do for j in Architectures do Generar con DIST=scope SECTION=i ARCH=j

source: When processing a <literal>Tree</literal> section <command>apt-ftparchive</command> performs an operation similar to: <placeholder type="programlisting" id="0"/>
de: Wenn ein <literal>Tree</literal>-Abschnitt bearbeitet wird, führt <command>apt-ftparchive</command> eine Operation aus, die folgender ähnelt:<placeholder type="programlisting" id="0"/>
es: Cuando se procesa una sección <literal>Tree</literal> <command>apt-ftparchive</command> realiza una operación similar a la siguiente: <placeholder type="programlisting" id="0"/>

source: Sections
de: Abschnitte
es: Secciones

source: This is a space separated list of sections which appear under the distribution, typically this is something like <literal>main contrib non-free</literal>
de: Dies ist eine durch Leerzeichen getrennte Liste der Abschnitte, die unter der Distribution erscheint, typischerweise etwas wie <literal>main contrib non-free</literal>
es: Es una lista de secciones separadas por espacios que aparecen bajo la distribución, generalmente es similar a <literal>main contrib non-free</literal>.

source: Architectures
de: Architekturen
es: Arquitecturas

source: This is a space separated list of all the architectures that appear under search section. The special architecture 'source' is used to indicate that this tree has a source archive.
de: Dies ist eine durch Leerzeichen getrennte Liste aller Architekturen, die unter dem Suchabschnitt erscheinen. Die spezielle Architektur »source« wird benutzt, um anzugeben, dass dieser Baum ein Quellarchiv besitzt.
es: Es una lista de todas las arquitecturas separadas por espacios que aparecen bajo la sección de búsqueda. La arquitectura especial «source» se usa para indicar que este árbol tiene un fichero de fuentes.

source: Sets the binary override file. The override file contains section, priority and maintainer address information.
de: Setzt die Programm-Override-Datei. Die Override-Datei enthält Abschnitt, Priorität und Adressinformationen des Betreuers.
es: Define el fichero binario alternativo. Éste contiene la información sobre la sección, la prioridad y la dirección del mantenedor.

source: Sets the source override file. The override file contains section information.
de: Setzt die Quell-Override-Datei. Die Override-Datei enthält Abschnittsinformationen.
es: Define el fichero de fuentes alternativo. Éste contiene la información sobre la sección.

source: Sets the binary extra override file.
de: Setzt die zusätzliche Programm-Override-Datei.
es: Define el fichero binario alternativo adicional.

source: Sets the source extra override file.
de: Setzt die zusätzliche Quell-Override-Datei.
es: Define el fichero de fuentes alternativo adicional.

source: BinDirectory Section
de: BinDirectory-Abschnitt
es: Sección BinDirectory

source: The <literal>bindirectory</literal> section defines a binary directory tree with no special structure. The scope tag specifies the location of the binary directory and the settings are similar to the <literal>Tree</literal> section with no substitution variables or <literal>Section</literal><literal>Architecture</literal> settings.
de: Der <literal>bindirectory</literal>-Abschnitt definiert einen Programmverzeichnisbaum ohne spezielle Struktur. Die scope-Markierung gibt den Ort des Programmverzeichnisses an und die Einstellungen sind denen des <literal>Tree</literal>-Abschnitts ohne Platzhaltervariablen oder <literal>Abschnitt</literal><literal>Architektur</literal> ähnlich.
es: La sección <literal>bindirectory</literal> define un directorio binario sin ningún tipo de estructura especial. El ámbito de la etiqueta define la ubicación del directorio binario, la configuración es similar a la sección <literal>Tree</literal> sin sustituir las variables o la configuración de <literal>Section</literal><literal>Architecture</literal>.

source: Sets the Packages file output.
de: Setzt die Packages-Dateiausgabe.
es: Define el fichero «Packages» de salida.

source: Sets the Sources file output. At least one of <literal>Packages</literal> or <literal>Sources</literal> is required.
de: Setzt die Sources-Dateiausgabe. Entweder <literal>Packages</literal> oder <literal>Sources</literal> ist erforderlich.
es: Define el fichero «Sources» de salida. Es necesario al menos un fichero <literal>Packages</literal> o <literal>Sources</literal>.

source: Sets the Contents file output. (optional)
de: Setzt die Contents-Dateiausgabe. (optional)
es: Define el fichero «Contents» de salida. (Opcional)

source: Sets the binary override file.
de: Setzt die Programm-Override-Datei.
es: Define el fichero binario alternativo.

source: Sets the source override file.
de: Setzt die Quell-Override-Datei.
es: Define el fichero de fuentes alternativo.

source: Sets the cache DB.
de: Setzt die Zwischenspeicherdatenbank.
es: Define la base de datos de la caché.

source: Appends a path to all the output paths.
de: Hängt einen Pfad an alle Ausgabepfade an.
es: Añade una ruta a todas las rutas de salida.

source: Specifies the file list file.
de: Gibt die Dateilistendatei an.
es: Define el fichero de la lista de ficheros.

source: The Binary Override File
de: Die Programm-Override-Datei
es: El fichero binario alternativo

source: The binary override file is fully compatible with &dpkg-scanpackages;. It contains 4 fields separated by spaces. The first field is the package name, the second is the priority to force that package to, the third is the the section to force that package to and the final field is the maintainer permutation field.
de: Die Programm-Override-Datei ist vollständig zu &dpkg-scanpackages; kompatibel. Sie enthält vier durch Leerzeichen getrennte Felder. Das erste Feld ist der Paketname, das zweite ist die Priorität zu der das Paket erzwungen wird, das dritte ist der Abschnittzu der das Paket erzwungen wird und das letzte Feld ist das Betreuerumsetzungsfeld.
es: El fichero binario alternativo es totalmente compatible con &dpkg-scanpackages;. Contiene cuatro campos separados por espacios. El primero es el nombre del paquete, el segundo la prioridad asignada el paquete, el tercero es la sección a la que se fuerza el paquete y el último es el campo de permutación del mantenedor.

source: old [// oldn]* => new
de: alt [// oldn]* => neu
es: antigua [// antigua-n]* => nueva

source: new
de: neu
es: nueva

source: The general form of the maintainer field is: <placeholder type="literallayout" id="0"/> or simply, <placeholder type="literallayout" id="1"/> The first form allows a double-slash separated list of old email addresses to be specified. If any of those are found then new is substituted for the maintainer field. The second form unconditionally substitutes the maintainer field.
de: Die allgemeine Form des Betreuerfelds ist: <placeholder type="literallayout" id="0"/> oder einfach <placeholder type="literallayout" id="1"/>. Die erste Form erlaubt es, eine durch Doppelschrägstrich getrennte Liste alter E-Mail-Adressen anzugegeben. Wenn eine davon gefunden wird, wird die neue für das Betreuerfeld ersetzt. Die zweite Form ersetzt das Betreuerfeld bedingungslos.
es: La forma general del campo del mantenedor es: <placeholder type="literallayout" id="0"/> o simplemente <placeholder type="literallayout" id="1"/> La primera forma permite una lista separada por barras dobles de las direcciones de correo electrónico antiguas a definir. Si se encuentra cualquier de ellas «nueva» se sustituye por el campo del mantenedor. La segunda forma sustituye de forma incondicional el campo del mantenedor.

source: The Source Override File
de: Die Quell-Override-Datei
es: El fichero de fuentes alternativo

source: The source override file is fully compatible with &dpkg-scansources;. It contains 2 fields separated by spaces. The first fields is the source package name, the second is the section to assign it.
de: Die Quell-Override-Datei ist vollständig kompatibel zu &dpkg-scansources;. Sie enthält zwei durch Leerzeichen getrennte Felder. Das erste Feld ist der Quellpaketname, das zweite ist der Abschnitt, dem er zugeordnet ist.
es: El fichero de fuentes alternativo es totalmente compatible con &dpkg-scansources;. Contiene dos campos separados por espacios. El primero es el nombre del paquete fuente, el segundo es la sección a la que se asignará.

source: The Extra Override File
de: Die zusätzlich Override-Datei
es: El fichero alternativo adicional

source: The extra override file allows any arbitrary tag to be added or replaced in the output. It has 3 columns, the first is the package, the second is the tag and the remainder of the line is the new value.
de: Die zusätzlich Override-Datei erlaubt jeder beliebigen Markierung zur Ausgabe hinzugefügt oder darin ersetzt zu werden. Sie hat drei Spalten. Die erste ist das Paket, die zweite ist die Markierung und der Rest der Zeile ist der neue Wert.
es: El fichero alternativo adicional permite añadir o reemplazar en la salida cualquier etiqueta arbitraria. Tiene tres columnas, la primera es el paquete, la segunda es la etiqueta y el resto de la línea es el nuevo valor.

source: Use a binary caching DB. This has no effect on the generate command. Configuration Item: <literal>APT::FTPArchive::DB</literal>.
de: Benutzt eine Programmzwischenspeicherdatenbank. Dies hat keine Auswirkung auf den »generate«-Befehl. Konfigurationselement: <literal>APT::FTPArchive::DB</literal>.
es: Usa una base de datos binaria para la caché. Ésto no afecta a la orden «generate». Opción de configuración: <literal>APT::FTPArchive::DB</literal>.

source: Quiet; produces output suitable for logging, omitting progress indicators. More q's will produce more quiet up to a maximum of 2. You can also use <option>-q=#</option> to set the quiet level, overriding the configuration file. Configuration Item: <literal>quiet</literal>.
de: Still; erzeugt eine Ausgabe, die für Protokollierung geeignet ist und Fortschrittsanzeiger weglässt. Mehr »q«s unterdrücken mehr Ausgaben, bis zu einem Maximum von 2. Sie können außerdem <option>-q=#</option> benutzen, um die Stillestufe zu setzen, was die Konfigurationsdatei überschreibt. Konfigurationselement: <literal>quiet</literal>.
es: Silencioso, produce una salida adecuada para su almacenamiento, omitiendo los indicadores de progreso. Más letras «q» producen una salida más silenciosa, hasta un máximo de dos letras. Además, es posible usar <option>-q=#</option> para ajustar el nivel de silencio, ignorando el fichero de configuración. Opción de configuración: <literal>quiet</literal>.

source: Perform Delinking. If the <literal>External-Links</literal> setting is used then this option actually enables delinking of the files. It defaults to on and can be turned off with <option>--no-delink</option>. Configuration Item: <literal>APT::FTPArchive::DeLinkAct</literal>.
de: Führt Delinking aus. Wenn die <literal>External-Links</literal>-Einstellung benutzt wird, schaltet diese Option das Delinking zu Dateien ein. Standardmäßig ist es an und kann mit <option>--no-delink</option> ausgeschaltet werden. Konfigurationselement: <literal>APT::FTPArchive::DeLinkAct</literal>.
es: Realiza el desenlazado. Esta opción activa el desenlazado de los ficheros si se usa la opción <literal>External-Links</literal>. Esta activa de forma predeterminada y se puede desactivar mediante <option>--no-delink</option>. Opción de configuración: <literal>APT::FTPArchive::DeLinkAct</literal>.

source: Perform contents generation. When this option is set and package indexes are being generated with a cache DB then the file listing will also be extracted and stored in the DB for later use. When using the generate command this option also allows the creation of any Contents files. The default is on. Configuration Item: <literal>APT::FTPArchive::Contents</literal>.
de: Führt Inhaltsgenerierung durch. Wenn diese Option gesetzt ist und Paketindizes mit einer Zwischenspeicherdatenbank generiert werden, dann wird die Dateiliste auch extrahiert und für spätere Benutzung in der Datenbank gespeichert. Wenn der »generate«-Befehl benutzt wird, erlaubt diese Option außerdem die Erzeugung beliebiger Contents-Dateien. Die Vorgabe ist an. Konfigurationselement: <literal>APT::FTPArchive::Contents</literal>.
es: Realiza la generación de «contents». Cuando se usa esta opción y los índices de los paquetes se están generando con una base de datos de la caché, el listado de los ficheros se extraerá también y se almacenará en la base de datos para su uso posterior. Cuando se usa la orden «generate» esta opción también permite la creación de cualquier fichero «Contents». Esta activa de forma predeterminada. Opción de configuración: <literal>APT::FTPArchive::Contents</literal>.

source: Select the source override file to use with the <literal>sources</literal> command. Configuration Item: <literal>APT::FTPArchive::SourceOverride</literal>.
de: Wählt die Quell-Override-Datei, die mit dem <literal>sources</literal>-Befehl benutzt wird. Konfigurationselement: <literal>APT::FTPArchive::SourceOverride</literal>.
es: Selecciona el fichero de fuentes alternativo a usar con la orden <literal>sources</literal>. Opción de configuración: <literal>APT::FTPArchive::SourceOverride</literal>.

source: Make the caching databases read only. Configuration Item: <literal>APT::FTPArchive::ReadOnlyDB</literal>.
de: Gibt der Zwischenspeicherdatenbank nur Lesezugriff. Konfigurationselement: <literal>APT::FTPArchive::ReadOnlyDB</literal>.
es: Define los permisos de las bases de datos de la caché como sólo lectura. Opción de configuración: <literal>APT::FTPArchive::ReadOnlyDB</literal>.

source: Accept in the <literal>packages</literal> and <literal>contents</literal> commands only package files matching <literal>*_arch.deb</literal> or <literal>*_all.deb</literal> instead of all package files in the given path. Configuration Item: <literal>APT::FTPArchive::Architecture</literal>.
de: In den Befehlen <literal>packages</literal> und <literal>contents</literal> nur Paketdateien akzeptieren, die auf <literal>*_arch.deb</literal> oder <literal>*_all.deb</literal> passen, anstatt aller Paketdateien im angegebenen Pfad. Konfigurationselement: <literal>APT::FTPArchive::Architecture</literal>.
es: Hace que las órdenes <literal>packages</literal> y <literal>contents</literal> sólo acepten aquellos paquetes que coinciden con <literal>*_arch.deb</literal> o <literal>*_all.deb</literal>, en lugar de todos los ficheros de paquete en la ruta dada. Elemento de configuración: <literal>APT::FTPArchive::Architecture</literal>.

source: &apt-ftparchive; caches as much as possible of metadata in a cachedb. If packages are recompiled and/or republished with the same version again, this will lead to problems as the now outdated cached metadata like size and checksums will be used. With this option enabled this will no longer happen as it will be checked if the file was changed. Note that this option is set to "<literal>false</literal>" by default as it is not recommend to upload multiply versions/builds of a package with the same versionnumber, so in theory nobody will have these problems and therefore all these extra checks are useless.
de: &apt-ftparchive; speichert so viele Metadaten wie möglich in einer Zwischenspeicherdatenbank. Falls Pakete neu kompiliert und/oder neu mit der gleichen Version veröffentlicht werden, führt dies zu Problemen, da die nun veralteten zwischengespeicherten Metadaten, wie Größe und Prüfsumme benutzt werden. Mit dieser eingeschalteten Option wird dies nicht weiter vorkommen, da geprüft wird, ob die Datei geändert wurde. Beachten Sie, dass diese Option standardmäßig auf »<literal>false</literal>« gesetzt ist, da es nicht empfohlen wird, mehrere Versionen/Builds eines Pakets mit der gleichen Versionsnummer hochzuladen, so dass theoretisch niemand dieses Probleme haben sollte und all diese zusätzlichen Prüfungen daher nutzlos sind.
es: &apt-ftparchive; almacena tantos metadatos como sea posible en una base de datos de almacenamiento. Si los paquetes se recompilan o publican otra vez con la misma versión aparecerán problemas ya que se usarán los metadatos almacenados y ahora obsoletos tales como el tamaño o la suma de control. Esta situación se evitará si se activa esta opción ya que se comprobará si el fichero ha cambiado. Tenga en cuenta que esta opción está definida como «<literal>false</literal>» por omisión, ya que no se recomienda subir varias versiones o compilaciones de un paquete con el mismo número de versión, así que en teoría nadie debería tener problemas y por ello todas estas comprobaciones adicionales son innecesarias.

source: This configuration option defaults to "<literal>true</literal>" and should only be set to <literal>"false"</literal> if the Archive generated with &apt-ftparchive; also provides <filename>Translation</filename> files. Note that the <filename>Translation-en</filename> master file can only be created in the generate command.
de: Diese Konfigurationsoption ist standardmäßig »<literal>true</literal>« und sollte nur auf »<literal>false</literal>« gesetzt werden, wenn das mit &apt-ftparchive; generierte Archiv außerdem <filename>Translation</filename>-Dateien bereitstellt. Beachten Sie, dass die Hauptdatei <filename>Translation-en</filename> nur durch den Befehl »generate« erstellt werden kann.
es: De forma predeterminada esta opción de configuración se define como «<literal>true</literal>» y sólo se debería definir como «<literal>false</literal>» si el archivo de paquetes generado con &apt-ftparchive; también proporciona ficheros <filename>Translation</filename>. Tenga en cuenta que el fichero maestro <filename>Translation-en</filename> sólo se puede crear con la orden «generate».

source: Examples
de: Beispiele
es: Ejemplos

source: <command>apt-ftparchive</command> packages <replaceable>directory</replaceable> | <command>gzip</command> > <filename>Packages.gz</filename>
de: <command>apt-ftparchive</command> Pakete <replaceable>Verzeichnis</replaceable> | <command>gzip</command> > <filename>Pakete.gz</filename>
es: <command>apt-ftparchive</command> packages <replaceable>directorio</replaceable> | <command>gzip</command> > <filename>Packages.gz</filename>

source: To create a compressed Packages file for a directory containing binary packages (.deb): <placeholder type="programlisting" id="0"/>
de: Um eine gepackte Paketdatei für ein Verzeichnis zu erstellen, das Programmpakete (.deb) enthält: <placeholder type="programlisting" id="0"/>
es: Para crear un fichero «Packages» comprimido para un directorio que contenga paquetes binarios («.deb»): <placeholder type="programlisting" id="0"/>

source: <command>apt-ftparchive</command> returns zero on normal operation, decimal 100 on error.
de: <command>apt-ftparchive</command> gibt bei normalen Operationen 0 zurück, dezimal 100 bei Fehlern.
es: <command>apt-ftparchive</command> devuelve cero si no hay ningún error, y el valor 100 en caso de error.

source: &apt-author.jgunthorpe; &apt-author.team; &apt-email; &apt-product; <date>08 November 2008</date>
de: &apt-author.jgunthorpe; &apt-author.team; &apt-email; &apt-product; <date>8. November 2008</date>
es: &apt-author.jgunthorpe; &apt-author.team; &apt-email; &apt-product; <date>08 de Noviembre de 2008</date>

source: APT package handling utility -- command-line interface
de: APT-Werkzeug für den Umgang mit Paketen -- Befehlszeilenschnittstelle
es: Herramienta de gestión de paquetes APT -- interfaz para la línea de órdenes

source: <command>apt-get</command> is the command-line tool for handling packages, and may be considered the user's "back-end" to other tools using the APT library. Several "front-end" interfaces exist, such as &dselect;, &aptitude;, &synaptic; and &wajig;.
de: <command>apt-get</command> ist ein Befehlszeilenwerkzeug zur Handhabung von Paketen und könnte als »Backend« anderer Werkzeugen betrachtet werden, die die APT-Bibliothek benutzen. Es existieren mehrere Oberflächenschnittstellen, wie &dselect;, &aptitude;, &synaptic; und &wajig;.
es: <command>apt-get</command> es la herramienta para la gestión de paquetes desde la línea de órdenes, y se puede considerar el sistema de «bajo nivel» de otras herramientas de usuario que usan la biblioteca de APT. Existen varias interfaces de «alto nivel», tales como &dselect;, &aptitude;, &synaptic; y &wajig;.

source: <literal>update</literal> is used to resynchronize the package index files from their sources. The indexes of available packages are fetched from the location(s) specified in <filename>/etc/apt/sources.list</filename>. For example, when using a Debian archive, this command retrieves and scans the <filename>Packages.gz</filename> files, so that information about new and updated packages is available. An <literal>update</literal> should always be performed before an <literal>upgrade</literal> or <literal>dist-upgrade</literal>. Please be aware that the overall progress meter will be incorrect as the size of the package files cannot be known in advance.
de: <literal>update</literal> wird benutzt, um die Paketindexdatei wieder mit ihren Quellen zu synchronisieren. Die Indizes verfügbarer Pakete werden von den in <filename>/etc/apt/sources.list</filename> angegebenen Orten geladen. Wenn Sie zum Beispiel ein Debian-Archiv benutzen, erneuert dieser Befehl die <filename>Packages.gz</filename>-Dateien und wertet sie aus, so dass Informationen über neue und aktualisierte Pakete verfügbar sind. Ein <literal>update</literal> sollte immer vor einem <literal>upgrade</literal> oder <literal>dist-upgrade</literal> ausgeführt werden. Bitte seien Sie sich bewusst, dass die Gesamtfortschrittsanzeige nicht richtig sein wird, da die Größe der Pakete nicht im voraus bekannt ist.
es: <literal>update</literal> se usa para sincronizar el índice de paquetes desde sus fuentes. Los índices de paquetes disponibles se obtienen de los lugares especificados en <filename>/etc/apt/sources.list</filename>. Por ejemplo, cuando se usa un archivo de Debian, esta orden descarga y analiza los ficheros <filename>Packages.gz</filename>, de tal forma que la información acerca de los nuevos paquetes pasa a estar disponible. Siempre se debe realizar un <literal>update</literal> antes de un <literal>upgrade</literal> o un <literal>dist-upgrade</literal>. Tenga en cuenta que el indicador de progreso será incorrecto, ya que se desconoce de antemano el tamaño de los archivos de paquete.
