Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: The configuration file should tell APT to store its files on the disc and to use the configuration files on the disc as well. The sources.list should contain the proper sites that you wish to use from the remote machine, and the status file should be a copy of <em>/var/lib/dpkg/status</em> from the <em>target host</em>. Please note, if you are using a local archive you must use copy URIs, the syntax is identical to file URIs.
de: Die Konfigurationsdatei sollte APT mitteilen, dass es seine Dateien auf der Platte speichert und obendrein die Konfigurationsdateien auf der Platte benutzt. Die »sources.list« sollte genau die Sites enthalten, die Sie auf der fernen Maschine benutzen möchten und die Statusdatei sollte eine Kopie von <em>/var/lib/dpkg/status</em> vom <em>Zielrechner</em> sein. Bitte beachten Sie, falls Sie lokale Archive benutzen, dass Sie »copy«-URIs benutzen müssen. Die Syntax entspricht der von »file«-URIs.
es: El fichero de configuración debería hacer que APT guarde los ficheros en el disco, así como usar los ficheros de configuración en el disco. El fichero «sources.list» debería contener los sitios apropiados que desea usar desde el sistema remoto, y el fichero de estado debería ser una copia de <em>/var/lib/dpkg/status</em> del <em>sistema destino</em>. Tenga en cuenta que si usa un archivo local debe usar la URI «copy», de idéntica sintaxis a la URI «file».

source: <em>apt.conf</em> must contain the necessary information to make APT use the disc:
de: <em>apt.conf</em> muss die nötigen Informationen enthalten, damit APT die Platte benutzt:
es: <em>apt-conf</em> debe contener toda la información necesaria para que APT use el disco:

source: APT { /* This is not necessary if the two machines are the same arch, it tells the remote APT what architecture the target machine is */ Architecture "i386"; Get::Download-Only "true"; }; Dir { /* Use the disc for state information and redirect the status file from the /var/lib/dpkg default */ State "/disc/"; State::status "status"; // Binary caches will be stored locally Cache::archives "/disc/archives/"; Cache "/tmp/"; // Location of the source list. Etc "/disc/"; };
de: APT { /* Dies ist nicht nötig, falls die beiden Maschinen die gleiche Architektur haben. Es teilt dem fernen APT mit, welche Architektur die Zielmaschine hat */ Architecture "i386"; Get::Download-Only "true"; }; Dir { /* Die Platte für Statusinformationen benutzen und die Statusdatei umleiten von /var/lib/dpkg default */ State "/disc/"; State::status "status"; // Programmzwischenspeicher werden lokal gespeichert Cache::archives "/disc/archives/"; Cache "/tmp/"; // Ort der Quellenliste. Etc "/disc/"; };
es: APT { /* Esto no es necesario si ambos sistemas tienen la misma arquitectura, informa al APT remoto la arquitectura del sistema destino */ Architecture "i386"; Get::Download-Only "true"; }; Dir { /* Use el disco para información de estado y redireccionar el fichero de estado desde el valor predeterminado «/var/lib/dpkg» */ State "/disc/"; State::status "status"; // Los cachés binarios se guardan localmente Cache::archives "/disc/archives/"; Cache "/tmp/"; // Ubicación del fichero de fuentes. Etc "/disc/"; };

source: More details can be seen by examining the apt.conf man page and the sample configuration file in <em>/usr/share/doc/apt/examples/apt.conf</em>.
de: Weitere Details finden sich in der apt.conf-Handbuchseite und der Musterkonfigurationsdatei in <em>/usr/share/doc/apt/examples/apt.conf</em>.
es: Para más detalles vea la página de manual y el fichero de configuración de ejemplo en <em>/usr/share/doc/apt/examples/apt.conf</em>.

source: On the target machine the first thing to do is mount the disc and copy <em>/var/lib/dpkg/status</em> to it. You will also need to create the directories outlined in the Overview, <em>archives/partial/</em> and <em>lists/partial/</em>. Then take the disc to the remote machine and configure the sources.list. On the remote machine execute the following:
de: Das Erste, was auf der Zielmaschine getan werden muss, ist das Einhängen der Platte und das Kopieren von <em>/var/lib/dpkg/status</em> dorthin. Sie werden außerdem die in der Übersicht umrissenen Verzeichnisse <em>archives/partial/</em> und <em>lists/partial/</em> erstellen müssen. Dann bringen Sie die Platte zu der fernen Maschine und konfigurieren Sie die »sources.list«. Führen Sie das folgende aus:
es: Lo primero que debe hacer en el sistema destino es montar el disco y guardar en él una copia de <em>/var/lib/dpkg/status</em>. También debe crear los directorios definidos en el Resumen, <em>archives/partial/</em> y <em>lists/partial/</em>. Después, lleve el disco hasta el sistema remoto y configure «sources.list». Ejecute lo siguiente en el sistema remoto:

source: # export APT_CONFIG="/disc/apt.conf" # apt-get update [ APT fetches the package files ] # apt-get dist-upgrade [ APT fetches all the packages needed to upgrade the target machine ]
de: # export APT_CONFIG="/disc/apt.conf" # apt-get update [ APT lädt die Paketdateien herunter ] # apt-get dist-upgrade [ APT lädt all die Pakete herunter, die die Zielmaschine benötigt, um ein Upgrade durchzuführen ]
es: # export APT_CONFIG="/disc/apt.conf" # apt-get update [ APT obtiene los ficheros de paquete ] # apt-get dist-upgrade [ APT obtiene todos los paquetes necesarios para actualizar el sistema destino ]

source: The dist-upgrade command can be replaced with any other standard APT commands, particularly dselect-upgrade. You can even use an APT front end such as <em>dselect</em>. However this presents a problem in communicating your selections back to the local computer.
de: Der Befehl »dist-upgrade« kann durch alle anderen Standard-APT-Befehle ersetzt werden, insbesondere »dselect-upgrade«. Sie können sogar eine APT-Oberfläche, wie <em>dselect</em>, benutzen. Jedoch stellt dies ein Problem dar, Ihre Auswahl zurück an den lokalen Rechner zu kommunizieren.
es: Puede reemplazar la orden «dist-upgrade» con cualquiera otra orden estándar de APT, en especial «dselect-upgrade». Incluso puede usar una interfaz de APT como <em>dselect</em>. Sin embargo, esto presenta un problema al informar después de sus selecciones al sistema remoto.

source: Now the disc contains all of the index files and archives needed to upgrade the target machine. Take the disc back and run:
de: Nun enthält die Platte alle Indexdateien und Archive, die nötig sind, um ein Upgrade der Zielmaschine druchzuführen. Bringen Sie die Platte zurück und starten Sie:
es: Ahora el disco contiene todos los ficheros de índice y archivo necesarios para actualizar el sistema destino. Inserte el disco otra vez y ejecute:

source: # export APT_CONFIG="/disc/apt.conf" # apt-get check [ APT generates a local copy of the cache files ] # apt-get --no-d -o dir::state::status=/var/lib/dpkg/status dist-upgrade [ Or any other APT command ]
de: # export APT_CONFIG="/disc/apt.conf" # apt-get check [ APT generiert eine lokale Kopie der Zwischenspeicherdateien ] # apt-get --no-d -o dir::state::status=/var/lib/dpkg/status dist-upgrade [ Oder irgendeinen anderen APT-Befehl ]
es: # export APT_CONFIG="/disc/apt.conf" # apt-get check [ APT genera una copia local de los ficheros de caché ] # apt-get --no-d -o dir::state::status=/var/lib/dpkg/status dist-upgrade [ O cualquiera otra orden de APT ]

source: It is necessary for proper function to re-specify the status file to be the local one. This is very important!
de: Es ist für ordentliches Funktionieren notwendig, die Statusdatei erneut als die lokale anzugeben. Dies ist sehr wichtig!
es: Para un correcto funcionamiento debe definir nuevamente el fichero de estado local. ¡Es muy importante!

source: If you are using dselect you can do the very risky operation of copying disc/status to /var/lib/dpkg/status so that any selections you made on the remote machine are updated. I highly recommend that people only make selections on the local machine - but this may not always be possible. DO NOT copy the status file if dpkg or APT have been run in the mean time!!
de: Wenn Sie Dselect benutzen, können Sie die sehr riskante Operation durchführen, disc/status auf /var/lib/dpkg/status zu kopieren, so dass die von Ihnen gemachte Auswahl auf der fernen Maschine aktualisiert wird. Es wird in höchstem Maße empfohlen, dass Leute nur auf der lokalen Maschine Auswahlen treffen – aber dies könnte manchmal unmöglich sein. Kopieren Sie die Statusdatei NICHT, falls Dpkg oder APT in der Zwischenzeit benutzt wurden!
es: Si está usando dselect puede realizar la arriesgada operación de copiar «disc/status» a «/var/lib/dpkg/status» para actualizar toda selección hecha en el sistema remoto. Recomiendo seriamente hacer las selecciones sólo en el sistema local, aunque puede que no sea posible. NO copie el fichero de estado si dpkg o APT se han ejecutado mientras tanto.

source: Using APT and wget
de: APT und Wget benutzen
es: Usar APT y wget

source: <em>wget</em> is a popular and portable download tool that can run on nearly any machine. Unlike the method above this requires that the Debian machine already has a list of available packages.
de: <em>wget</em> ist eine populäres und portierbares Download-Werkzeug, das auf nahezu jeder Maschine laufen kann. Anders als die Methode oben wird hierfür benötigt, dass die Debian-Maschine bereits eine Liste verfügbarer Pakete hat.
es: <em>wget</em> es una herramienta de descarga muy popular que funciona prácticamente en cualquier sistema. A diferencia del método anterior, requiere que el sistema Debian tenga una lista de paquetes disponibles.

source: The basic idea is to create a disc that has only the archive files downloaded from the remote site. This is done by using the --print-uris option to apt-get and then preparing a wget script to actually fetch the packages.
de: Die Grundidee besteht darin, eine Platte zu erzeugen, die nur die heruntergeladenen Archivdateien von der fernen Site enthält. Die wird durch Benutzen der apt-get-Option »--print-uris« und dem anschließenden Vorbereiten eines Wget-Skripts getan, um die eigentlichen Pakete herunterzuladen.
es: La idea básica es crear un disco que sólo contiene los ficheros del archivo descargados desde el sistema remoto. Esto se hace mediante la opción de apt-get «--print-uris», para después preparar un script de wget que finalmente obtendrá los paquetes.

source: Operation
de: Betrieb
es: Operación

source: Unlike the previous technique no special configuration files are required. We merely use the standard APT commands to generate the file list.
de: Anders als bei der vorherigen Technik werden keine speziellen Konfigurationsdateien benötigt. Es werden lediglich die Standard-APT-Befehle benutzt, um die Dateiliste zu erstellen.
es: A diferencia de la técnica anterior no necesita ningún fichero de configuración especial. Se usan sólo las órdenes estándar de APT para generar el fichero con la lista.

source: # apt-get dist-upgrade [ Press no when prompted, make sure you are happy with the actions ] # apt-get -qq --print-uris dist-upgrade > uris # awk '{print "wget -O " $2 " " $1}' < uris > /disc/wget-script
de: # apt-get dist-upgrade [ Antworten Sie »nein« auf gestellte Fragen, wenn Sie mit den Aktionen zufrieden sind ] # apt-get -qq --print-uris dist-upgrade > uris # awk '{print "wget -O " $2 " " $1}' < uris > /Platte/wget-script
es: # apt-get dist-upgrade [ Pulse no cuando se le pregunte, asegúrese de estar conforme con las acciones ] # apt-get -qq --print-uris dist-upgrade > uris # awk '{print "wget -O " $2 " " $1}' < uris > /disc/wget-script

source: Any command other than dist-upgrade could be used here, including dselect-upgrade.
de: Jeder andere Befehl als »dist-upgrade« könnte hier benutzt werden, einschließlich »upgrade«.
es: Ahora podría usar cualquiera otra orden aparte de «dist-upgrade», incluyendo «dselect-upgrade».

source: The /disc/wget-script file will now contain a list of wget commands to execute in order to fetch the necessary archives. This script should be run with the current directory as the disc's mount point so as to save the output on the disc.
de: Die Datei /Platte/wget-script wird nun eine Liste der Wget-Befehle enthalten, um die erforderlichen Archive herunterzuladen. Dieses Skript sollte mit dem aktuellen Verzeichnis als Platteneinhängepunkt ausgeführt werden, so dass die Ausgabe auf die Platte gespeichert wird.
es: El fichero «/disc/wget-script» ahora contiene una lista de órdenes de wget a ejecutar para obtener los archivos necesarios. Este script se debería ejecutar en el directorio del punto de montaje del disco para poder guardar la salida en el disco.

source: The remote machine would do something like
de: Die ferne Maschine würde etwas wie das folgende tun
es: El sistema remoto haría algo como

source: # cd /disc # sh -x ./wget-script [ wait.. ]
de: # cd /Platte # sh -x ./wget-script [ warten … Fertig ]

source: Once the archives are downloaded and the disc returned to the Debian machine installation can proceed using,
de: Sobald die Archive heruntergeladen und die Platte zur Debian-Maschine zurückgekehrt ist, kann die Installation fortfahren durch Benutzung von
es: Una vez que los archivos se han descargado y el disco está finalmente conectado al sistema Debian, ejecute la instalación con lo siguiente.

source: # apt-get -o dir::cache::archives="/disc/" dist-upgrade
de: # apt-get -o dir::cache::archives="/Platte/" dist-upgrade

source: Which will use the already fetched archives on the disc.
de: Es wird die bereits auf die Platte heruntergeladenen Archive benutzen.
es: Ésto usará los archivos del disco previamente obtenidos.

source: NAME
es: NOMBRE

source: <!ENTITY apt-author.team " <author> <othername>APT team</othername> <contrib></contrib> </author> ">
es: <!ENTITY apt-author.team " <author> <othername>Equipo de APT</othername> <contrib></contrib> </author> ">

source: Package: libreadline2 Versions: 2.1-12(/var/state/apt/lists/foo_Packages), Reverse Depends: libreadlineg2,libreadline2 libreadline2-altdev,libreadline2 Dependencies: 2.1-12 - libc5 (2 5.4.0-0) ncurses3.0 (0 (null)) Provides: 2.1-12 - Reverse Provides:
es: Paquete: libreadline2 Versiones: 2.1-12(/var/state/apt/lists/foo_Packages), Dependencias inversas: libreadlineg2,libreadline2 libreadline2-altdev,libreadline2 Dependencias: 2.1-12 - libc5 (2 5.4.0-0) ncurses3.0 (0 (null)) Provides: 2.1-12 - Reverse Provides:

source: search <replaceable>regex [ regex ... ]</replaceable>
es: search <replaceable>exp-regular [exp-regular ...]</replaceable>

source: OPTS="-f" RES=`apt-config shell OPTS MyApp::options` eval $RES
es: OPTS="-f" RES=`apt-config shell OPTS MiAplicación::opciones` eval $RES

source: &apt-author.jgunthorpe; &apt-author.team; &apt-email; &apt-product; <date>17 August 2009</date>
es: &apt-author.jgunthorpe; &apt-author.team; &apt-email; &apt-product; <date>17 de Agosto de 2009</date>

source: ArchiveDir
es: Sección ArchiveDir

source: OverrideDir
es: Sección OverrideDir

source: CacheDir
es: Sección CacheDir

source: FileListDir
es: Sección FileListDir

source: Syntax
es: Sintaxis

source: Architecture
es: Arquitectura

source: /cdrom/::Mount "foo";
es: /cdrom/::Mount "algo";

source: APT in DSelect
es: APT con DSelect
