Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: FTP URIs; ftp::Proxy is the default ftp proxy to use. It is in the standard form of <literal>ftp://[[user][:pass]@]host[:port]/</literal>. Per host proxies can also be specified by using the form <literal>ftp::Proxy::&lt;host&gt;</literal> with the special keyword <literal>DIRECT</literal> meaning to use no proxies. If no one of the above settings is specified, <envar>ftp_proxy</envar> environment variable will be used. To use a ftp proxy you will have to set the <literal>ftp::ProxyLogin</literal> script in the configuration file. This entry specifies the commands to send to tell the proxy server what to connect to. Please see &configureindex; for an example of how to do this. The substitution variables available are <literal>$(PROXY_USER)</literal> <literal>$(PROXY_PASS)</literal> <literal>$(SITE_USER)</literal> <literal>$(SITE_PASS)</literal> <literal>$(SITE)</literal> and <literal>$(SITE_PORT)</literal> Each is taken from it's respective URI component.
de: FTP-URIs; ftp::Proxy ist der zu benutzende Standard-FTP-Proxy. Er wird standardmäßig in der Form <literal>ftp://[[Anwender][:Passwort]@]Host[:Port]/</literal> angegeben. pro-Host-Proxys kann außerdem in der Form <literal>ftp::Proxy::&lt;host&gt;</literal> angegeben werden. Hierbei bedeutet das spezielle Schlüsselwort <literal>DIRECT</literal>, dass keine Proxys benutzt werden. Falls keine der obigen Einstellungen angegeben wurde, wird die Umgebungsvariable <envar>ftp_proxy</envar> benutzt. Um einen FTP-Proxy zu benutzen, müssen Sie in der Konfigurationsdatei das Skript <literal>ftp::ProxyLogin</literal> setzen. Dieser Eintrag gibt die Befehle an, die gesendet werden müssen, um dem Proxy-Server mitzuteilen, womit er sich verbinden soll. Um ein Beispiel zu erhalten, wie das gemacht wird, lesen Sie bitte &configureindex;. Die Platzhaltervariablen sind <literal>$(PROXY_USER)</literal>, <literal>$(PROXY_PASS)</literal>, <literal>$(SITE_USER)</literal>, <literal>$(SITE_PASS)</literal>, <literal>$(SITE)</literal> und <literal>$(SITE_PORT)</literal>. Jede wird von ihrem entsprechenden URI-Bestandteil genommen.
es: FTP URI, ftp::Proxy es el proxy ftp predeterminado a usar. Usa el formato estándar <literal>ftp://[[usuario][:contraseña]@]máquina[:puerto]/</literal>. También se puede especificar un proxy por cada máquina usando la forma <literal>ftp::Proxy::&lt;máquina&gt;</literal> con la palabra especial <literal>DIRECT</literal>, que significa que no se use ningún proxy. La variable de entorno <envar>ftp_proxy</envar> se usará en caso de no definir ninguna de las opciones anteriores. Para usar un proxy ftp debe configurar el script <literal>ftp::ProxyLogin</literal> en el fichero de configuración. Esta entrada define las órdenes a enviar para decirle al servidor del proxy a qué conectar. Por favor, vea &configureindex; para un ejemplo de cómo usarlo. Las variables de sustitución disponibles son <literal>$(PROXY_USER)</literal> <literal>$(PROXY_PASS)</literal> <literal>$(SITE_USER)</literal> <literal>$(SITE_PASS)</literal> <literal>$(SITE)</literal> y <literal>$(SITE_PORT)</literal>, cada uno tomada de su respectivo componente de la URI.

source: Several settings are provided to control passive mode. Generally it is safe to leave passive mode on, it works in nearly every environment. However some situations require that passive mode be disabled and port mode ftp used instead. This can be done globally, for connections that go through a proxy or for a specific host (See the sample config file for examples).
de: Mehrere Einstellungen werden zum Steuern des passiven Modus bereitgestellt. Generell ist es sicher, den passiven Modus eingeschaltet zu lassen, er funktioniert in nahezu jeder Umgebung. Jedoch erfordern einige Situationen, dass der passive Modus ausgeschaltet und stattdessen Port-Modus-FTP benutzt wird. Dies kann global für Verbindungen gemacht werden, die durch einen Proxy oder über einen bestimmten Host gehen (Lesen Sie die Beispielskonfiguration, um Beispiele zu erhalten).
es: Puede controlar el modo pasivo a través de varias opciones. Generalmente es seguro dejar activado el modo pasivo, y funciona en casi todos los entornos. Sin embargo algunas situaciones requieren desactivar el modo pasivo y usar el modo puerto de ftp en su lugar. Esto se puede hacer globalmente, para conexiones a través de un proxy o para una máquina en concreto (vea el fichero de configuración de muestra para ver algunos ejemplos).

source: It is possible to proxy FTP over HTTP by setting the <envar>ftp_proxy</envar> environment variable to a http url - see the discussion of the http method above for syntax. You cannot set this in the configuration file and it is not recommended to use FTP over HTTP due to its low efficiency.
de: Es ist möglich FTP über HTTP zu leiten, indem die Umgebungsvariable <envar>ftp_proxy</envar> auf eine HTTP-Url gesetzt wird – lesen Sie die Besprechung der HTTP-Methode oberhalb bezüglich der Syntax. Sie können dies nicht in der Konfigurationsdatei setzen und es wird wegen der geringen Effizienz nicht empfohlen FTP über HTTP zu benutzen.
es: Es posible usar un proxy FTP a través de HTTP definiendo la variable de entorno <envar>ftp_proxy</envar> con una dirección http. Consulte la discusión anterior del método http para la sintaxis. No puede definir esto en el fichero de configuración y no se recomienda el uso de ftp por encima de http debido a su poca eficiencia.

source: The setting <literal>ForceExtended</literal> controls the use of RFC2428 <literal>EPSV</literal> and <literal>EPRT</literal> commands. The default is false, which means these commands are only used if the control connection is IPv6. Setting this to true forces their use even on IPv4 connections. Note that most FTP servers do not support RFC2428.
de: Die Einstellung <literal>ForceExtended</literal> steuert die Benutzung der RFC2428-Befehle <literal>EPSV</literal> und <literal>EPRT</literal>. Die Vorgabe ist false, was bedeutet, dass diese Befehle nur benutzt werden, wenn die Steuerverbindung IPv6 ist. Dies auf true zu stellen erzwingt die Benutzung selbst auf IPv4-Verbindungen. Beachten Sie, dass die wenigsten FTP-Server RFC2428 unterstützen.
es: La opción <literal>ForceExtended</literal> controla el uso de las órdenes de RFC 2428 <literal>EPSV</literal> y <literal>EPRT</literal>. De forma predeterminada es «false», que significa que sólo se usa si el control de conexión es IPv6. Cambiándolo a «true» fuerza su uso incluso en conexiones IPv4. Tenga en cuenta que la mayoría de los servidores de FTP no son compatibles con la RFC 2428.

source: CDROM URIs; the only setting for CDROM URIs is the mount point, <literal>cdrom::Mount</literal> which must be the mount point for the CDROM drive as specified in <filename>/etc/fstab</filename>. It is possible to provide alternate mount and unmount commands if your mount point cannot be listed in the fstab (such as an SMB mount and old mount packages). The syntax is to put <placeholder type="literallayout" id="0"/> within the cdrom block. It is important to have the trailing slash. Unmount commands can be specified using UMount.
de: CDROM-URIs; Die einzige Einstellung für CDROM-URIs ist der Einhängepunkt <literal>cdrom::Mount</literal>, der der Einhängepunkt des CD-ROM-Laufwerks sein muss, wie er in <filename>/etc/fstab</filename> angegeben wurde. Es ist möglich alternative Ein- und Aushängebefehle anzugeben, falls Ihr Einhängepunkt nicht in der fstab aufgelistet werden kann (so wie beim Einhängen per SMB und alten Mount-Paketen). Die Syntax besteht darin, <placeholder type="literallayout" id="0"/> in den CD-ROM-Block einzufügen. Der abschließende Schrägstrich ist wichtig. Aushängebefehle können per UMount angegeben werden.
es: CDROM URI, la única opción de configuración para las URI de CDROM es el punto de montaje. <literal>cdrom::Mount</literal> debe ser el punto de montaje de la unidad de CDROM tal y como se especifica en <filename>/etc/fstab</filename>. Es posible proporcionar órdenes «mount» y «unmount» alternativas si el punto de montaje no se puede especificar en el fichero fstab (como con SMB y versiones antiguas de mount). La sintaxis consiste en insertar <placeholder type="literallayout" id="0"/> dentro del bloque de cdrom. Es importante dejar una barra al final. Puede especificar órdenes para desmontar usando UMount.

source: GPGV URIs; the only option for GPGV URIs is the option to pass additional parameters to gpgv. <literal>gpgv::Options</literal> Additional options passed to gpgv.
de: GPGV-URIs; Die einzige Option für GPGV-URIs ist die Option zusätzliche Parameter an gpgv weiterzuleiten. <literal>gpgv::Options</literal> Zusätzliche Parameter werden an gpgv weitergeleitet.
es: GPGV URI, la única opción para las URI de GPGV es la entrega de parámetros adicionales a gpgv. <literal>gpgv::Options</literal> Parámetros adicionales introducidos a gpgv.

source: Acquire::CompressionTypes::<replaceable>FileExtension</replaceable> "<replaceable>Methodname</replaceable>";
de: Acquire::CompressionTypes::<replaceable>Dateierweiterung</replaceable> "<replaceable>Methodenname</replaceable>";
es: Acquire::CompressionTypes::<replaceable>extensión-del-fichero</replaceable> "<replaceable>nombre-del-método</replaceable>";

source: List of compression types which are understood by the acquire methods. Files like <filename>Packages</filename> can be available in various compression formats. Per default the acquire methods can decompress <command>bzip2</command>, <command>lzma</command> and <command>gzip</command> compressed files, with this setting more formats can be added on the fly or the used method can be changed. The syntax for this is: <placeholder type="synopsis" id="0"/>
de: Die List der Kompressionstypen die von den »aquire«-Methoden verstanden werden. Dateien wie <filename>Packages</filename> können in verschiedenen Kompressionsformaten verfügbar sein. Standardmäßig können die »aquire«-Methoden <command>bzip2</command>-, <command>lzma</command>- und <command>gzip</command>-komprimierte Dateien dekomprimieren. Mit dieser Einstellung können spontan weiter Formate hinzugefügt oder die benutzte Methode geändert werden. Die Syntax dafür lautet: <placeholder type="synopsis" id="0"/>
es: Lista de los tipos de compresión que se pueden usar en los métodos de «acquire». Los ficheros como <filename>Packages</filename> pueden estar disponibles en varios formatos de compresión. De forma predeterminada los métodos de «acquire» pueden descomprimir los ficheros comprimidos en <command>bzip2</command>, <command>lzma</command> y <command>gzip</command>, y con esta opción se pueden añadir más formatos en el momento, o cambiar el método usado. La sintaxis para esto es: <placeholder type="synopsis" id="0"/>

source: Also the <literal>Order</literal> subgroup can be used to define in which order the acquire system will try to download the compressed files. The acquire system will try the first and proceed with the next compression type in this list on error, so to prefer one over the other type simple add the preferred type at first - not already added default types will be added at run time to the end of the list, so e.g. <placeholder type="synopsis" id="0"/> can be used to prefer <command>gzip</command> compressed files over <command>bzip2</command> and <command>lzma</command>. If <command>lzma</command> should be preferred over <command>gzip</command> and <command>bzip2</command> the configure setting should look like this <placeholder type="synopsis" id="1"/> It is not needed to add <literal>bz2</literal> explicit to the list as it will be added automatic.
de: Außerdem kann die Untergruppe <literal>Order</literal> benutzt werden, um zu definieren, in welcher Reihenfolge das »aquire«-System die komprimierten Dateien herunterzuladen versucht. Das »aquire«-System wird die erste versuchen und mit dem nächsten Kompressionstyp in dieser Liste bei einem Fehler fortfahren. Um daher einen nach dem anderen Typ vorzuziehen, fügen Sie einfach den bevorzugten Typ zuerst in die Liste – noch nicht hinzugefügte Standardtypen werden zur Laufzeit an das Ende der Liste angehängt, so kann z.B. <placeholder type="synopsis" id="0"/> verwandt werden, um <command>gzip</command>-komprimierte Dateien über <command>bzip2</command> und <command>lzma</command> zu bevorzugen. Falls <command>lzma</command> vor <command>gzip</command> und <command>bzip2</command> vorgezogen werden soll, sollte die Konfigurationseinstellung so aussehen: <placeholder type="synopsis" id="1"/>. Es ist nicht nötig <literal>bz2</literal> explizit zur Liste hinzuzufügen, da es automatisch hinzufügt wird.
es: El subgrupo <literal>Order</literal> también se puede usar para definir en qué orden el sistema de «acquire» intentará descargar los ficheros comprimidos. El sistema de «acquire» intentará el primero y, en caso de error, procederá con el siguiente tipo de compresión de la lista, por lo que si prefiere un tipo antes que otro sólo tiene que añadirlo a la lista el primero (los tipos predeterminados no se añaden, ya que se añaden durante la ejecución al final de la lista, por ejemplo: <placeholder type="synopsis" id="0"/> se puede usar cuando se prefieran los ficheros comprimidos con <command>gzip</command> antes que con <command>bzip2</command> y <command>lzma</command>. Si se prefieren los comprimidos con <command>lzma</command> antes que con <command>gzip</command> y <command>bzip2</command>, la opción de configuración debería parecerse a esto <placeholder type="synopsis" id="1"/> No es necesario añadir <literal>bz2</literal> a la lista ya que se añadirá de forma automática.

source: When downloading <literal>gzip</literal> compressed indexes (Packages, Sources, or Translations), keep them gzip compressed locally instead of unpacking them. This saves quite a lot of disk space at the expense of more CPU requirements when building the local package caches. False by default.
de: Wenn <literal>gzip</literal>-komprimierte Indizes heruntergeladen werden (Packages, Sources, oder Translations), speichere sie lokal mit gzip-Komprimierung. Dies spart eine Menge Festplattenplatz, aber benötigt mehr CPU-Ressourcen bei der Erstellung des lokalen Paket-Caches. Vorgabe ist False.
es: Al descargar ficheros de índice comprimidos con <literal>gzip</literal>, («Packages», «Sources», o «Translations»), los mantiene comprimidos localmente en lugar de desempaquetarlos. Esto ahorra mucho espacio en disco a costa de mayores requerimientos del procesador al generar los almacenes de paquetes locales. El valor predeterminado es «false».

source: Languages
de: Sprachen

source: The Languages subsection controls which <filename>Translation</filename> files are downloaded and in which order APT tries to display the Description-Translations. APT will try to display the first available Description in the Language which is listed at first. Languages can be defined with their short or long Languagecodes. Note that not all archives provide <filename>Translation</filename> files for every Language - especially the long Languagecodes are rare, so please inform you which ones are available before you set here impossible values.
de: Der Unterabschnitt Languages steuert welche <filename>Translation</filename>-Dateien heruntergeladen werden und in welcher Reihenfolge APT versucht, die Beschreibungsübersetzungen anzuzeigen. APT wird versuchen, die erste verfügbare Beschreibung für die zuerst aufgelistete Sprache anzuzeigen. Sprachen können durch ihre kurzen oder langen Sprachcodes definiert sein. Beachten Sie, dass nicht alle Archive <filename>Translation</filename>-Dateien für jede Sprache bereitstellen, besonders lange Sprachcodes sind selten. Informieren Sie sich deshalb bitte welche verfügbar sind, bevor Sie hier unmögliche Werte einsetzen.
es: La subsección «Languages» controla qué ficheros <filename>Translation</filename> se descargan y en qué orden APT intentará mostrar las traducciones de la descripción. APT intentará mostrar la primera descripción en el idioma que esté primero en la lista. Los idiomas se pueden definir con sus códigos de idioma cortos o largos. Tenga en cuenta que no todos los archivos de paquetes proporcionan ficheros <filename>Translation</filename> para cada idioma (especialmente para los códigos de idioma largos), por lo que debería informarse de cuales están disponibles antes de definir valores imposibles.

source: The default list includes "environment" and "en". "<literal>environment</literal>" has a special meaning here: It will be replaced at runtime with the languagecodes extracted from the <literal>LC_MESSAGES</literal> environment variable. It will also ensure that these codes are not included twice in the list. If <literal>LC_MESSAGES</literal> is set to "C" only the <filename>Translation-en</filename> file (if available) will be used. To force apt to use no Translation file use the setting <literal>Acquire::Languages=none</literal>. "<literal>none</literal>" is another special meaning code which will stop the search for a fitting <filename>Translation</filename> file. This can be used by the system administrator to let APT know that it should download also this files without actually use them if the environment doesn't specify this languages. So the following example configuration will result in the order "en, de" in an english and in "de, en" in a german localization. Note that "fr" is downloaded, but not used if APT is not used in a french localization, in such an environment the order would be "fr, de, en". <placeholder type="programlisting" id="0"/>
de: Die Standardliste beinhaltet »environment« und »en«. »<literal>environment</literal>« hat hier eine besondere Bedeutung: Es wird zur Laufzeit durch die Sprachcodes ersetzt, die aus der Umgebungsvariable <literal>LC_MESSAGES</literal> extrahiert wurden. Es wird außerdem sicherstellen, dass diese Codes nicht zweimal in der Liste enthalten sind. Falls <literal>LC_MESSAGES</literal> auf »C« gesetzt ist, wird nur die Datei <filename>Translation-en</filename> (falls verfügbar) benutzt. Um APT zu zwingen, keine Übersetzungsdatei zu benutzen, benutzen Sie die Einstellung <literal>Acquire::Languages=none</literal>. »<literal>none</literal>« ist ein weiterer Code mit besonderer Bedeutung, der die Suche nach einer passenden <filename>Translation</filename>-Datei stoppen wird. Dies kann vom Systemadministrator benutzt werden, um APT mitzuteilen, dass es auch diese Dateien herunterladen soll ohne sie aktuell zu benutzen, falls die Umgebungsvariable diese Sprachen nicht angibt. Daher wird die folgende Beispielkonfiguration in der Reihenfolge »en,de« zu einer englischen und »de,en« zu einer deutschen Lokalisierung führen. Beachten Sie, dass »fr« heruntergeladen, aber nicht benutzt wird, falls APT nicht in einer französischen Lokalisierung benutzt wird. In einer solchen Umgebung wäre die Reihenfolge »fr, de, en«. <placeholder type="programlisting" id="0"/>
es: La lista predeterminada incluye «environment» y «en». «<literal>environment</literal>» tiene un significado especial aquí; se reemplazará durante la ejecución con los códigos de idioma extraídos de la variable de entorno <literal>LC_MESSAGES</literal>. También se asegurará de que estos códigos no se incluyan dos veces en la lista. Si <literal>LC_MESSAGES</literal> está definida como «C» sólo se usará el fichero <filename>Translation-en</filename> (si está disponible). Puede usar la opción <literal>Acquire::Languages=none</literal> para forzar apt a que no use ficheros «Translation» . «<literal>none</literal>» es otro código especial que significa que detendrá la búsqueda de un fichero <filename>Translation</filename> adecuado. El administrador del sistema puede usar esto para permitir que APT sepa que debería descargar estos ficheros sin tener que usarlos si no se definen con «environment». De modo que el siguiente ejemplo de configuración resultará en el orden «en, de» en una configuración regional inglesa y «de, en» en una configuración regional alemana. Tenga en cuenta que «fr» se descargará, pero no se usará si APT no se usa con una configuración regional francesa, de modo que la orden en este entorno («environment») sería «fr, de, en». <placeholder type="programlisting" id="0"/>

source: The <literal>Acquire</literal> group of options controls the download of packages and the URI handlers. <placeholder type="variablelist" id="0"/>
de: Die <literal>Acquire</literal>-Gruppe der Optionen steuert das Herunterladen von Paketen und die URI-Steuerprogramme. <placeholder type="variablelist" id="0"/>
es: El grupo de opciones <literal>Acquire</literal> controla la descarga de paquetes y los gestores de URI. <placeholder type="variablelist" id="0"/>

source: Directories
de: Verzeichnisse
es: Directorios

source: The <literal>Dir::State</literal> section has directories that pertain to local state information. <literal>lists</literal> is the directory to place downloaded package lists in and <literal>status</literal> is the name of the dpkg status file. <literal>preferences</literal> is the name of the APT preferences file. <literal>Dir::State</literal> contains the default directory to prefix on all sub items if they do not start with <filename>/</filename> or <filename>./</filename>.
de: Der <literal>Dir::State</literal>-Abschnitt hat Verzeichnisse, die zu lokalen Statusinformationen gehören. <literal>lists</literal> ist das Verzeichnis, in das heruntergeladene Paketlisten platziert werden und <literal>status</literal> ist der Name der Dpkg-Statusdatei. <literal>preferences</literal> ist der Name der APT-Einstellungsdatei. <literal>Dir::State</literal> enthält das Standardverzeichnis, das allen Unterelementen vorangestellt wird, falls sie nicht mit <filename>/</filename> oder <filename>./</filename> beginnen.
es: La sección <literal>Dir::State</literal> contiene directorios que afectan a la información de estado local. <literal>lists</literal> es el directorio en el que se almacenan las listas de los paquetes descargados y <literal>status</literal> es el nombre del fichero de estado de dpkg. <literal>preferences</literal> es el nombre del fichero de preferencias de APT. <literal>Dir::State</literal> contiene el directorio que se usará como prefijo predeterminado en todos los elementos subordinados en caso de que no empiecen con <filename>/</filename> ó <filename>./</filename>.
