Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: Valid values are "<literal>all</literal>", "<literal>smart</literal>" and "<literal>no</literal>". "<literal>all</literal>" is the default value and causes APT to configure all packages explicit. The "<literal>smart</literal>" way is it to configure only packages which need to be configured before another package can be unpacked (Pre-Depends) and let the rest configure by dpkg with a call generated by the next option. "<literal>no</literal>" on the other hand will not configure anything and totally rely on dpkg for configuration (which will at the moment fail if a Pre-Depends is encountered). Setting this option to another than the all value will implicitly activate also the next option per default as otherwise the system could end in an unconfigured status which could be unbootable!
de: Gültige Werte sind »<literal>all</literal>«, »<literal>smart</literal>« und »<literal>no</literal>«. »<literal>all</literal>« ist der Vorgabewert und veranlasst APT alle Pakete explizit zu konfigurieren. Die Art von »<literal>smart</literal>« ist es, nur die Pakete zu konfigurieren, die konfiguriert werden müssen, bevor eine anderes Paket entpackt (Pre-Depends) werden kann und den Rest von Dpkg mit einem Aufruf, der von der nächsten Option generiert wurde, konfigurieren zu lassen. Im Gegensatz dazu wird »<literal>no</literal>« nicht konfigurieren und völlig die Konfiguration von Dpkg weitergeben (die in dem Moment fehlschlägt, in dem ein Pre-Depends vorkommt). Diese Option auf etwas anderes als all zu setzen, wird außerdem implizit standardmäßig die nächste Option aktivieren, da das System anderenfalls in einem nicht konfigurierten Status enden könnte, der nicht mehr startbar sein könnte.
es: Los valores válidos son «<literal>all</literal>», «<literal>smart</literal>» y «<literal>no</literal>». «<literal>all</literal>» es el valor predeterminado y hace que APT configure todos los paquetes de forma explícita. El valor «<literal>smart</literal>» sólo configura los paquetes que necesiten ser configurados antes de que otro paquete se desempaquete (pre-dependencia) y permite que dpkg configure los restantes con una llamada generada por la siguiente opción. El valor «<literal>no</literal>» no configurará nada y dependerá totalmente de dpkg para la configuración (que fallará si se encuentra una pre-dependencia). Definir esta opción a otro valor distinto a «all» activará implícitamente la siguiente opción de forma predeterminada, ya que de otro modo el sistema podría terminar en un estado mal configurado qué podría derivar en la imposibilidad de arrancar el sistema.

source: If this option is set apt will call <command>dpkg --configure --pending</command> to let dpkg handle all required configurations and triggers. This option is activated automatic per default if the previous option is not set to <literal>all</literal>, but deactivating could be useful if you want to run APT multiple times in a row - e.g. in an installer. In these sceneries you could deactivate this option in all but the last run.
de: Wenn diese Option gesetzt ist, wird APT <command>dpkg --configure --pending</command> aufrufen, um Dpkg alle benötigten Konfigurationen und Trigger handhaben zu lassen. Diese Option ist als Vorgabe automatisch aktiviert, wenn die vorherige Option nicht auf <literal>all</literal> gesetzt ist, aber Deaktivieren könnte nützlich sein, wenn Sie APT mehrmals hintereinander ausführen möchten – z.B. in einem Installationsprogramm. In diesen Szenarien könnten Sie diese Option außer in allen außer der letzten Ausführung deaktivieren.
es: Si define esta opción, apt ejecutará <command>dpkg --configure --pending</command> para permitir a dpkg manejar todas las configuraciones necesarias y todos los disparadores. Esta opción se activa automáticamente de forma predeterminada si la opción anterior no está definida como <literal>all</literal>, pero desactivarla podría ser útil si se quiere ejecutar APT varias veces seguidas, por ejemplo: en un instalador. En estas situaciones podría desactivar esta opción en todas las ejecuciones menos la última.

source: Useful for <literal>smart</literal> configuration as a package which has pending triggers is not considered as <literal>installed</literal> and dpkg treats them as <literal>unpacked</literal> currently which is a dealbreaker for Pre-Dependencies (see debbugs #526774). Note that this will process all triggers, not only the triggers needed to configure this package.
de: Nützlich für <literal>smart</literal>-Konfiguration, da ein Paket mit ausstehenden Triggern nicht als <literal>installed</literal> angesehen wird und Dpkg es als aktuell entpackt betrachtet, was ein Hemmschuh für Pre-Dependencies ist (siehe Debian-Fehler #526774). Beachten Sie, dass dies alle Trigger ausführt, nicht nur die Trigger, die zum Konfigurieren dieses Pakets benötigt werden.
es: Útil para una configuración <literal>smart</literal> en la que un paquete que tiene disparadores pendientes no se considera como <literal>instalado</literal> y que dpkg lo trata como <literal>desempaquetado</literal>, lo cual rompe el sistema de pre-dependencias (véase debbugs #526774). Tenga en cuenta que esto procesará todos los disparadores, no sólo los disparadores necesarios para configurar este paquete.

source: As the configuration can be deferred to be done at the end by dpkg it can be tried to order the unpack series only by critical needs, e.g. by Pre-Depends. Default is true and therefore the "old" method of ordering in various steps by everything. While both method were present in earlier APT versions the <literal>OrderCritical</literal> method was unused, so this method is very experimental and needs further improvements before becoming really useful.
de: Da die Konfiguration an das Ende von Dpkg verschoben werden kann, kann versucht werden, nur die Entpackserien von kritischen Notwendigkeiten, z.B. von Pre-Depends, anzuweisen. Vorgabe ist true und daher die »alte« Methode zum Sortieren nach allem in mehreren Schritten. Obwohl in früheren Versionen von APT beide Methoden enthalten waren, wurde die <literal>OrderCritical</literal>-Methode nicht benutzt, so dass diese Methode sehr experimentell ist und weitere Verbesserungen benötigt, bevor sie wirklich nützlich wird.
es: Ya que la configuración se puede aplazar para que dpkg la haga al final se puede intentar ordenar las series de desempaquetado por necesidades críticas, por ejemplo, mediante pre-dependencias. De forma predeterminada, es «true» y por tanto se usa el método «antiguo» de ordenación en varios pasos para todo. Mientras ambos métodos estén presentes en versiones anteriores de APT, el método <literal>OrderCritical</literal> no se usará, ya que este método es experimental y necesita más mejoras antes de llegar a ser realmente útil.

source: Essential packages (and there dependencies) should be configured immediately after unpacking. It will be a good idea to do this quite early in the upgrade process as these these configure calls require currently also <literal>DPkg::TriggersPending</literal> which will run quite a few triggers (which maybe not needed). Essentials get per default a high score but the immediate flag is relatively low (a package which has a Pre-Depends is higher rated). These option and the others in the same group can be used to change the scoring. The following example shows the settings with there default values. <placeholder type="literallayout" id="0"/>
de: Essentielle Pakete (und ihre Abhängigkeiten) sollten sofort nach dem Entpacken konfiguriert werden. Es ist eine gute Idee, dies ziemlich früh im Upgrade-Prozess zu tun, da diese Konfigurationsaufrufe aktuell außerdem <literal>DPkg::TriggersPending</literal> benötigen, das eine Reihe von Triggern ausführt (die möglicherweise nicht gebraucht werden). Essentielle Pakete haben als Vorgabe eine hohe Bewertung, aber die immediate-Markierung ist relativ niedrig (ein Paket, das Pre-Depends hat, wird höher bewertet). Diese Option und die anderen in der gleichen Gruppe können benutzt werden, um die Bewertung zu ändern. Das folgende Beispiel zeigt die Einstellungen mit ihren Vorgabewerten. <placeholder type="literallayout" id="0"/>
es: Los paquetes esenciales (y sus dependencias) se deberían configurar inmediatamente después de desempaquetarlos. Es una buena idea hacerlo lo más pronto posible en el proceso de actualización ya que actualmente estas llamadas de configuración también necesitan <literal>DPkg::TriggersPending</literal>, que ejecutará unos pocos disparadores (que puede que no sean necesarios). Los esenciales tienen, de forma predeterminada, una puntuación alta pero la opción inmediata es relativamente baja (un paquete que tenga pre-dependencias tiene una puntuación más alta). Puede cambiar la puntuación mediante esta opción y las otras del mismo grupo. El siguiente ejemplo muestra la configuración con los valores predeterminados. <placeholder type="literallayout" id="0"/>

source: Periodic and Archives options
de: Periodische- und Archivoptionen
es: Las opciones «Periodic» y «Archives»

source: <literal>APT::Periodic</literal> and <literal>APT::Archives</literal> groups of options configure behavior of apt periodic updates, which is done by <literal>/etc/cron.daily/apt</literal> script. See header of this script for the brief documentation of these options.
de: <literal>APT::Periodic</literal>- und <literal>APT::Archives</literal>-Gruppen von Optionen konfigurieren das Verhalten periodischer APT-Aktualisierungen, die vom Skript <literal>/etc/cron.daily/apt</literal> durchgeführt werden. Lesen Sie die Kopfzeilen dieses Skripts, um eine kurze Dokumentation dieser Optionen zu erhalten.
es: Los grupos de opciones <literal>APT::Periodic</literal> y <literal>APT::Archives</literal> configuran el comportamiento de las actualizaciones periódicas de apt, que se hacen mediante el script <literal>/etc/cron.daily/apt</literal>. Consulte la cabecera de este script para una breve documentación de estas opciones.

source: Debug options
de: Fehlersuchoptionen
es: Opciones de depuración

source: Enabling options in the <literal>Debug::</literal> section will cause debugging information to be sent to the standard error stream of the program utilizing the <literal>apt</literal> libraries, or enable special program modes that are primarily useful for debugging the behavior of <literal>apt</literal>. Most of these options are not interesting to a normal user, but a few may be:
de: Einschalten von Optionen im Abschnitt <literal>Debug::</literal> wird veranlassen, dass Fehlersuchinformationen an die Standardfehlerausgabe des Programms gesendet werden, das die <literal>apt</literal>-Bibliotheken benutzt oder besondere Programmmodi einschaltet, die in erster Linie für das Fehlersuchverhalten von <literal>apt</literal> nützlich sind. Die meisten dieser Optionen sind für den normalen Anwender uninteressant, aber ein paar könnten es sein:
es: Activar las opciones de la sección <literal>Debug::</literal> provocará que la información de depuración se envíe a la salida estándar del programa que esté utilizando las bibliotecas de <literal>apt</literal>, o activar los modos especiales del programa que son útiles para depurar el comportamiento de <literal>apt</literal>. La mayoría de estas opciones no son interesantes para un usuario normal, aunque unas cuantas sí son:

source: <literal>Debug::pkgProblemResolver</literal> enables output about the decisions made by <literal>dist-upgrade, upgrade, install, remove, purge</literal>.
de: <literal>Debug::pkgProblemResolver</literal> schaltet die Ausgabe über die von <literal>dist-upgrade, upgrade, install, remove, purge</literal> getroffenen Entscheidungen ein.
es: <literal>Debug::pkgProblemResolver</literal> activa la salida de las decisiones tomadas por <literal>dist-upgrade, upgrade, install, remove, purge</literal>.

source: <literal>Debug::NoLocking</literal> disables all file locking. This can be used to run some operations (for instance, <literal>apt-get -s install</literal>) as a non-root user.
de: <literal>Debug::NoLocking</literal> schaltet jegliches Sperren von Dateien aus. Dies kann benutzt werden, um einige Operationen (zum Beispiel <literal>apt-get -s install</literal>) als nicht root-Anwender auszuführen.
es: <literal>Debug::NoLocking</literal> desactiva todos los cerrojos de los ficheros. Esto se puede usar para ejecutar algunas operaciones (por ejemplo, <literal>apt-get -s install</literal>) como un usuario normal.

source: <literal>Debug::pkgDPkgPM</literal> prints out the actual command line each time that <literal>apt</literal> invokes &dpkg;.
de: <literal>Debug::pkgDPkgPM</literal> gibt die aktuelle Befehlszeile jedesmal aus, wenn <literal>apt</literal> &dpkg; aufruft.
es: <literal>Debug::pkgDPkgPM</literal> muestra la línea de órdenes actual cada vez que <literal>apt</literal> invoca a &dpkg;.

source: <literal>Debug::IdentCdrom</literal> disables the inclusion of statfs data in CDROM IDs.
de: <literal>Debug::IdentCdrom</literal> schaltet das Einbeziehen von statfs-Daten in CD-ROM-IDs aus.
es: <literal>Debug::IdentCdrom</literal> desactiva la inclusión de los datos de statfs en los identificadores de los CDROM.

source: A full list of debugging options to apt follows.
de: Eine vollständige Liste der Fehlersuchoptionen von APT folgt.
es: A continuación, se muestra la lista completa de las opciones de depuración de apt.

source: Print information related to accessing <literal>cdrom://</literal> sources.
de: Gibt Informationen aus, die sich auf Zugriffe von <literal>cdrom://</literal>-Quellen beziehen.
es: Muestra la información relacionada al acceso de las fuentes de <literal>cdrom://</literal>

source: Print information related to downloading packages using FTP.
de: Gibt Informationen aus, die sich auf das Herunterladen von Paketen per FTP beziehen.
es: Muestra la información relacionada con la descarga de paquetes mediante FTP.

source: Print information related to downloading packages using HTTP.
de: Gibt Informationen aus, die sich auf das Herunterladen von Paketen per HTTP beziehen.
es: Muestra la información relacionada con la descarga de paquetes mediante HTTP.

source: Print information related to downloading packages using HTTPS.
de: Gibt Informationen aus, die sich auf das Herunterladen von Paketen per HTTPS beziehen.
es: Muestra la información relacionada con la descarga de paquetes mediante HTTPS.

source: Print information related to verifying cryptographic signatures using <literal>gpg</literal>.
de: Gibt Informationen aus, die sich auf das Prüfen kryptografischer Signaturen mittels <literal>gpg</literal> beziehen.
es: Muestra la información relacionada con la comprobación de las firmas criptográficas mediante <literal>gpg</literal>.

source: Output information about the process of accessing collections of packages stored on CD-ROMs.
de: Informationen über den Zugriffsprozess auf Paketsammlungen ausgeben, die auf CD-ROMs gespeichert sind.
es: Muestra la información sobre el proceso de acceso a las colecciones de paquetes almacenadas en CD-ROM.

source: Describes the process of resolving build-dependencies in &apt-get;.
de: Beschreibt den Prozess der Auflösung von Bauabhängigkeiten in &apt-get;.
es: Describe el proceso de resolución de dependencias de compilación en &apt-get;.

source: Output each cryptographic hash that is generated by the <literal>apt</literal> libraries.
de: Jeden kryptografischen Hash ausgeben, der von den <literal>apt</literal>-Bibliotheken generiert wurde.
es: Muestra los «hashes» criptográficos que generan las bibliotecas de <literal>apt</literal>.

source: Do not include information from <literal>statfs</literal>, namely the number of used and free blocks on the CD-ROM filesystem, when generating an ID for a CD-ROM.
de: Keine Informationen von <literal>statfs</literal> einschließen, und zwar die Anzahl der benutzten und freien Blöcke auf dem CD-ROM-Dateisystem, wenn eine ID für eine CD-ROM generiert wird.
es: No incluye la información de <literal>statfs</literal>, el número de bloques libres y usados del sistema de ficheros del CD-ROM, cuando se genera un identificador de un CD-ROM.

source: Disable all file locking. For instance, this will allow two instances of <quote><literal>apt-get update</literal></quote> to run at the same time.
de: Jegliches Sperren von Dateien ausschalten. Dies wird zum Beispiel erlauben, dass zwei Instanzen von <quote><literal>apt-get update</literal></quote> zur gleichen Zeit laufen.
es: Desactiva todos los cerrojos de los ficheros. Por ejemplo, esto permitirá ejecutar dos instancias de <quote><literal>apt-get update</literal></quote> a la vez.

source: Log when items are added to or removed from the global download queue.
de: Protokollieren, wenn Elemente aus der globalen Warteschlange zum Herunterladen hinzugefügt oder entfernt werden.
es: Registra los elementos que se añaden o se borran de la cola de descarga global.

source: Output status messages and errors related to verifying checksums and cryptographic signatures of downloaded files.
de: Statusmeldungen und Fehler ausgeben, die sich auf das Prüfen von Prüfsummen und kryptografischen Signaturen von heruntergeladenen Dateien beziehen.
es: Muestra los mensajes de estado y los errores relacionados con la comprobación de las sumas de verificación y las firmas criptográficas de los ficheros descargados.

source: Output information about downloading and applying package index list diffs, and errors relating to package index list diffs.
de: Informationen über das Herunterladen und Anwenden von Paketindexlisten-Diffs und Fehler, die die Paketindexlisten-Diffs betreffen, ausgeben.
es: Muestra la información de la descarga y la aplicación de los diffs de la lista de índices de paquetes, y los errores relacionados con éstos.

source: Output information related to patching apt package lists when downloading index diffs instead of full indices.
de: Informationen ausgeben, die sich auf das Patchen von Paketlisten von APT beziehen, wenn Index-Diffs anstelle vollständiger Indizes heruntergeladen werden.
es: Muestra la información relacionada con el parcheado de las listas de paquetes de apt cuando se descargan los diffs de los índices en lugar de los índices completos.

source: Log all interactions with the sub-processes that actually perform downloads.
de: Alle Interaktionen mit Unterprozessen protokollieren, die aktuell Downloads durchführen.
es: Registra todas las interacciones de los sub-procesos que están realizando descargas.

source: Log events related to the automatically-installed status of packages and to the removal of unused packages.
de: Alle Ereignisse protokollieren, die sich auf den automatisch-installiert-Status von Paketen und auf das Entfernen von nicht benutzten Paketen beziehen.
es: Registra los eventos relacionados con el estado «instalado automáticamente» de los paquetes y con la eliminación de los paquetes sin usar.

source: Generate debug messages describing which packages are being automatically installed to resolve dependencies. This corresponds to the initial auto-install pass performed in, e.g., <literal>apt-get install</literal>, and not to the full <literal>apt</literal> dependency resolver; see <literal>Debug::pkgProblemResolver</literal> for that.
de: Fehlersuchmeldungen generieren, die beschreiben, welche Pakete automatisch installiert werden, um Abhängigkeiten aufzulösen. Dies entspricht dem anfangs durchgeführten auto-install-Durchlauf, z.B. in <literal>apt-get install</literal> und nicht dem vollständigen <literal>apt</literal>-Abhängigkeitsauflöser. Lesen Sie dafür <literal>Debug::pkgProblemResolver</literal>.
es: Genera los mensajes de depuración que describen qué paquetes se están instalando automáticamente para resolver las dependencias. Esto corresponde al paso inicial de instalación automática, por ejemplo: <literal>apt-get install</literal> y no el solucionador completo de dependencias de <literal>apt</literal>. Véase <literal>Debug::pkgProblemResolver</literal>.

source: Generate debug messages describing which package is marked as keep/install/remove while the ProblemResolver does his work. Each addition or deletion may trigger additional actions; they are shown indented two additional space under the original entry. The format for each line is <literal>MarkKeep</literal>, <literal>MarkDelete</literal> or <literal>MarkInstall</literal> followed by <literal>package-name &lt;a.b.c -&gt; d.e.f | x.y.z&gt; (section)</literal> where <literal>a.b.c</literal> is the current version of the package, <literal>d.e.f</literal> is the version considered for installation and <literal>x.y.z</literal> is a newer version, but not considered for installation (because of a low pin score). The later two can be omitted if there is none or if it is the same version as the installed. <literal>section</literal> is the name of the section the package appears in.
de: Generiert Fehlersuchmeldungen, die beschreiben, welches Paket als »keep«/»install«/»remove« markiert ist, während der ProblemResolver seine Arbeit verrichtet. Jedes Hinzufügen oder Löschen kann zusätzliche Aktionen auslösen. Sie werden nach zwei eingerückten Leerzeichen unter dem Originaleintrag angezeigt. Jede Zeile hat das Format <literal>MarkKeep</literal>, <literal>MarkDelete</literal> oder <literal>MarkInstall</literal> gefolgt von <literal>Paketname &lt;a.b.c -&gt; d.e.f | x.y.z&gt; (Abschnitt)</literal> wobei <literal>a.b.c</literal> die aktuelle Version des Paketes ist, <literal>d.e.f</literal> die Version ist, die zur Installation vorgesehen ist und <literal>x.y.z</literal> eine neuere Version ist, die aber nicht zur Installation vorgesehen ist (aufgrund einer niedrigen Pinning-Bewertung). Die letzten beiden können weggelassen werden, wenn es keine gibt oder wenn sie die gleiche Version haben, wie die, die installiert ist. <literal>section</literal> ist der Name des Abschnitts, in dem das Paket erscheint.
es: Genera los mensajes de depuración que describen qué paquete se marcará como mantener/instalar/borrar mientras el solucionador de problemas («ProblemResolver») realiza su trabajo. Cada adición o borrado puede iniciar acciones adicionales; éstas se muestran sangradas con dos espacios bajo la entrada original. El formato de cada línea es <literal>MarkKeep</literal>, <literal>MarkDelete</literal> o <literal>MarkInstall</literal> seguido de <literal>package-name &lt;a.b.c -&gt; d.e.f | x.y.z&gt; (sección)</literal> siendo <literal>a.b.c</literal> la versión actual del paquete, <literal>d.e.f</literal> la versión considerada para instalar y <literal>x.y.z</literal> una versión nueva, pero no considerada para la instalación (por una puntuación baja). Las dos últimas se pueden omitir si no hay o si es la misma versión que la instalada. <literal>sección</literal> es el nombre de la sección en la que aparece el paquete.

source: Dump the default configuration to standard error on startup.
de: Die Vorgabekonfiguration beim Start auf der Standardfehlerausgabe ausgeben.
es: Vuelca la configuración predeterminada a la salida estándar durante al iniciarse.

source: When invoking &dpkg;, output the precise command line with which it is being invoked, with arguments separated by a single space character.
de: Wenn &dpkg; aufgerufen wird, Ausgabe der genauen Befehlszeile mit der es aufgerufen wurde, mit Argumenten, die durch einzelne Leerzeichen getrennt sind.
es: Cuando se invoca a &dpkg; muestra la línea de órdenes exacta con la que se invocó, con los argumentos separados por un espacio.
