Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: The Debian packaging system has a large amount of information associated with each package to help assure that it integrates cleanly and easily into the system. The most prominent of its features is the dependency system.
de: Das Debian-Paketierungssystem besitzt eine große Anzahl von Informationen, die mit jedem Paket verbunden sind, um zu helfen sicherzustellen, dass es ordentlich und leicht in das System integriert wird. Das bekannteste seiner Funktionen ist das Abhängigkeitssystem.
es: El sistema de empaquetado de Debian tiene una gran cantidad de información asociada a cada paquete para asegurar una integración sencilla y limpia en el sistema. La característica más importante es el sistema de dependencias.

source: The dependency system allows individual programs to make use of shared elements in the system such as libraries. It simplifies placing infrequently used portions of a program in separate packages to reduce the number of things the average user is required to install. Also, it allows for choices in mail transport agents, X servers and so on.
de: Das Abhängigkeitssystem erlaubt individuellen Programmen, Gebrauch von gemeinsam im System benutzten Elementen, wie Bibliotheken, zu machen. Es vereinfacht, selten benutze Teile eines Programms in separaten Paketen zu platzieren, um die Zahl von Dingen zu verringern, die der Durchschnittsanwender installieren sollte. Außerdem erlaubt es die Auswahl von Mail-Transport-Agenten, X-Servern und so weiter.
es: El sistema de dependencias permite el uso de elementos compartidos en el sistema por programas individuales, tales como bibliotecas. Ésto simplifica ubicar porciones poco usadas de programas en distintos paquetes para así reducir el número de cosas que el usuario medio tiene que instalar. También permite elegir el agente de transporte del correo electrónico, el servidor de X y demás.

source: The first step to understanding the dependency system is to grasp the concept of a simple dependency. The meaning of a simple dependency is that a package requires another package to be installed at the same time to work properly.
de: Der erste Schritt zum Verständnis des Abhängigkeitssystems besteht darin, das Konzept einer einfachen Abhängigkeit zu begreifen. Die Bedeutung einer einfachen Abhängigkeit besteht darin, dass ein Paket ein anderes Paket benötigt, das zu gleichen Zeit installiert sein muss, um ordentlich zu funktionieren.
es: El primer paso para entender el sistema de dependencias es familiarizarse con el concepto de dependencia simple. El significado de una dependencia simple es que un paquete requiere que otro también esté instalado para poder funcionar correctamente.

source: For instance, mailcrypt is an emacs extension that aids in encrypting email with GPG. Without GPGP installed mailcrypt is useless, so mailcrypt has a simple dependency on GPG. Also, because it is an emacs extension it has a simple dependency on emacs, without emacs it is completely useless.
de: Mailcrypt ist zum Beispiel eine Emacs-Erweiterung, die hilft, E-Mails mit GPG zu verschlüsseln. Ohne installiertes GPG ist Mailcrypt unbrauchbar, deshalb hat Mailcrypt eine einfache Abhängigkeit von GPG. Da es außerdem eine Emacs-Erweiterung ist, hat es ebenfalls eine einfache Abhängigkeit von Emacs. Ohne Emacs ist es komplett unbenutzbar.
es: Por ejemplo, mailcrypt es una extensión de emacs que asiste en el cifrado de correo con GPG. Sin GPG, mailcrypt es inservible, y por ello mailcrypt tiene una dependencia simple con GPG. Como también es una extensión de emacs tiene una dependencia simple con emacs, ya que sin él mailcrypt es inservible.

source: The other important dependency to understand is a conflicting dependency. It means that a package, when installed with another package, will not work and may possibly be extremely harmful to the system. As an example consider a mail transport agent such as sendmail, exim or qmail. It is not possible to have two mail transport agents installed because both need to listen to the network to receive mail. Attempting to install two will seriously damage the system so all mail transport agents have a conflicting dependency with all other mail transport agents.
de: Die andere wichtige Abhängigkeit, die es zu verstehen gilt, ist eine in Konflikt stehende Abhängigkeit. Das bedeutet, dass das Paket, wenn es mit einem anderen Paket installiert ist, nicht funktioniert und möglicherweise extrem schädlich für das System sein könnte. Stellen Sie sich als Beispiel einen Mail-Transport-Agenten wie Sendmail, Exim oder QMail vor. Es ist nicht möglich, zwei Mail-Transport-Agenten installiert zu haben, da beide im Netzwerk auf zu empfangende Mails warten. Der Versuch, zwei zu installieren, würde das System ernsthaft beschädigen, weshalb alle Mail-Transport-Agenten in Konflikt stehende Abhängigkeiten mit allen anderen Mail-Transport-Agenten haben.
es: Otra importante dependencia que debe entender es la dependencia de conflicto. Esto se produce cuando se instala un paquete junto con otro de modo que la combinación los hace inservibles, pudiendo causar daños en el sistema. Como ejemplo, suponga un agente de transporte de correo electrónico como sendmail, exim o qmail. Es imposible tener dos agentes de transporte de correo instalados ya que ambos necesitan una conexión con la red para recibir correo. El intento de instalar dos puede dañar gravemente el sistema, y por ello todos los agentes de transporte de correo tienen una dependencia de conflicto con todos los demás.

source: As an added complication there is the possibility for a package to pretend to be another package. Consider that exim and sendmail for many intents are identical, they both deliver mail and understand a common interface. Hence, the package system has a way for them to declare that they are both mail-transport-agents. So, exim and sendmail both declare that they provide a mail-transport-agent and other packages that need a mail transport agent depend on mail-transport-agent. This can add a great deal of confusion when trying to manually fix packages.
de: Als zusätzliche Komplikation besteht die Möglichkeit, dass ein Paket vortäuscht, ein anderes Paket zu sein. Bedenken Sie, dass Exim und Sendmail in vieler Hinsicht identisch sind – sie liefern beide E-Mails aus und verstehen eine gemeinsame Schnittstelle. Daher hat das Paketsystem die Möglichkeit, beide als Mail-Transport-Agenten zu deklarieren. Deshalb deklarieren Exim und Sendmail, dass sie einen Mail-Transport-Agenten bereitstellen und andere Pakete, die einen Mail-Transport-Agenten benötigen, dass sie von einem Mail-Transport-Agenten abhängen. Die kann zu großer Verwirrung führen, wenn manuell versucht wird, Pakete zu reparieren.
es: Para complicarlo todo, cabe la posibilidad de que un paquete pretenda ser otro. En muchos aspectos, exim y sendmail son idénticos; ambos envían correo y entienden una misma interfaz. Por ello, el sistema de paquetes tiene una forma de hacer que ambos declaren ser agentes de transporte de correo («mail-transport-agent»). Así, exim y sendmail declaran que proporcionan un agente de transporte de correo y los paquetes que dependen de tales agentes dependerán de «mail-transport-agent». Esto puede añadir confusión al intentar arreglar paquetes manualmente.

source: At any given time a single dependency may be met by packages that are already installed or it may not be. APT attempts to help resolve dependency issues by providing a number of automatic algorithms that help in selecting packages for installation.
de: Zu jeder Zeit könnte eine einzelne Abhängigkeit von Paketen vorgefunden werden, die bereits installiert sind oder nicht. APT versucht beim Auflösen von Abhängigkeitsproblemen zu helfen, indem es eine Anzahl automatischer Algorithmen bereitstellt, die bei der Auswahl von Paketen zur Installation helfen.
es: Puede que en cualquier momento una dependencia simple se satisfaga por paquetes ya instalados, o que la dependencia no esté satisfecha. APT intenta asistir en la resolución de problemas de dependencias mediante un número de algoritmos automáticos que ayudan en la selección de paquetes a instalar.

source: <prgn>apt-get</prgn> provides a simple way to install packages from the command line. Unlike <prgn>dpkg</prgn>, <prgn>apt-get</prgn> does not understand .deb files, it works with the package's proper name and can only install .deb archives from a <em>Source</em>.
de: <prgn>apt-get</prgn> stellt eine einfache Möglichkeit zu Verfügung, Pakete auf der Befehlszeile zu installieren. Anders als <prgn>dpkg</prgn> versteht <prgn>apt-get</prgn> keine .deb-Dateien. Es arbeitet mit dem Eigennamen des Pakets und kann .deb-Archive nur aus einer <em>Quelle</em> installieren.
es: <prgn>apt-get</prgn> ofrece una forma sencilla de instalar paquetes desde la línea de órdenes. A diferencia de <prgn>dpkg</prgn>, <prgn>apt-get</prgn> no intenta comprender los ficheros «.deb», sino que funciona con el nombre real del paquete y sólo puede instalar ficheros «.deb» desde una <em>fuente</em>.

source: The first <footnote><p>If you are using an http proxy server you must set the http_proxy environment variable first, see sources.list(5)</p></footnote> thing that should be done before using <prgn>apt-get</prgn> is to fetch the package lists from the <em>Sources</em> so that it knows what packages are available. This is done with <tt>apt-get update</tt>. For instance,
de: Das Erste <footnote><p>Falls Sie einen HTTP-Proxy-Server benutzen, müssen Sie zuerst die Umgebungsvariable »http_proxy« setzen, siehe sources.list(5)</p></footnote>, das Sie vor der Benutzung von <prgn>apt-get</prgn> tun sollten, ist es, die Paketlisten von der <em>Quelle</em> herunterzuladen, so dass es weiß, welche Pakete verfügbar sind. Dies wird mit <tt>apt-get update</tt> erledigt. Zum Beispiel,
es: La primera <footnote><p>Si está usando un servidor proxy primero debe definir la variable de entorno http_proxy, consulte sources.list (5).</p></footnote> cosa que debería hacer antes de usar <prgn>apt-get</prgn> es obtener las listas de paquetes desde las <em>fuentes</em> para así conocer los paquetes disponibles. Puede hacer esto mediante <tt>apt-get update</tt>. Por ejemplo,

source: # apt-get update Get http://ftp.de.debian.org/debian-non-US/ stable/binary-i386/ Packages Get http://llug.sep.bnl.gov/debian/ testing/contrib Packages Reading Package Lists... Done Building Dependency Tree... Done
de: # apt-get update OK http://ftp.de.debian.org/debian-non-US/ stable/binary-i386/ Packages OK http://llug.sep.bnl.gov/debian/ testing/contrib Packages Paketlisten werden gelesen … Fertig Abhängigkeitsbaum wird aufgebaut … Fertig
es: # apt-get update Des http://ftp.de.debian.org/debian-non-US/ stable/binary-i386/ Packages Des http://llug.sep.bnl.gov/debian/ testing/contrib Packages Leyendo lista de paquetes... Hecho Creando árbol de dependencias... Hecho

source: Once updated there are several commands that can be used:
de: Einmal aktualisiert stehen mehrere Befehl zur Benutzung zur Verfügung:
es: Puede usar varias órdenes después de actualizar:

source: Upgrade will attempt to gently upgrade the whole system. Upgrade will never install a new package or remove an existing package, nor will it ever upgrade a package that might cause some other package to break. This can be used daily to relatively safely upgrade the system. Upgrade will list all of the packages that it could not upgrade, this usually means that they depend on new packages or conflict with some other package. <prgn>dselect</prgn> or <tt>apt-get install</tt> can be used to force these packages to install.
de: »Upgrade« wird versuchen, ein behutsames Upgrade des ganzen Systems durchzuführen. »Upgrade« wird niemals ein neues Paket installieren oder entfernen, noch wird es jemals ein Upgrade eines Pakets durchführen, das andere Pakete beschädigen könnte. Dies kann täglich dazu benutzt werden, um ein relativ sicheres Upgrade des Systems durchzuführen. »Upgrade« wird alle Pakete auflisten, von denen es kein Upgrade durchführen kann, was üblicherweise bedeutet, dass sie von neuen Paketen abhängen oder Konflikte mit anderen Paketen haben. <prgn>dselect</prgn> oder <tt>apt-get install</tt> können benutzt werden, um die Installation von diesen Paketen zu erzwingen.
es: «upgrade» intentará actualizar con cuidado todo el sistema. «upgrade» nunca intentará instalar un paquete nuevo o eliminar un paquete existente, y en ningún caso actualizará un paquete que pueda causar un problema de dependencias rotas a otro paquete. «upgrade» mostrará todos los paquetes que no pudo actualizar, lo cual generalmente significa que dependen de paquetes nuevos o que entran en conflicto con otro paquete. Puede usar <prgn>dselect</prgn> o <tt>apt-get install</tt> para forzar la instalación de tales paquetes.

source: Install is used to install packages by name. The package is automatically fetched and installed. This can be useful if you already know the name of the package to install and do not want to go into a GUI to select it. Any number of packages may be passed to install, they will all be fetched. Install automatically attempts to resolve dependency problems with the listed packages and will print a summary and ask for confirmation if anything other than its arguments are changed.
de: »Install« wird benutzt, um Pakete nach Namen zu installieren. Das Paket wird automatisch heruntergeladen und installiert. Dies kann nützlich sein, wenn Sie bereits den Namen des zu installierenden Pakets kennen und keine GUI aufrufen möchten, um es auszuwählen. Jede Anzahl von Paketen könnte zum Installieren übergeben werden, sie werden alle heruntergeladen. »Install« versucht automatisch Abhängigkeitsprobleme mit den aufgelisteten Paketen aufzulösen, wird eine Zusammenfassung ausgeben und nach einer Bestätigung fragen, wenn sich etwas anderes als dessen Argumente ändert.
es: «install» se usa para instalar paquetes por nombre. El paquete se obtendrá e instalará automáticamente. Es de utilidad si ya conoce el nombre del paquete a instalar y no desea ejecutar una interfaz gráfica para seleccionarlo. Puede introducir cualquier número de paquetes para su instalación y todos se obtendrán. La instalación automática intenta resolver problemas de dependencias con los paquetes listados, y mostrará un resumen al pedir una confirmación en caso de modificar cualquiera de los argumentos introducidos.

source: Dist-upgrade is a complete upgrader designed to simplify upgrading between releases of Debian. It uses a sophisticated algorithm to determine the best set of packages to install, upgrade and remove to get as much of the system to the newest release. In some situations it may be desired to use dist-upgrade rather than spend the time manually resolving dependencies in <prgn>dselect</prgn>. Once dist-upgrade has completed then <prgn>dselect</prgn> can be used to install any packages that may have been left out.
de: »Dist-upgrade« führt vollständige Upgrades durch. Es wurde entworfen, um Upgrades zwischen Releases von Debian zu vereinfachen. Es benutzt einen ausgeklügelten Algorithmus, um die beste Zusammenstellung von Paketen zum Installieren, für das Upgrade oder zum Entfernen festzulegen, um soviel wie möglich vom System auf das neuste Release zu bekommen. In einigen Situationen könnte es eher gewünscht sein, »dist-upgrade« zu benutzen, als Zeit in das manuelle Auflösen von Abhängigkeiten in <prgn>dselect</prgn> zu investieren. Ist »Dist-upgrade« erst vollständig, dann kann <prgn>dselect</prgn> benutzt werden, um einige Pakete zu installieren, die außen vor geblieben sind.
es: «dist-upgrade» es una actualizador completo diseñado para simplificar la actualización entre publicaciones de Debian. Usa un sofisticado algoritmo para diseñar el mejor conjunto de paquetes a instalar, actualizar y eliminar para así obtener cuanto sea posible de la última publicación. Puede que en algunas situaciones desee usar «dist-upgrade» en lugar de pasar tiempo resolviendo dependencias con <prgn>dselect</prgn>. Puede usar <prgn>dselect</prgn> para instalar cualquier paquete que se haya quedado atrás.

source: It is important to closely look at what dist-upgrade is going to do, its decisions may sometimes be quite surprising.
de: Es ist wichtig, genau zu schauen, was »Dist-upgrade« tun wird, seine Entscheidungen können manchmal ziemlich überraschend sein.
es: Es importante revisar lo que «dist-upgrade» planea hacer, ya que sus decisiones a veces pueden resultar sorprendentes.

source: <prgn>apt-get</prgn> has several command line options that are detailed in its man page, <manref section="8" name="apt-get">. The most useful option is <tt>-d</tt> which does not install the fetched files. If the system has to download a large number of package it would be undesired to start installing them in case something goes wrong. When <tt>-d</tt> is used the downloaded archives can be installed by simply running the command that caused them to be downloaded again without <tt>-d</tt>.
de: <prgn>apt-get</prgn> hat mehrere Befehlszeilenoptionen, die sich detailliert in dessen Handbuchseite, <manref section="8" name="apt-get"> finden. Die nützlichste Option ist <tt>-d</tt>, die die heruntergeladenen Dateien nicht installiert. Falls das System eine große Anzahl Pakete herunterladen soll, würde es nicht erwünscht sein, wenn die Installation in dem Fall gestartet würde, wenn etwas schief läuft. Falls <tt>-d</tt> benutzt wird, können die heruntergeladenen Archive dadurch installiert werden, indem einfach der Befehl, der das Herunterladen veranlasste, erneut ohne <tt>-d</tt> ausführt wird.
es: <prgn>apt-get</prgn> ofrece varias opciones de línea de órdenes detalladas en su página de manual, <manref section="8" name="apt-get">. La opción más útil es <tt>-d</tt>, que no instala los ficheros obtenidos. Puede que no desee instalar los paquetes de inicio si el sistema se tiene que descargar un gran número de éstos, en caso de que algo vaya mal. Cuando usa <tt>-d</tt> puede instalar los ficheros descargados simplemente ejecutando la orden que provocó su descarga, sin <tt>-d</tt>.

source: The APT <prgn>dselect</prgn> method provides the complete APT system with the <prgn>dselect</prgn> package selection GUI. <prgn>dselect</prgn> is used to select the packages to be installed or removed and APT actually installs them.
de: Die APT-<prgn>dselect</prgn>-Methode stellt das komplette APT-System mit dem <prgn>dselect</prgn>-Paketauswahl-GUI bereit. <prgn>dselect</prgn> wird benutzt, um Pakete zum Installieren oder Entfernen auszuwählen und APT installiert sie tatsächlich.
es: El método <prgn>dselect</prgn> de APT ofrece el sistema completo de APT con la interfaz gráfica de selección de paquetes <prgn>dselect</prgn>. <prgn>dselect</prgn> se usa para seleccionar los paquetes a instalar o desinstalar que en realidad instalará APT.

source: To enable the APT method you need to select [A]ccess in <prgn>dselect</prgn> and then choose the APT method. You will be prompted for a set of <em>Sources</em> which are places to fetch archives from. These can be remote Internet sites, local Debian mirrors or CDROMs. Each source can provide a fragment of the total Debian archive, APT will automatically combine them to form a complete set of packages. If you have a CDROM then it is a good idea to specify it first and then specify a mirror so that you have access to the latest bug fixes. APT will automatically use packages on your CDROM before downloading from the Internet.
de: Um die APT-Methode einzuschalten, müssen Sie [Z]ugriff in <prgn>dselect</prgn> auswählen und dann die APT-Methode wählen. Sie werden nach einer Zusammenstellung von <em>Quellen</em> gefragt. Dies sind Plätze, von denen Archive heruntergeladen werden. Dies können ferne Internetsites, lokale Debian-Spiegel oder CD-ROMs sein. Jede Quelle kann einen Ausschnitt des gesamten Debian-Archives bereitstellen. APT wird sie automatisch kombinieren, um eine komplette Zusammenstellung von Paketen zu formen. Falls Sie eine CD-ROM haben, ist es eine gute Idee, sie als erstes und dann den Spiegel anzugeben, so dass Sie Zugriff auf die neusten Fehlerbehebungen haben. APT wird automatisch Pakete auf der CD-ROM benutzen, bevor es sie aus dem Internet herunterlädt.
es: Para habilitar el método APT tiene que seleccionar [M]étodo en <prgn>dselect</prgn>, y después seleccionar el método APT. Se le pedirá un conjunto de <em>fuentes</em>, ubicaciones de donde obtener los ficheros. Pueden ser sitios remotos de Internet, replicas locales de Debian o discos ópticos. Cada fuente puede proporcionar un fragmento del total del archivo Debian, los cuales APT combinará automáticamente para formar un conjunto completo de paquetes. Si tiene un disco óptico es una buena idea definirlo primero en el fichero de configuración y después especificar una replica para así tener acceso a los últimos arreglos de fallos. APT usará automáticamente los paquetes del disco óptico en lugar de descargarlos de Internet.

source: Set up a list of distribution source locations Please give the base URL of the debian distribution. The access schemes I know about are: http file For example: file:/mnt/debian, ftp://ftp.debian.org/debian, http://ftp.de.debian.org/debian, URL [http://llug.sep.bnl.gov/debian]:
de: eine Liste mit Orten von Distributionsquellen einrichten Bitte geben Sie die Basis-URL der Debian-Distribution an. Die bekannten Zugriffsschemata dafür sind: http file Zum Beispiel: file:/mnt/debian, ftp://ftp.debian.org/debian, http://ftp.de.debian.org/debian, URL [http://llug.sep.bnl.gov/debian]:

source: The <em>Sources</em> setup starts by asking for the base of the Debian archive, defaulting to a HTTP mirror. Next it asks for the distribution to get.
de: Das Einrichten der <em>Quellen</em> beginnt durch das Erfragen der Basis des Debian-Archives, vorgegeben ist ein HTTP-Spiegel. Als nächstes wird nach der zu erhaltenden Distribution gefragt.
es: La configuración de las <em>fuentes</em> comienza preguntando la base del archivo de Debian, cuyo valor predeterminado es una réplica HTTP. A continuación, preguntará la distribución a obtener.

source: Please give the distribution tag to get or a path to the package file ending in a /. The distribution tags are typically something like: stable unstable testing non-US Distribution [stable]:
de: Bitte geben Sie die zu erhaltende Distributionskennzeichnung oder den mit einem / endenden Pfad zum Paket an. Die Distributionskennzeichnungen sind normalerweise etwas wie: stable unstable testing non-US Distribution [stable]:

source: The distribution refers to the Debian version in the archive, <em>stable</em> refers to the latest released version and <em>unstable</em> refers to the developmental version. <em>non-US</em> is only available on some mirrors and refers to packages that contain encryption technology or other things that cannot be exported from the United States. Importing these packages into the US is legal however.
de: Die Distribution bezieht sich auf die Debian-Version im Archiv, <em>stable</em> bezieht sich auf die zuletzt veröffentlichte Version und <em>unstable</em> bezieht sich auf die Entwicklungsversion. <em>non-US</em> ist nur auf einigen Spiegeln verfügbar und bezieht sich auf Pakete, die Verschlüsselungstechnologie oder andere Dinge enthalten, die nicht aus den Vereinigten Staaten exportiert werden können. Diese Pakete in die USA zu importieren ist jedoch legal.
es: La distribución se refiere a la versión de Debian en el archivo, <em>stable</em> (estable) se refiere a la última versión publicada, y <em>unstable</em> (inestable) se refiere a la versión en desarrollo. <em>non-US</em> sólo está disponible en algunas réplicas, aquellos paquetes que contienen tecnología cifrada y otras cosas que no se pueden exportar desde los Estados Unidos. Aun así, importar estos paquetes a E.E.U.U es ilegal.
