Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: The <literal>deb</literal> type describes a typical two-level Debian archive, <filename>distribution/component</filename>. Typically, <literal>distribution</literal> is generally an archivename like <literal>stable</literal> or <literal>testing</literal> or a codename like <literal>&stable-codename;</literal> or <literal>&testing-codename;</literal> while component is one of <literal>main</literal> <literal>contrib</literal> or <literal>non-free</literal>. The <literal>deb-src</literal> type describes a debian distribution's source code in the same form as the <literal>deb</literal> type. A <literal>deb-src</literal> line is required to fetch source indexes.
de: Der <literal>deb</literal>-Typ beschreibt ein typisches zweistufiges Debian-Archiv, <filename>Distribution/Komponente</filename>. <literal>Distribution</literal> ist typischerweise ein Archivname wie <literal>stable</literal> oder <literal>testing</literal> oder ein Kodename wie <literal>&stable-codename;</literal> oder <literal>&testing-codename;</literal> während Komponente entweder <literal>main</literal>, <literal>contrib</literal> oder <literal>non-free</literal> ist. Der <literal>deb-src</literal>-Typ beschreibt den Quellcode einer Debian-Distribution in der gleichen Form wie den <literal>deb</literal>-Typ. Eine <literal>deb-src</literal>-Zeile wird benötigt, um Quellindizes herunterzuladen.

source: The format for a <filename>sources.list</filename> entry using the <literal>deb</literal> and <literal>deb-src</literal> types is:
de: Das Format für einen <filename>sources.list</filename>-Eintrag, der die <literal>deb</literal>- und <literal>deb-src</literal>-Typen benutzt, ist:
es: El formato para una entrada en el fichero <filename>sources.list</filename> usando los tipos <literal>deb</literal> y <literal>deb-src</literal> es:

source: The URI for the <literal>deb</literal> type must specify the base of the Debian distribution, from which APT will find the information it needs. <literal>distribution</literal> can specify an exact path, in which case the components must be omitted and <literal>distribution</literal> must end with a slash (/). This is useful for when the case only a particular sub-section of the archive denoted by the URI is of interest. If <literal>distribution</literal> does not specify an exact path, at least one <literal>component</literal> must be present.
de: Die URI für den <literal>deb</literal>-Typ muss die Basis der Debian-Distribution angeben, wo APT die Informationen findet, die es benötigt. <literal>Distribution</literal> kann einen genauen Pfad angeben. In diesem Fall müssen die Komponenten weggelassen werden und <literal>Distribution</literal> muss mit einem Schrägstrich (/) enden. Dies ist nützlich, wenn nur ein bestimmter Unterabschnitt des von der URI angegebenen Archivs von Interesse ist. Wenn <literal>Distribution</literal> keinen genauen Pfad angibt, muss mindestens eine <literal>Komponente</literal> angegeben sein.
es: La URI para el tipo <literal>deb</literal> debe especificar la base de la distribución de Debian desde la que APT encontrará la información que necesita. <literal>distribución</literal> puede definir una ruta exacta, en cuyo caso debe omitir los componentes y <literal>distribución</literal> debe finalizar con una barra (/). Esto es útil cuando sólo se quiere una sub-sección del archivo señalado por la URI. Al menos uno de los <literal>componentes</literal> debe estar presente si <literal>distribución</literal> no define una ruta exacta.

source: <literal>distribution</literal> may also contain a variable, <literal>$(ARCH)</literal> which expands to the Debian architecture (i386, m68k, powerpc, ...) used on the system. This permits architecture-independent <filename>sources.list</filename> files to be used. In general this is only of interest when specifying an exact path, <literal>APT</literal> will automatically generate a URI with the current architecture otherwise.
de: <literal>Distribution</literal> könnte außerdem eine Variable, <literal>$(ARCH)</literal>, enthalten, die zur Debian-Architektur (i386, m68k, powerpc, …) expandiert wird, die auf dem System benutzt wird. Dies erlaubt es, architekturabhängige <filename>sources.list</filename>-Dateien zu benutzen. Im Allgemeinen ist dies nur von Interesse, wenn ein genauer Pfad angegeben wird, andernfalls wird <literal>APT</literal> automatisch eine URI mit der aktuellen Architektur generieren.
es: <literal>distribución</literal> puede contener una variable, <literal>$(ARCH)</literal>, que se expandirá a la arquitectura de Debian usada en el sistema (i386, m68k, powerpc, ...). Esto permite que los ficheros <filename>sources.list</filename> sean independientes de la arquitectura. En general, esta característica sólo es de interés si se especifica una ruta completa, de lo contrario <literal>APT</literal> generará automáticamente la URI con la arquitectura actual del sistema.

source: Since only one distribution can be specified per line it may be necessary to have multiple lines for the same URI, if a subset of all available distributions or components at that location is desired. APT will sort the URI list after it has generated a complete set internally, and will collapse multiple references to the same Internet host, for instance, into a single connection, so that it does not inefficiently establish an FTP connection, close it, do something else, and then re-establish a connection to that same host. This feature is useful for accessing busy FTP sites with limits on the number of simultaneous anonymous users. APT also parallelizes connections to different hosts to more effectively deal with sites with low bandwidth.
de: Da pro Zeile nur eine Distribution angegeben werden kann, könnte es nötig sein, mehrere Zeilen für die gleiche URI zu haben, falls eine Untermenge aller verfügbarer Distributionen oder Komponenten von diesem Ort gewünscht wird. APT wird die URI-Liste sortieren, nachdem es intern eine komplette Zusammenstellung generiert hat und es wird mehrere Bezüge zum gleichen Internet-Host zusammenfassen, zum Beispiel zu einer einzigen Verbindung, so dass es nicht ineffizient FTP-Verbindungen herstellt, sie schließt, sonst etwas tut und dann erneut eine Verbindung zum gleichen Host herstellt. Diese Funktion ist nützlich für den Zugriff auf ausgelastete FTP-Sites mit Begrenzungen der Anzahl gleichzeitiger anonymer Anwender. APT parallelisiert außerdem Verbindungen zu verschiedenen Hosts, um effektiver mit Orten niedriger Bandbreite hauszuhalten.
es: Debido a que sólo se puede especificar una distribución por línea, es posible que se precisen varias líneas para la misma URI si desea tener acceso a más de una distribución o componente de esa ubicación. APT ordenará internamente la lista de direcciones URI después de generar una copia interna, y unirá varias referencias al mismo servidor de Internet en una sola conexión, para así no establecer una conexión FTP de forma ineficiente, cerrarla, hacer otra cosa, y entonces restablecer la conexión con el mismo servidor. Esta característica es útil para acceder a sitios FPT muy visitados que limitan el número de accesos simultáneos a usuarios anónimos. APT también realizará conexiones paralelas a diferentes servidores para aprovechar mejor el ancho de banda.

source: <literal>arch=<replaceable>arch1</replaceable>,<replaceable>arch2</replaceable>,…</literal> can be used to specify for which architectures packages information should be downloaded. If this option is not set all architectures defined by the <literal>APT::Architectures</literal> option will be downloaded.
de: <literal>arch=<replaceable>Architektur1</replaceable>,<replaceable>Architektur2</replaceable>, …</literal> kann benutzt werden, um anzugeben, für welche Architekturen Paketinformationen heruntergeladen werden sollen. Falls diese Option nicht gesetzt ist, werden alle durch die Option <literal>APT::Architectures</literal> definierten Architekturen heruntergeladen.

source: It is important to list sources in order of preference, with the most preferred source listed first. Typically this will result in sorting by speed from fastest to slowest (CD-ROM followed by hosts on a local network, followed by distant Internet hosts, for example).
de: Es ist wichtig, die Quellen in der Reihenfolge ihrer Wichtigkeit aufzulisten, die bevorzugte Quelle zuerst. Typischerweise resultiert dies in einer Sortierung nach Geschwindigkeit, vom schnellsten zum langsamsten (CD-ROM, gefolgt von Rechnern im lokalen Netzwerk, gefolgt von Internet-Rechnern, zum Beispiel).
es: Es importante listar las fuentes por orden de preferencia, con la fuente preferente al inicio. Lo normal es ordenar las fuentes por velocidad, de la más rápida a la más lenta (CD-ROM seguido de servidores en la red local, seguidos por servidores de Internet distantes, por ejemplo).

source: Some examples:
de: Einige Beispiele:
es: Algunos ejemplos:

source: URI specification
de: URI-Beschreibung
es: Especificación de la URI

source: The file scheme allows an arbitrary directory in the file system to be considered an archive. This is useful for NFS mounts and local mirrors or archives.
de: Das file-Schema erlaubt es einem beliebigen Verzeichnis im Dateisystem, als Archiv betrachtet zu werden. Dies ist nützlich für eingehängtes NFS und lokale Spiegel oder Archive.
es: El esquema «file» permite considerar cualquier directorio en el sistema de ficheros como un archivo de paquetes adicional. Esto es útil para particiones montadas mediante NFS y réplicas o archivos de paquetes locales.

source: The cdrom scheme allows APT to use a local CDROM drive with media swapping. Use the &apt-cdrom; program to create cdrom entries in the source list.
de: Das cdrom-Schema erlaubt APT ein lokales CD-ROM-Laufwerk mit Medienwechsel zu benutzen. Benutzen Sie das Programm &apt-cdrom;, um CD-ROM-Einträge in der Quellenliste zu erstellen.
es: El esquema «cdrom» permite a APT usar la unidad de CDROM local. Use el programa &apt-cdrom; para añadir entradas de un disco óptico a «sources.list».

source: The http scheme specifies an HTTP server for the archive. If an environment variable <envar>http_proxy</envar> is set with the format http://server:port/, the proxy server specified in <envar>http_proxy</envar> will be used. Users of authenticated HTTP/1.1 proxies may use a string of the format http://user:pass@server:port/. Note that this is an insecure method of authentication.
de: Das http-Schema gibt einen HTTP-Server für das Archiv an. Wenn eine Umgebungsvariable <envar>http_proxy</envar> mit dem Format http://Server:Port/ gesetzt ist, wird der in <envar>http_proxy</envar> angegebene Proxy-Server benutzt. Anwender eines HTTP/1.1-authentifizierten Proxys können eine Zeichenkette mit dem Format http://Anwender:Passwort@Server:Port/ benutzt. Beachten Sie, dass dies eine unsichere Authentifizierungsmethode ist.
es: El esquema «http» especifica un servidor HTTP como archivo. Si la variable de entorno <envar>http_proxy</envar> está definida con formato «http://servidor:puerto/», se usará el servidor proxy definido en <envar>http_proxy</envar>. Los usuarios de servidores proxy con autenticación HTTP/1.1 deberán usar la cadena de caracteres «http://usuario:contraseña@servidor:puerto/». Tenga en cuenta que este método de autenticación no es seguro.

source: The ftp scheme specifies an FTP server for the archive. APT's FTP behavior is highly configurable; for more information see the &apt-conf; manual page. Please note that a ftp proxy can be specified by using the <envar>ftp_proxy</envar> environment variable. It is possible to specify a http proxy (http proxy servers often understand ftp urls) using this method and ONLY this method. ftp proxies using http specified in the configuration file will be ignored.
de: Das ftp-Schema gibt einen FTP-Server für das Archiv an. Das FTP-Verhalten von APT ist in hohem Maße konfigurierbar. Um weitere Informationen zu erhalten, lesen Sie die &apt-conf;-Handbuchseite. Bitte beachten Sie, dass ein FTP-Proxy durch Benutzung der <envar>ftp_proxy</envar>-Umgebungsvariablen angegeben werden kann. Es ist mit dieser Methode und NUR dieser Methode möglich, einen HTTP-Proxy anzugeben (HTTP-Proxy-Server verstehen oft auch FTP-URLs). FTP-Proxys, die gemäß Angabe in der Konfigurationsdatei HTTP benutzen, werden ignoriert.
es: El esquema «ftp» especifica un servidor FTP como archivo. El comportamiento de APT con FTP es altamente configurable, para más información consulte la página de manual de &apt-conf;. Tenga en cuenta que puede especificar un proxy ftp usando la variable de entorno <envar>ftp_proxy</envar>. Es posible especificar un servidor proxy http (los servidores proxy http normalmente comprenden las url de tipo ftp) usando este método y SÓLO este método. Se ignorarán proxies ftp definidos en el fichero de configuración que usen http.

source: The copy scheme is identical to the file scheme except that packages are copied into the cache directory instead of used directly at their location. This is useful for people using a zip disk to copy files around with APT.
de: Das copy-Schema ist identisch mit dem file-Schema, außer dass Pakete in das Zwischenspeicherverzeichnis kopiert werden, anstatt direkt von ihrem Herkunftsort benutzt zu werden. Dies ist für Leute nützlich, die eine ZIP-Platte benutzen, um Dateien mit APT umherzukopieren.
es: El esquema «copy» es idéntico a «file», pero los paquetes se copian al directorio almacén en vez de usarlos directamente en su ubicación original. Esto es útil para gente que use discos zip con APT.

source: The rsh/ssh method invokes rsh/ssh to connect to a remote host as a given user and access the files. It is a good idea to do prior arrangements with RSA keys or rhosts. Access to files on the remote uses standard <command>find</command> and <command>dd</command> commands to perform the file transfers from the remote.
de: Die rsh/ssh-Methode ruft rsh/ssh auf, um sich als angegebener Benutzer mit einem Rechner in der Ferne zu verbinden und auf die Dateien zuzugreifen. Es ist eine gute Idee, vorher Vorbereitungen mit RSA-Schlüsseln oder rhosts zu treffen. Der Zugriff auf Dateien in der Ferne benutzt die Standardbefehle <command>find</command> und <command>dd</command>, um die Datenübertragung aus der Ferne durchzuführen.
es: El método «rsh/ssh» invoca «rsh/ssh» para establecer conexiones con los servidores remotos como un usuario dado, y acceder a los ficheros. Es aconsejable realizar previamente una configuración de claves RSA o rhosts. El acceso a los ficheros remotos usa las órdenes estándar <command>find</command> y <command>dd</command> para realizar la transferencia de ficheros.

source: more recognizable URI types
de: weitere erkennbare URI-Typen
es: Otros tipos de URI reconocidos.

source: APT can be extended with more methods shipped in other optional packages which should follow the nameing scheme <literal>apt-transport-<replaceable>method</replaceable></literal>. The APT team e.g. maintains also the <literal>apt-transport-https</literal> package which provides access methods for https-URIs with features similar to the http method, but other methods for using e.g. debtorrent are also available, see <citerefentry> <refentrytitle><filename>apt-transport-debtorrent</filename></refentrytitle> <manvolnum>1</manvolnum></citerefentry>.
de: APT kann mit weiteren Methoden, die in anderen optionalen Paketen geliefert werden, die dem Namensschema <literal>apt-transport-<replaceable>Methode</replaceable></literal> folgen sollten, erweitert werden. Das APT-Team betreut z.B. außerdem das Paket <literal>apt-transport-https</literal>, das Zugriffsmethoden für HTTPS-URIs mit Funktionen bereitstellt, die denen der HTTP-Methode ähneln, bei der aber andere Methoden für z.B. debtorrent verfügbar sind, siehe <citerefentry> <refentrytitle><filename>apt-transport-debtorrent</filename></refentrytitle> <manvolnum>1</manvolnum></citerefentry>.
es: Puede extender APT con más métodos, proporcionados en otros paquetes opcionales que siguen el esquema de nombre <literal>apt-transport-<replaceable>método</replaceable></literal>. El equipo de APT, por ejemplo, es responsable del paquete <literal>apt-transport-https</literal>, que ofrece métodos de acceso para URI https con características similares al método «http». Existen otros métodos disponibles, por ejemplo «debtorrent», consulte <citerefentry> <refentrytitle><filename>apt-transport-debtorrent</filename></refentrytitle> <manvolnum>1</manvolnum></citerefentry>.

source: The currently recognized URI types are cdrom, file, http, ftp, copy, ssh, rsh. <placeholder type="variablelist" id="0"/>
de: Die aktuell erkannten URI-Typen sind »cdrom«, »file«, »http«, »ftp«, »copy«, »ssh«, »rsh«. <placeholder type="variablelist" id="0"/>
es: Los tipos de URI reconocidos son cdrom, file, http, ftp, copy, ssh y rsh. <placeholder type="variablelist" id="0"/>

source: Uses the archive stored locally (or NFS mounted) at /home/jason/debian for stable/main, stable/contrib, and stable/non-free.
de: Benutzt die lokal gespeicherten (oder per NFS eingehängten) Archive in /home/jason/debian für stable/main, stable/contrib und stable/non-free.
es: Usa el archivo local (o montado mediante NFS) en «/home/jason/debian» para «stable/main», «stable/contrib», y «stable/non-free».

source: As above, except this uses the unstable (development) distribution.
de: Wie oben, außer das dies die »unstable«- (Entwicklungs-) Distribution benutzt.
es: Como arriba, excepto que usa la distribución «unstable» (en desarrollo).

source: Source line for the above
de: Quellzeile für obiges
es: Línea para obtener el código fuente desde la ubicación anterior.

source: The first line gets package information for the architectures in <literal>APT::Architectures</literal> while the second always retrieves <literal>amd64</literal> and <literal>armel</literal>.
de: Die erste Zeile bekommt Paketinformationen für die Architekturen in <literal>APT::Architectures</literal>, während die zweite immer <literal>amd64</literal> und <literal>armel</literal> holt.

source: Uses HTTP to access the archive at archive.debian.org, and uses only the hamm/main area.
de: Benutzt HTTP, um auf das Archiv auf archive.debian.org zuzugreifen und nur den hamm/main-Bereich zu benutzen.
es: Usa HTTP para acceder al archivo de Debian en «archive.debian.org», y usa sólo la sección «hamm/main».

source: Uses FTP to access the archive at ftp.debian.org, under the debian directory, and uses only the &stable-codename;/contrib area.
de: Benutzt FTP, um auf das Archiv auf archive.debian.org unter dem debian-Verzeichnis zuzugreifen und nur den &stable-codename;/contrib-Bereich zu benutzen.
es: Usa FTP para acceder al archivo de Debian en «ftp.debian.org», debajo del directorio «debian», y usa sólo la sección «&stable-codename;/contrib».

source: Uses FTP to access the archive at ftp.debian.org, under the debian directory, and uses only the unstable/contrib area. If this line appears as well as the one in the previous example in <filename>sources.list</filename> a single FTP session will be used for both resource lines.
de: Benutzt FTP, um auf das Archiv auf ftp.debian.org unter dem debian-Verzeichnis zuzugreifen und nur den unstable/contrib-Bereich zu benutzen. Falls diese Zeile zusammen mit der aus dem vorherigen Beispiel in der Datei <filename>sources.list</filename> auftaucht, wird eine einzelne FTP-Sitzung für beide Quellzeilen benutzt.
es: Usa FTP para acceder al archivo de Debian en «ftp.debian.org», debajo del directorio «debian», y usa sólo la sección unstable/contrib. Si tanto esta línea como la del ejemplo anterior aparecen en <filename>sources.list</filename>, se usará sólo una sesión FTP para ambas.

source: Uses HTTP to access the archive at ftp.tlh.debian.org, under the universe directory, and uses only files found under <filename>unstable/binary-i386</filename> on i386 machines, <filename>unstable/binary-amd64</filename> on amd64, and so forth for other supported architectures. [Note this example only illustrates how to use the substitution variable; official debian archives are not structured like this] <placeholder type="literallayout" id="0"/>
de: Benutzt HTTP, um auf das Archiv auf ftp.tlh.debian.org unter dem universe-Verzeichnis zuzugreifen und benutzt nur Dateien, die unter <filename>unstable/binary-i386</filename> auf i386-Maschinen, <filename>unstable/binary-amd64</filename> auf amd64 und so weiter für andere unterstützte Architekturen, gefunden werden. [Beachten Sie, dass dieses Beispiel nur anschaulich macht, wie die Platzhaltervariable benutzt wird. Offizielle Debian-Archive sind nicht so strukturiert.] <placeholder type="literallayout" id="0"/>

source: APT User's Guide
de: APT-Benutzerhandbuch
es: Guía de usuario de APT

source: This document provides an overview of how to use the the APT package manager.
de: Dieses Dokument stellt eine Übersicht bereit, wie das APT-Paketverwaltungsprogramm benutzt wird.
es: Este documento ofrece una introducción sobre cómo usar el gestor de paquetes APT.

source: "APT" and this document are free software; you can redistribute them and/or modify them under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
de: »APT« und dieses Dokument sind freie Software. Sie können sie weitergeben und/oder verändern unter den Bedingungen der GNU General Public License, wie sie von der Free Software Foundation veröffentlicht wird; entweder Version 2 der Lizenz oder (optional) jeder späteren Version.
es: APT y este documento son software libre. Se garantiza permiso para copiar, distribuir y modificar este documento según los términos de la GNU General Public License publicada por la Free Software Foundation, ya sea en su versión 2 o (a su elección) cualquier versión posterior.

source: For more details, on Debian GNU/Linux systems, see the file /usr/share/common-licenses/GPL for the full license.
de: Siehe für weitere Details auf Debian-Systemen die Datei /usr/share/common-licenses/GPL, die die vollständige Lizenz enthält.
es: Para más detalles acerca de sistemas Debian GNU/Linux y la licencia completa, consulte el fichero «/usr/share/common-licenses/GPL».

source: General
de: Allgemein

source: The APT package currently contains two sections, the APT <prgn>dselect</prgn> method and the <prgn>apt-get</prgn> command line user interface. Both provide a way to install and remove packages as well as download new packages from the Internet.
de: Das Paket APT enthält derzeit zwei Abschnitte, die APT-<prgn>dselect</prgn>-Methode und die Anwenderschnittstelle <prgn>apt-get</prgn> für die Befehlszeile. Beide stellen eine Möglichkeit bereit, Pakete zu installieren, zu entfernen, sowie neue Pakete aus dem Internet herunterzuladen.
es: El paquete APT contiene a día de hoy dos secciones, el método <prgn>dselect</prgn> y la interfaz de usuario para la línea de órdenes <prgn>apt-get</prgn>. Ambos ofrecen una manera de instalar y desinstalar paquetes, así como descargar paquetes nuevos de Internet.

source: Anatomy of the Package System
de: Anatomie des Paketsystems
es: Anatomía del sistema de paquetes
