Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: Please give the components to get The components are typically something like: main contrib non-free Components [main contrib non-free]:
de: Bitte geben Sie die Komponenten an, die Sie erhalten möchten Die Komponenten sind normalerweise etwas wie: »main« »contrib« »non-free« Komponenten [main contrib non-free]:

source: The components list refers to the list of sub distributions to fetch. The distribution is split up based on software licenses, main being DFSG free packages while contrib and non-free contain things that have various restrictions placed on their use and distribution.
de: Die Komponentenliste bezieht sich auf die Liste von Unter-Distributionen zum Herunterladen. Die Distribution ist auf Basis von Software-Lizenzen unterteilt, »Main« besteht aus Paketen die gemäß der DFSG frei sind, während »Contrib« und »Non-free« Dinge enthalten, die verschiedene Einschränkungen in ihrer Benutzung und ihren Vertrieb haben.
es: La lista de componentes se refiere a la lista de sub-distribuciones a obtener. La distribución está dividida en base a licencias de software, siendo «main» paquetes libres de acuerdo con DFSG, mientras que «contrib» y «non-free» contienen paquetes con restricciones en cuanto a su uso y distribución.

source: Any number of sources can be added, the setup script will continue to prompt until you have specified all that you want.
de: Jegliche Anzahl von Quellen kann hinzugefügt werden, das Einrichtungsskript wird mit Nachfragen fortfahren, bis Sie alles angegeben haben, was Sie möchten.
es: Puede añadir cualquier número de fuentes, el script de configuración le preguntará por fuentes hasta que el usuario defina todo lo que quiera.

source: Before starting to use <prgn>dselect</prgn> it is necessary to update the available list by selecting [U]pdate from the menu. This is a superset of <tt>apt-get update</tt> that makes the fetched information available to <prgn>dselect</prgn>. [U]pdate must be performed even if <tt>apt-get update</tt> has been run before.
de: Bevor sie beginnen, <prgn>dselect</prgn> zu benutzen, ist es notwendig, die Verfügbarkeitsliste zu aktualisieren, indem sie aus dem Menü [E]rneuern auswählen. Dies ist eine Obermenge von <tt>apt-get update</tt>, das <prgn>dselect</prgn> heruntergeladene Informationen zur Verfügung stellt. [E]rneuern muss auch dann durchgeführt werden, wenn vorher <tt>apt-get update</tt> ausgeführt wurde.
es: Es necesario actualizar la lista disponible mediante el elemento de menú [A]ctualizar antes de iniciar <prgn>dselect</prgn>. Éste es un superconjunto de <tt>apt-get update</tt> que permite a <prgn>dselect</prgn> disponer de la información obtenida. Debe ejecutar [A]ctualizar aunque haya ejecutado <tt>apt-get update</tt> con anterioridad.

source: You can then go on and make your selections using [S]elect and then perform the installation using [I]nstall. When using the APT method the [C]onfig and [R]emove commands have no meaning, the [I]nstall command performs both of them together.
de: Sie können dann fortfahren und Ihre Auswahl per [A]uswähle treffen und dann die Installation mit [I]nstall. vornehmen. Wenn Sie die APT-Methode benutzen, haben die Befehle Kon[f]ig. und [L]öschen keine Bedeutung, der Befehl [I]nstall. führt beides gleichermaßen aus.
es: Hecho esto puede realizar sus selecciones usando [S]elect y ejecutar la instalación posteriormente con [I]nstall. Al usar el método APT las órdenes [C]onfig y [R]emove carecen de significado ya que la orden [I]nstall ejecuta ambos a la vez.

source: By default APT will automatically remove the package (.deb) files once they have been successfully installed. To change this behavior place <tt>Dselect::clean "prompt";</tt> in /etc/apt/apt.conf.
de: Standardmäßig wird APT automatisch die Paketdateien (.deb) entfernen, sobald sie erfolgreich installiert sind. Um dieses Verhalten zu ändern, platzieren Sie <tt>Dselect::clean "prompt";</tt> in /etc/apt/apt.conf.
es: Por omisión, APT eliminará automáticamente los ficheros de paquete («.deb») una vez que se hayan instalado con éxito. Para modificar este comportamiento, inserte <tt>Dselect::clean "prompt";</tt> en «/etc/apt/apt.conf».

source: The Interface
de: Die Schnittstelle
es: La interfaz

source: Both that APT <prgn>dselect</prgn> method and <prgn>apt-get</prgn> share the same interface. It is a simple system that generally tells you what it will do and then goes and does it. <footnote><p>The <prgn>dselect</prgn> method actually is a set of wrapper scripts to <prgn>apt-get</prgn>. The method actually provides more functionality than is present in <prgn>apt-get</prgn> alone.</p></footnote> After printing out a summary of what will happen APT then will print out some informative status messages so that you can estimate how far along it is and how much is left to do.
de: Sowohl die APT-Methode <prgn>dselect</prgn>, als auch <prgn>apt-get</prgn> teilen sich die gleiche Schnittstelle. Es ist ein einfaches System, das üblicherweise mitteilt, was es tun wird und es dann tut. <footnote><p>Die Methode <prgn>dselect</prgn> ist tatsächlich eine Zusammenstellung von Wrapper-Skripten für <prgn>apt-get</prgn>. Die Methode stellt tatsächlich mehr Funktionalitäten bereit, als in <prgn>apt-get</prgn> allein vorhanden sind.</p></footnote> Nach der Ausgabe einer Zusammenfassung was passieren wird, gibt APT einige informative Statusmeldungen aus, so dass Sie abschätzen können, wie weit es ist und wieviel noch zu tun ist.
es: El método <prgn>dselect</prgn> de APT y <prgn>apt-get</prgn> comparten la misma interfaz. Es un sencillo programa que le informa de lo que va a hacer, para después llevarlo a cabo. <footnote><p> El método <prgn>dselect</prgn> es en realidad un conjunto de scripts en torno a <prgn>apt-get</prgn>. En realidad, el método ofrece más funcionalidad que la presente en <prgn>apt-get</prgn> por si mismo. </p></footnote> Después de mostrar el resumen de lo que va a pasar APT mostrará mensajes de estado informativos para ofrecer una estimación de cuánto queda por hacer.

source: Startup
de: Anfang
es: Arranque

source: Before all operations except update, APT performs a number of actions to prepare its internal state. It also does some checks of the system's state. At any time these operations can be performed by running <tt>apt-get check</tt>.
de: Vor allen Operationen, ausgenommen »update«, führt APT eine Reihe von Aktionen durch, um seinen internen Status vorzubereiten. Es macht außerdem einige Prüfungen des Systemstatus. Diese Operationen können jederzeit durch Ausführung von <tt>apt-get check</tt> durchgeführt werden.
es: APT realiza un número de acciones para preparar su estado interno antes de cualquier operación, a excepción de «update». También realiza algunas revisiones del estado del sistema. Puede llevar a cabo estas acciones en cualquier momento ejecutando <tt>apt-get check</tt>.

source: # apt-get check Reading Package Lists... Done Building Dependency Tree... Done
de: # apt-get check Paketlisten werden gelesen … Fertig Abhängigkeitsbaum wird aufgebaut … Fertig
es: # apt-get check Leyendo lista de paquetes... Hecho Creando árbol de dependencias Leyendo la información de estado... Hecho

source: The first thing it does is read all the package files into memory. APT uses a caching scheme so this operation will be faster the second time it is run. If some of the package files are not found then they will be ignored and a warning will be printed when apt-get exits.
de: Das erste was es tut, ist das Einlesen aller Paketdateien in den Speicher. APT benutzt ein Zwischenspeicherschema, so dass diese Operation beim zweiten Ausführen schneller laufen wird. Falls einige der Paketdateien nicht gefunden werden, werden sie ignoriert und beim Beenden von Apt-get wird eine Warnung ausgegeben.
es: La primera acción que ejecuta es pasar todos los ficheros de paquete a la memoria. APT usa un esquema de almacenado con lo cual esta operación será más rápida la segunda vez que la ejecute. De no encontrar algún fichero de paquete, éstos se ignorarán y verá una advertencia al finalizar apt-get.

source: The final operation performs a detailed analysis of the system's dependencies. It checks every dependency of every installed or unpacked package and considers if it is OK. Should this find a problem then a report will be printed out and <prgn>apt-get</prgn> will refuse to run.
de: Die letzte Operation führt eine detaillierte Analyse der Abhängigkeiten des Systems durch. Sie prüft jede Abhängigkeit jedes installierten oder entpackten Pakets und berücksichtigt, ob es in Ordnung ist. Sollte sie ein Problem finden, dann wird eine Meldung ausgegeben und <prgn>apt-get</prgn> wird die Ausführung verweigern.
es: La última acción realiza un detallado análisis de las dependencias del sistema. Revisa cada dependencia de cada paquete instalado o sin desempaquetar analiza su validación. En caso de error aparecerá un informe, y <prgn>apt-get</prgn> se negará a ejecutarse.

source: # apt-get check Reading Package Lists... Done Building Dependency Tree... Done You might want to run apt-get -f install' to correct these. Sorry, but the following packages have unmet dependencies: 9fonts: Depends: xlib6g but it is not installed uucp: Depends: mailx but it is not installed blast: Depends: xlib6g (>= 3.3-5) but it is not installed adduser: Depends: perl-base but it is not installed aumix: Depends: libgpmg1 but it is not installed debiandoc-sgml: Depends: sgml-base but it is not installed bash-builtins: Depends: bash (>= 2.01) but 2.0-3 is installed cthugha: Depends: svgalibg1 but it is not installed Depends: xlib6g (>= 3.3-5) but it is not installed libreadlineg2: Conflicts:libreadline2 (<< 2.1-2.1)
de: # apt-get check Paketlisten werden gelesen … Fertig Fertig Abhängigkeitsbaum wird aufgebaut Status-Informationen einlesen … Fertig Fertig Probieren Sie „apt-get -f install“, um diese zu korrigieren: Die folgenden Pakete haben nichterfüllte Abhängigkeiten: 9fonts: Hängt ab: xlib6g ist aber nicht installiert uucp: Hängt ab: mailx ist aber nicht installiert blast: Hängt ab: xlib6g (>= 3.3-5) ist aber nicht installiert adduser: Hängt ab: perl-base ist aber nicht installiert aumix: Hängt ab: libgpmg1 ist aber nicht installiert debiandoc-sgml: Hängt ab: sgml-base ist aber nicht installiert bash-builtins: Hängt ab: bash (>= 2.01) but 2.0-3 ist installiert cthugha: Hängt ab: svgalibg1 ist aber nicht installiert Hängt ab: xlib6g (>= 3.3-5) ist aber nicht installiert libreadlineg2: Conflicts:libreadline2 (<< 2.1-2.1)
es: # apt-get check Leyendo lista de paquetes... Hecho Creando árbol de dependencias Leyendo la información de estado... Hecho Tal vez quiera ejecutar `apt-get -f install' para corregirlo. Los siguientes paquetes tienen dependencias incumplidas: 9fonts: Depende: xlib6g pero no está instalado uucp: Depende: mailx pero no está instalado blast: Depende: xlib6g (>= 3.3-5) pero no está instalado adduser: Depende: perl-base pero no está instalado aumix: Depende: libgpmg1 pero no está instalado debiandoc-sgml: Depende: sgml-base pero no está instalado bash-builtins: Depende: bash (>= 2.01) pero 2.0-3 está instalado cthugha: Depende: svgalibg1 pero no está instalado Depende: xlib6g (>= 3.3-5) pero no está instalado libreadlineg2: Entra en conflicto:libreadline2 (<< 2.1-2.1)

source: In this example the system has many problems, including a serious problem with libreadlineg2. For each package that has unmet dependencies a line is printed out indicating the package with the problem and the dependencies that are unmet. A short explanation of why the package has a dependency problem is also included.
de: In diesem Beispiel hat das System viele Probleme, einschließlich eines ernsten Problems mit libreadlineg2. Für jedes Paket, das nichterfüllte Abhängigkeiten hat, wird eine Zeile ausgegeben, die das Paket mit dem Problem anzeigt und die Abhängigkeiten, die nicht erfüllt sind. Eine kurze Erklärung, warum das Paket ein Abhängigkeitsproblem hat, ist inbegriffen.
es: En este ejemplo el sistema tiene varios problemas, incluyendo un serio problema con libreadlineg2. Una línea aparecerá por cada paquete con dependencias no satisfechas indicando el paquete con el problema y las dependencias no satisfechas. También incluye una explicación de porqué el paquete tiene un problema de dependencias.

source: There are two ways a system can get into a broken state like this. The first is caused by <prgn>dpkg</prgn> missing some subtle relationships between packages when performing upgrades. <footnote><p>APT however considers all known dependencies and attempts to prevent broken packages</p></footnote>. The second is if a package installation fails during an operation. In this situation a package may have been unpacked without its dependents being installed.
de: Es gibt zwei Möglichkeiten, wie ein System in einen kaputten Status wie diesen kommen kann. Die erste wird dadurch verursacht, dass <prgn>dpkg</prgn> einige feine Beziehungen zwischen Paketen übersieht, wenn Upgrades durchgeführt werden. <footnote><p>APT berücksichtigt jedoch alle bekannten Abhängigkeiten und versucht, kaputte Pakete zu vermeiden</p></footnote>. Die zweite tritt auf, falls eine Paketinstallation während der Ausführung fehlschlägt. In dieser Situation könnte ein Paket entpackt worden sein, ohne dass die von ihm Abhängigen installiert sind.
es: Hay dos formas de que el sistema tenga un estado roto como éste. El primero es causado por la omisión de <prgn>dpkg</prgn> de ciertas relaciones delicadas entre paquetes al realizar una actualización. <footnote><p>APT, de todas formas, considera todas las dependencias conocidas e intenta prevenir paquetes rotos</p></footnote>. El segundo ocurre se la instalación de un paquete falla durante la operación. En esta situación puede que un paquete se haya desempaquetado sin que sus dependencias estuviesen instaladas previamente.

source: The second situation is much less serious than the first because APT places certain constraints on the order that packages are installed. In both cases supplying the <tt>-f</tt> option to <prgn>apt-get</prgn> will cause APT to deduce a possible solution to the problem and then continue on. The APT <prgn>dselect</prgn> method always supplies the <tt>-f</tt> option to allow for easy continuation of failed maintainer scripts.
de: Die zweite Situation ist weit weniger ernst als die erste, weil APT bestimmte Beschränkungen in der Reihenfolge setzt, in der Pakete installiert werden. In beiden Fällen veranlasst die Option <tt>-f</tt> <prgn>apt-get</prgn>, eine mögliche Lösung für das Problem zu folgern und dann fortzufahren. Die APT-Methode <prgn>dselect</prgn> liefert immer die Option <tt>-f</tt>, zum einfachen Fortfahren von gescheiterten Betreuerskripten.
es: La segunda situación es mucho menos grave que la primera ya que APT define ciertos límites en el orden de instalación de los paquetes. En ambos casos, introducir la opción <tt>-f</tt> a <prgn>apt-get</prgn> causará que APT deduzca una posible solución al problema para después continuar. El método <prgn>dselect</prgn> de APT siempre ofrece la opción <tt>-f</tt> para permitir una fácil continuación cuando existen scripts fallidos del mantenedor.

source: However, if the <tt>-f</tt> option is used to correct a seriously broken system caused by the first case then it is possible that it will either fail immediately or the installation sequence will fail. In either case it is necessary to manually use dpkg (possibly with forcing options) to correct the situation enough to allow APT to proceed.
de: Falls jedoch die Option <tt>-f</tt> benutzt wird, um ein ernsthaft kaputtes System zu korrigieren, das vom ersten Fall verursacht wurde, dann ist es möglich, dass es entweder sofort fehlschlägt oder die Installationsabfolge fehlschlagen wird. In beiden Fällen ist es nötig, Dpkg (möglicherweise mit erzwingenden Optionen) manuell zu benutzen, um die Situation ausreichend zu korrigieren, so dass es APT ermöglicht wird, fortzufahren.
es: Aún así, de usar la opción <tt>-f</tt> para corregir un sistema gravemente roto por el primer caso cabe que la acción falle inmediatamente o que la secuencia de instalación se interrumpa. En cualquier caso es necesario usar dpkg manualmente (puede que con opciones de forzado) para corregir la situación lo suficiente como para que APT pueda continuar.

source: The Status Report
de: Der Statusbericht
es: El informe de estado

source: Before proceeding <prgn>apt-get</prgn> will present a report on what will happen. Generally the report reflects the type of operation being performed but there are several common elements. In all cases the lists reflect the final state of things, taking into account the <tt>-f</tt> option and any other relevant activities to the command being executed.
de: Bevor es fortfährt, wird <prgn>apt-get</prgn> einen Bericht darüber präsentieren, was geschehen wird. Im Allgemeinen spiegelt der Bericht den Typ der Operation, die ausgeführt wird, wider, aber es gibt auch mehrere geläufige Elemente. Auf jeden Fall spiegelt die Liste den Endstatus der Dinge wider, bezieht die Option <tt>-f</tt> in Betracht und alle andere relevante Aktivitäten zum Befehl, der ausgeführt wird.
es: Antes de proceder <prgn>apt-get</prgn> presentará un informe de lo que va a ocurrir. Generalmente el informe refleja el tipo de operación a realizar, pero hay ciertos elementos comunes. La lista refleja el estado final de las cosas en todos los casos, teniendo en cuenta la opción <tt>-f</tt> y cualquier otra actividad relevante a la orden ejecutada.

source: The Extra Package list
de: Die zusätzliche Paketliste
es: La lista de paquetes extras

source: The following extra packages will be installed: libdbd-mysql-perl xlib6 zlib1 xzx libreadline2 libdbd-msql-perl mailpgp xdpkg fileutils pinepgp zlib1g xlib6g perl-base bin86 libgdbm1 libgdbmg1 quake-lib gmp2 bcc xbuffy squake pgp-i python-base debmake ldso perl libreadlineg2 ssh
de: Die folgenden Pakete werden zusätzlich installiert: libdbd-mysql-perl xlib6 zlib1 xzx libreadline2 libdbd-msql-perl mailpgp xdpkg fileutils pinepgp zlib1g xlib6g perl-base bin86 libgdbm1 libgdbmg1 quake-lib gmp2 bcc xbuffy squake pgp-i python-base debmake ldso perl libreadlineg2 ssh
es: Se instalarán los siguientes paquetes extras: libdbd-mysql-perl xlib6 zlib1 xzx libreadline2 libdbd-msql-perl mailpgp xdpkg fileutils pinepgp zlib1g xlib6g perl-base bin86 libgdbm1 libgdbmg1 quake-lib gmp2 bcc xbuffy squake pgp-i python-base debmake ldso perl libreadlineg2 ssh

source: The Extra Package list shows all of the packages that will be installed or upgraded in excess of the ones mentioned on the command line. It is only generated for an <tt>install</tt> command. The listed packages are often the result of an Auto Install.
de: Die zusätzliche Paketliste zeigt alle Pakete, die installiert werden oder von denen ein Upgrade durchgeführt wird, zusätzlich zu den auf der Befehlszeile angegebenen. Sie wird nur für einen <tt>install</tt>-Befehl generiert. Die aufgelisteten Pakete sind häufig das Ergebnis einer automatischen Installation.
es: La lista de paquetes extras muestra todos los paquetes que se van a instalar o actualizar en adición a aquellos mencionados en la línea de órdenes. Sólo se genera para la orden <tt>install</tt>. Generalmente, los paquetes listados son el resultado de una instalación automática.

source: The Packages to Remove
de: Die zu entfernenden Pakete
es: Los paquetes a eliminar

source: The following packages will be REMOVED: xlib6-dev xpat2 tk40-dev xkeycaps xbattle xonix xdaliclock tk40 tk41 xforms0.86 ghostview xloadimage xcolorsel xadmin xboard perl-debug tkined xtetris libreadline2-dev perl-suid nas xpilot xfig
de: Die folgenden Pakete werden ENTFERNT: xlib6-dev xpat2 tk40-dev xkeycaps xbattle xonix xdaliclock tk40 tk41 xforms0.86 ghostview xloadimage xcolorsel xadmin xboard perl-debug tkined xtetris libreadline2-dev perl-suid nas xpilot xfig
es: Los siguientes paquetes se ELIMINARÁN: xlib6-dev xpat2 tk40-dev xkeycaps xbattle xonix xdaliclock tk40 tk41 xforms0.86 ghostview xloadimage xcolorsel xadmin xboard perl-debug tkined xtetris libreadline2-dev perl-suid nas xpilot xfig

source: The Packages to Remove list shows all of the packages that will be removed from the system. It can be shown for any of the operations and should be given a careful inspection to ensure nothing important is to be taken off. The <tt>-f</tt> option is especially good at generating packages to remove so extreme care should be used in that case. The list may contain packages that are going to be removed because they are only partially installed, possibly due to an aborted installation.
de: Die Liste der zu entfernenden Pakete zeigt all die Pakete, die vom System entfernt werden. Sie kann für jede der Operationen angezeigt werden und sollte einer sorgfältige Überprüfung unterzogen werden, um sicherzustellen, dass nichts Wichtiges weggenommen wird. Die Option <tt>-f</tt> ist insbesondere gut darin, Pakete zum Entfernen vorzumerken, so dass in diesem Fall mit extremer Vorsicht vorgegangen werden sollte. Die Liste könnte Pakete enthalten, die entfernt werden, weil sie nur teilweise installiert sind, möglicherweise aufgrund einer abgebrochenen Installation.
es: La lista de paquetes a eliminar muestra todos los paquetes que se van a eliminar del sistema. Puede aparecer durante cualquier operación, y se debería revisar cuidadosamente para asegurar que no se va a eliminar nada importante, y de ser así el caso se debería actuar cuidadosamente. La lista puede contener paquetes a eliminar porque están parcialmente instalados, posiblemente debido a una instalación interrumpida.

source: The New Packages list
de: Die Liste neuer Pakete
es: La lista de paquetes nuevos

source: The following NEW packages will installed: zlib1g xlib6g perl-base libgdbmg1 quake-lib gmp2 pgp-i python-base
de: Die folgenden NEUEN Pakete werden zusätzlich installiert: zlib1g xlib6g perl-base libgdbmg1 quake-lib gmp2 pgp-i python-base
es: Se instalarán los siguientes paquetes NUEVOS: zlib1g xlib6g perl-base libgdbmg1 quake-lib gmp2 pgp-i python-base

source: The New Packages list is simply a reminder of what will happen. The packages listed are not presently installed in the system but will be when APT is done.
de: Die Liste neuer Pakete ist einfache eine Erinnerung, was geschehen wird. Die aufgelisteten Pakete sind zurzeit nicht auf dem System installiert, werden es aber sein, wenn APT fertig ist.
es: La lista de paquetes nuevos es sólo un recordatorio de lo que va a ocurrir. Los paquetes listados no se encuentran instalados en el sistema pero lo estarán cuando APT finalice.

source: The Kept Back list
de: Die Liste zurückgehaltener Pakete
es: La lista de paquetes retenidos

source: The following packages have been kept back compface man-db tetex-base msql libpaper svgalib1 gs snmp arena lynx xpat2 groff xscreensaver
de: Die folgenden Pakete werden zurückgehalten: compface man-db tetex-base msql libpaper svgalib1 gs snmp arena lynx xpat2 groff xscreensaver
es: Los siguientes paquetes se han retenido: compface man-db tetex-base msql libpaper svgalib1 gs snmp arena lynx xpat2 groff xscreensaver
