Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: APT uses since version 0.7.26 a resizable memory mapped cache file to store the 'available' information. <literal>Cache-Start</literal> acts as a hint to which size the Cache will grow and is therefore the amount of memory APT will request at startup. The default value is 20971520 bytes (~20 MB). Note that these amount of space need to be available for APT otherwise it will likely fail ungracefully, so for memory restricted devices these value should be lowered while on systems with a lot of configured sources this might be increased. <literal>Cache-Grow</literal> defines in byte with the default of 1048576 (~1 MB) how much the Cache size will be increased in the event the space defined by <literal>Cache-Start</literal> is not enough. These value will be applied again and again until either the cache is big enough to store all information or the size of the cache reaches the <literal>Cache-Limit</literal>. The default of <literal>Cache-Limit</literal> is 0 which stands for no limit. If <literal>Cache-Grow</literal> is set to 0 the automatic grow of the cache is disabled.
de: APT benutzt seit Version 0.7.26 eine Zwischenspeicherdatei für Speicherabbilder mit veränderlicher Größe um »verfügbare« Informationen zu speichern. <literal>Cache-Start</literal> dient als Hinweis, auf welche Größe der Zwischenspeicher wachsen wird und enthält daher den Betrag, welchen Speicher APT beim Start abruft. Die Vorgabe ist 20971520 Byte (~20 MB). Beachten Sie, dass diese Speichermenge für APT verfügbar sein muss, da es sonst unschön scheitert. Für Geräte mit eingeschränktem Speicher sollten diese Werte vermindert werden, während sie für Systeme mit vielen konfigurierten Quellen erhöht werden könnten. <literal>Cache-Grow</literal> definiert in Byte mit einer Vorgabe von 1048576 (~1 MB) um wieviel die Größe des Zwischenspeichers vergößert werden soll, falls der durch <literal>Cache-Start</literal> vorreservierte nicht ausreicht. Dieser Wert wird wieder und wieder verwandt bis entweder der Zwischenspeicher groß genug ist, um alle Informationen zu speichern oder die Zwischenspeichergröße das <literal>Cache-Limit</literal> erreicht. Vorgabe für <literal>Cache-Limit</literal> ist 0, was bedeutet, dass es kein Limit gibt. Falls <literal>Cache-Grow</literal> auf 0 gesetzt ist, kann der Zwischenspeicher nicht automatisch wachsen.
es: A partir de la versión 0.7.26, APT usa un fichero de caché mapeado («mapped cache file») redimensionable para almacenar la información disponible. <literal>Cache-Start</literal> actúa como una indicación del tamaño que el caché alcanzará y por ello es la cantidad de memoria que APT solicitará al iniciarse. El valor predeterminado es 20971520 bytes (~20 MB). Tenga en cuenta que esta cantidad de espacio debe estar disponible para APT, o fallará. Por ello, este valor se debería disminuir para los dispositivos con memoria restringida, mientras que se debería aumentar en sistemas con varias fuentes configuradas. <literal>Cache-Grow</literal> define en bytes, con el valor predeterminado de 1048576 (~1 MB) cuánto se aumentará el caché en el caso de que el espacio definido por <literal>Cache-Start</literal> no sea suficiente. Este valor se aplicará repetidamente hasta que el caché sea suficientemente grande para almacenar toda la información o si el caché alcanza <literal>Cache-Limit</literal>. El valor predeterminado de <literal>Cache-Limit</literal> es cero, esto es, ilimitado. Si define <literal>Cache-Grow</literal> con un valor de cero se desactivará el crecimiento automático del cache.

source: Defines which package(s) are considered essential build dependencies.
de: Definiert, welche(s) Paket(e) als essentielle Bauabhängigkeiten betrachtet werde.
es: Define qué paquete(s) se consideran dependencias de creación esenciales.

source: The Get subsection controls the &apt-get; tool, please see its documentation for more information about the options here.
de: Der Get-Unterabschnitt steuert das &apt-get;-Werkzeug. Lesen Sie bitte dessen Dokumentation, um weitere Informationen über die Optionen hier zu erhalten.
es: La subsección Get controla la herramienta &apt-get;, por favor, consulte la documentación para más información sobre esta opción.

source: The Cache subsection controls the &apt-cache; tool, please see its documentation for more information about the options here.
de: Der Cache-Unterabschnitt steuert das &apt-cache;-Werkzeug. Lesen Sie bitte dessen Dokumentation, um weitere Informationen über die Optionen hier zu erhalten.
es: La subsección Cache controla la herramienta &apt-cache;, por favor, consulte la documentación para más información sobre esta opción.

source: The CDROM subsection controls the &apt-cdrom; tool, please see its documentation for more information about the options here.
de: Der CD-ROM-Unterabschnitt steuert das &apt-cdrom;-Werkzeug. Lesen Sie bitte dessen Dokumentation, um weitere Informationen über die Optionen hier zu erhalten.
es: La subsección CDROM controla la herramienta &apt-cdrom;, por favor, consulte la documentación para más información sobre esta opción.

source: The Acquire Group
de: Die Erwerbgruppe
es: El grupo Acquire

source: Security related option defaulting to true as an expiring validation for a Release file prevents longtime replay attacks and can e.g. also help users to identify no longer updated mirrors - but the feature depends on the correctness of the time on the user system. Archive maintainers are encouraged to create Release files with the <literal>Valid-Until</literal> header, but if they don't or a stricter value is volitional the following <literal>Max-ValidTime</literal> option can be used.
de: Sicherheitsbezogene Option wird als »true« vorgegeben, da eine verfallende Überprüfung für eine Release-Datei langzeitige Wiederholungsangriffe verhindert und zum Beispiel Anwendern auch helfen kann, länger nicht aktualisierte Spiegel zu erkennen – diese Funktion hängt jedoch von der Richtigkeit der Zeiteinstellung auf dem Anwendersystem ab. Archivbetreuer sind aufgefordert Release-Dateien mit der Kopfzeile <literal>Valid-Until</literal> zu erstellen. Falls sie das nicht tun oder ein strengerer Wert gewollt ist, kann die Option <literal>Max-ValidTime</literal> benutzt werden.
es: Opción relacionada con la seguridad, cuyo valor predeterminado de «true», ya que una validación temporal para un fichero «Release» evita ataques «longtime replay» y puede, por ejemplo, ayudar a identificar las réplicas no actualizadas, aunque esta función depende de la corrección de la hora del sistema del usuario. Se recomienda a los responsables de archivos que creen ficheros «Release» con la cabecera <literal>Valid-Until</literal>, pero si se hace, o si un valor más estricto es opcional, se puede usar la opción <literal>Max-ValidTime</literal>.

source: Try to download deltas called <literal>PDiffs</literal> for Packages or Sources files instead of downloading whole ones. True by default.
de: Versuchen, Deltas, die <literal>PDiffs</literal> genannt werden, für Paket- oder Quelldateien herunterzuladen, statt der kompletten Dateien. Vorgabe ist True.
es: Intenta descargar deltas llamados <literal>PDiffs</literal> de los ficheros «Packages» o «Sources» en lugar de descargarlos enteros. Es «true» de forma predeterminada

source: Queuing mode; <literal>Queue-Mode</literal> can be one of <literal>host</literal> or <literal>access</literal> which determines how APT parallelizes outgoing connections. <literal>host</literal> means that one connection per target host will be opened, <literal>access</literal> means that one connection per URI type will be opened.
de: Warteschlangenmodus; <literal>Queue-Mode</literal> kann entweder <literal>host</literal> oder <literal>access</literal> sein, wodurch festgelegt wird, wie APT ausgehende Verbindungen parallelisiert. <literal>host</literal> bedeutet, dass eine Verbindung pro Zielrechner geöffnet wird, <literal>access</literal> bedeutet, dass eine Verbindung pro URI-Art geöffnet wird.
es: Modo de cola, <literal>Queue-Mode</literal> puede ser <literal>host</literal> o <literal>access</literal>, que determina cómo paralelizará APT las conexiones salientes. <literal>host</literal> significa que se abrirá una conexión por máquina de destino, <literal>access</literal> significa que se abrirá una conexión por cada tipo de URI.

source: Number of retries to perform. If this is non-zero APT will retry failed files the given number of times.
de: Anzahl der auszuführenden erneuten Versuche. Wenn dies nicht Null ist, wird APT fehlgeschlagene Dateien in der angegebenen Zahl erneut versuchen.
es: El número de reintentos a realizar. Si es distinto de cero APT volverá a intentar obtener los ficheros fallidos el número de veces proporcionado.

source: Use symlinks for source archives. If set to true then source archives will be symlinked when possible instead of copying. True is the default.
de: Symbolische Verweise für Quellarchive benutzen. Wenn dies auf true gesetzt ist, werden Quellarchive, wenn möglich, symbolisch verknüpft, anstatt kopiert zu werden. True ist die Vorgabe.
es: Usa enlaces simbólicos para los archivos fuente. Si es «true» los archivos fuente se enlazarán cuando sea posible, en vez de copiarse. Es «true» de forma predeterminada.

source: HTTP URIs; http::Proxy is the default http proxy to use. It is in the standard form of <literal>http://[[user][:pass]@]host[:port]/</literal>. Per host proxies can also be specified by using the form <literal>http::Proxy::&lt;host&gt;</literal> with the special keyword <literal>DIRECT</literal> meaning to use no proxies. If no one of the above settings is specified, <envar>http_proxy</envar> environment variable will be used.
de: HTTP-URIs; http::Proxy ist der zu benutzende Standard-HTTP-Proxy. Er wird standardmäßig in der Form <literal>http://[[Anwender][:Passwort]@]Host[:Port]/</literal> angegeben. Durch Host-Proxies kann außerdem in der Form <literal>http::Proxy::&lt;host&gt;</literal> mit dem speziellen Schlüsselwort <literal>DIRECT</literal> angegeben werden, dass keine Proxies benutzt werden. Falls keine der obigen Einstellungen angegeben wurde, wird die Umgebungsvariable <envar>http_proxy</envar> benutzt.
es: HTTP URI, http::Proxy es el proxy http predeterminado a usar. Usa el formato estándar <literal>http://[[usuario][:contraseña]@]máquina[:puerto]/</literal>. También se puede especificar un proxy por cada máquina usando la forma <literal>http::Proxy::&lt;máquina&gt;</literal> con la palabra especial <literal>DIRECT</literal> que significa que no se use ningún proxy. La variable de entorno <envar>http_proxy</envar> se usará en caso de no definir ninguna de las opciones anteriores.

source: Three settings are provided for cache control with HTTP/1.1 compliant proxy caches. <literal>No-Cache</literal> tells the proxy to not use its cached response under any circumstances, <literal>Max-Age</literal> is sent only for index files and tells the cache to refresh its object if it is older than the given number of seconds. Debian updates its index files daily so the default is 1 day. <literal>No-Store</literal> specifies that the cache should never store this request, it is only set for archive files. This may be useful to prevent polluting a proxy cache with very large .deb files. Note: Squid 2.0.2 does not support any of these options.
de: Für die Steuerung des Zwischenspeichers mit HTTP/1.1-konformen Proxy-Zwischenspeichern stehen drei Einstellungen zur Verfügung. <literal>No-Cache</literal> teilt dem Proxy mit, dass er unter keinen Umständen seine zwischengespeicherten Antworten benutzen soll, <literal>Max-Age</literal> wird nur für Indexdateien gesendet und sagt dem Zwischenspeicher, dass er seine Objekte erneuern soll, die älter als die angegebene Zahl in Sekunden sind. Debian aktualisiert seine Indexdateien täglich, so dass die Vorgabe ein Tag ist. <literal>No-Store</literal> gibt an, dass der Zwischenspeicher diese Anfragen niemals speichern soll, es ist nur für Archivdateien gesetzt. Dies könnte nützlich sein, um Verunreinigungen des Proxy-Zwischenspeichers mit sehr großen .deb-Dateien zu verhindern. Beachten Sie: Squid 2.0.2 unterstützt keine dieser Optionen.
es: Para los proxies que cumplen con HTTP/1.1 se proporcionan tres opciones de configuración para el control de la caché. <literal>No-Cache</literal> dice al proxy que no use sus respuestas almacenadas bajo ninguna circunstancia, <literal>Max-Age</literal> sólo se envía para los ficheros de índice y le pide a la caché que actualice sus objetos si son más antiguos que un determinado número de segundos. Debian actualiza sus ficheros de índices diariamente, por lo que el valor predeterminado es un día. <literal>No-Store</literal> especifica que la caché nunca deberá almacenar la petición, sólo está habilitada para los ficheros de los archivos de paquetes. Puede ser útil para prevenir que un proxy se contamine con ficheros «.deb» muy grandes. Aviso: Squid 2.0.2 no permite usar ninguna de estas opciones.

source: The option <literal>timeout</literal> sets the timeout timer used by the method, this applies to all things including connection timeout and data timeout.
de: Die Option <literal>timeout</literal> stellt den Zeitnehmer für die Zeitüberschreitung ein, die von der Methode benutzt wird. Dies wird auf alle Dinge, einschließlich Verbindungs- und Datenzeitüberschreitungen, angewandt.
es: La opción <literal>timeout</literal> define el tiempo máximo de espera usado por el método, esto se aplica a todo, incluyendo el tiempo de espera para realizar la conexión y para recibir datos.

source: One setting is provided to control the pipeline depth in cases where the remote server is not RFC conforming or buggy (such as Squid 2.0.2). <literal>Acquire::http::Pipeline-Depth</literal> can be a value from 0 to 5 indicating how many outstanding requests APT should send. A value of zero MUST be specified if the remote host does not properly linger on TCP connections - otherwise data corruption will occur. Hosts which require this are in violation of RFC 2068.
de: Eine Einstellung wird bereitgestellt, um die Tiefe der Warteschlange in Fällen zu steuern, in denen der andere Server nicht RFC-konform oder fehlerhaft (so wie Squid 2.0.2) ist. <literal>Acquire::http::Pipeline-Depth</literal> kann ein Wert von 0 bis 5 sein, der anzeigt, wie viele ausstehende Anfragen APT senden soll. Ein Wert von Null MUSS angegeben werden, falls der andere Server nicht ordnungsgemäß auf TCP-Verbindungen wartet – anderenfalls werden fehlerhafte Daten erscheinen. Rechner, die dies erfordern, verstoßen gegen RFC 2068.
es: Se ofrece una opción para controlar la profundidad de la tubería en casos en que el servidor remoto no cumpla con la RFC o tenga fallos (como pasa con Squid 2.0.2). <literal>Acquire::http::Pipeline-Depth</literal> puede ser un valor entre 0 y 5, e indica cuántas peticiones sin resolver puede enviar APT. DEBE especificar si la máquina remota no retrasa apropiadamente las conexiones TCP, de otro modo los datos se corromperán. Las máquinas que necesitan esto violan la RFC 2068.

source: The used bandwidth can be limited with <literal>Acquire::http::Dl-Limit</literal> which accepts integer values in kilobyte. The default value is 0 which deactivates the limit and tries uses as much as possible of the bandwidth (Note that this option implicit deactivates the download from multiple servers at the same time.)
de: Die benutzte Bandbreite kann durch <literal>Acquire::http::Dl-Limit</literal> eingeschränkt werden, was Ganzzahlwerte in Kilobyte akzeptiert. Der Vorgabewert ist 0, was die Beschränkung ausschaltet und versucht, soviel wie möglich von der Bandbreite zu benutzen. (Beachten Sie, dass diese Optionen implizit das Herunterladen von mehreren Servern zur gleichen Zeit deaktiviert.)
es: El ancho de banda usado se puede limitar mediante <literal>Acquire::http::Dl-Limit</literal>, que acepta valores enteros en kilobytes. El valor predeterminado es cero, que desactiva el límite e intenta usar lo máximo posible del ancho de banda. (Tenga en cuenta que esta opción desactiva implícitamente la descarga simultánea desde varios servidores).

source: <literal>Acquire::http::User-Agent</literal> can be used to set a different User-Agent for the http download method as some proxies allow access for clients only if the client uses a known identifier.
de: <literal>Acquire::http::User-Agent</literal> kann benutzt werden, um einen unterschiedlichen User-Agent für die HTTP-Download-Methode zu setzten, da einige Proxys den Clients nur dann Zugriff gewähren, wenn der Client einen bekannten Bezeichner verwendet.
es: <literal>Acquire::http::User-Agent</literal> se puede usar para definir un «User-Agent» distinto para la descarga http ya que algunos proxys sólo permiten el acceso para clientes que usan un identificador conocido.

source: HTTPS URIs. Cache-control, Timeout, AllowRedirect, Dl-Limit and proxy options are the same as for <literal>http</literal> method and will also default to the options from the <literal>http</literal> method if they are not explicitly set for https. <literal>Pipeline-Depth</literal> option is not supported yet.
de: HTTPS-URIs. Zwischenspeichersteuerung-, Zeitüberschreitung-, AllowRedirect-, Dl-Limit- und Proxy-Optionen entsprechen denen der <literal>http</literal>-Methode und werden auch für die Optionen der Methode <literal>http</literal> vorgegeben, falls sie nicht explizit für HTTPS gesetzt sind. Die Option <literal>Pipeline-Depth</literal> wird noch nicht unterstützt.
es: HTTPS URI. Las opciones de control de «Cache», «timeout», «AllowRedirect», «Dl-Limit» y del proxy son las mismas que para el método <literal>http</literal> y de forma predeterminada tienen el valor de las opciones de <literal>http</literal> si no están explícitamente definidas para https. La opción <literal>Pipeline-Depth</literal> no se puede usar por ahora.

source: <literal>CaInfo</literal> suboption specifies place of file that holds info about trusted certificates. <literal>&lt;host&gt;::CaInfo</literal> is corresponding per-host option. <literal>Verify-Peer</literal> boolean suboption determines whether verify server's host certificate against trusted certificates or not. <literal>&lt;host&gt;::Verify-Peer</literal> is corresponding per-host option. <literal>Verify-Host</literal> boolean suboption determines whether verify server's hostname or not. <literal>&lt;host&gt;::Verify-Host</literal> is corresponding per-host option. <literal>SslCert</literal> determines what certificate to use for client authentication. <literal>&lt;host&gt;::SslCert</literal> is corresponding per-host option. <literal>SslKey</literal> determines what private key to use for client authentication. <literal>&lt;host&gt;::SslKey</literal> is corresponding per-host option. <literal>SslForceVersion</literal> overrides default SSL version to use. Can contain 'TLSv1' or 'SSLv3' string. <literal>&lt;host&gt;::SslForceVersion</literal> is corresponding per-host option.
de: Die Unteroption <literal>CaInfo</literal> gibt den Ort an, an dem Informationen über vertrauenswürdige Zertifikate bereitgehalten werden. <literal>&lt;host&gt;::CaInfo</literal> ist die entsprechende per-Host-Option. Die boolsche Unteroption <literal>Verify-Peer</literal> entscheidet, ob das Host-Zertifikat des Servers mit den vertrauenswürdigen Zertifikaten geprüft wird oder nicht. <literal>&lt;host&gt;::Verify-Peer</literal> ist die entsprechende per-Host-Option. Die boolsche Unteroption <literal>Verify-Host</literal> entscheidet, ob der Host-Name des Servers geprüft wird oder nicht. <literal>&lt;host&gt;::Verify-Host</literal> ist die entsprechende per-Host-Option. <literal>SslCert</literal> entscheidet, welches Zertifikat zur Client-Authentifizierung benutzt wird. <literal>&lt;host&gt;::SslCert</literal> ist die entsprechende per-Host-Option. <literal>SslKey</literal> entscheidet, welche privaten Schlüssel für die Client-Authentifizierung benutzt werden. <literal>&lt;host&gt;::SslKey</literal> ist die entsprechende per-Host-Option. <literal>SslForceVersion</literal> überschreibt die zu benutzende Standard-SSL-Version. Es kann die Zeichenketten »TLSv1« oder »SSLv3« enthalten. <literal>&lt;host&gt;::SslForceVersion</literal> ist die entsprechende per-Host-Option.
es: La sub-opción <literal>CaInfo</literal> define el lugar del fichero que contiene la información sobre los certificados de confianza. <literal>&lt;host&gt;::CaInfo</literal> corresponde a la opción por máquina. La sub-opción booleana <literal>Verify-Peer</literal> define si se comprobará el certificado del servidor con los certificados de confianza. <literal>&lt;host&gt;::Verify-Peer</literal> corresponde a la opción por máquina. La sub-opción <literal>Verify-Host</literal> define si se comprobará el nombre del servidor. <literal>&lt;host&gt;::Verify-Host</literal> corresponde a la opción por máquina. <literal>SslCert</literal> define qué certificado usar para la autenticación del cliente. <literal>&lt;host&gt;::SslCert</literal> corresponde a la opción por máquina. <literal>SslKey</literal> define qué clave privada usar para la autenticación del cliente. <literal>&lt;host&gt;::SslKey</literal> corresponde a la opción por máquina. <literal>SslForceVersion</literal> cambia la versión de SSL a usar. Puede ser «TLSv1» o «SSLv3». <literal>&lt;host&gt;::SslForceVersion</literal> corresponde a la opción por máquina.
