Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: <literal>upgrade</literal> is used to install the newest versions of all packages currently installed on the system from the sources enumerated in <filename>/etc/apt/sources.list</filename>. Packages currently installed with new versions available are retrieved and upgraded; under no circumstances are currently installed packages removed, or packages not already installed retrieved and installed. New versions of currently installed packages that cannot be upgraded without changing the install status of another package will be left at their current version. An <literal>update</literal> must be performed first so that <command>apt-get</command> knows that new versions of packages are available.
de: <literal>upgrade</literal> wird benutzt, um die neusten Versionen aller aktuell auf dem System installierten Pakete aus den in <filename>/etc/apt/sources.list</filename> aufgezählten Quellen zu installieren. Aktuell installierte Pakete mit verfügbaren neuen Versionen werden heruntergeladen und das Upgrade durchgeführt. Unter keinen Umständen werden derzeit installierte Pakete entfernt oder nicht installierte Pakete heruntergeladen und installiert. Neue Versionen von aktuell installierten Paketen von denen kein Upgrade durchgeführt werden kann, ohne den Installationsstatus eines anderen Paketes zu ändern, werden in ihrer aktuellen Version bleiben. Zuerst muss ein <literal>update</literal> durchgeführt werden, so dass <command>apt-get</command> die neuen Versionen der verfügbaren Pakete kennt.
es: <literal>upgrade</literal> se usa para instalar la versión más nueva de todos los paquetes instalados en el sistema provenientes de alguna de las fuentes listadas en <filename>/etc/apt/sources.list</filename>. Los paquetes instalados con una nueva versión disponible se descargan y actualizan, y bajo ninguna circunstancia se desinstalarán paquetes, o se instalarán paquetes nuevos. Las nuevas versiones de programas instalados que no se puedan actualizar sin cambiar el estado de instalación de otros paquetes no se instalarán, manteniéndose la versión actual. Debe realizar un <literal>update</literal> antes para que <command>apt-get</command> sepa que hay nuevas versiones disponibles.

source: <literal>dselect-upgrade</literal> is used in conjunction with the traditional Debian packaging front-end, &dselect;. <literal>dselect-upgrade</literal> follows the changes made by &dselect; to the <literal>Status</literal> field of available packages, and performs the actions necessary to realize that state (for instance, the removal of old and the installation of new packages).
de: <literal>dselect-upgrade</literal> wird zusammen mit der traditionellen Debian-Oberfläche &dselect; benutzt. <literal>dselect-upgrade</literal> folgt den durch &dselect; am <literal>Status</literal>-Feld verfügbarer Pakete gemachten Änderungen und führt die notwendigen Aktionen durch, um diesen Status zu realisieren (zum Beispiel das Entfernen von alten und Installieren von neuen Paketen).
es: <literal>dselect-upgrade</literal> se usa junto al tradicional administrador de paquetes de Debian, &dselect;. <literal>dselect-upgrade</literal> registra los cambios que haya hecho &dselect; al campo <literal>Status</literal> (estado) de los paquetes disponibles y realiza las acciones necesarias para que los cambios se lleven a cabo (por ejemplo, borrar paquetes antiguos e instalar las nuevas versiones).

source: <literal>dist-upgrade</literal> in addition to performing the function of <literal>upgrade</literal>, also intelligently handles changing dependencies with new versions of packages; <command>apt-get</command> has a "smart" conflict resolution system, and it will attempt to upgrade the most important packages at the expense of less important ones if necessary. So, <literal>dist-upgrade</literal> command may remove some packages. The <filename>/etc/apt/sources.list</filename> file contains a list of locations from which to retrieve desired package files. See also &apt-preferences; for a mechanism for overriding the general settings for individual packages.
de: <literal>dist-upgrade</literal> führt zusätzlich zu der Funktion von <literal>upgrade</literal> intelligente Handhabung von Abhängigkeitsänderungen mit neuen Versionen von Paketen durch. <command>apt-get</command> hat ein »intelligentes« Konfliktauflösungssystem und es wird versuchen, Upgrades der wichtigsten Pakete, wenn nötig zu Lasten der weniger wichtigen, zu machen. So könnte der <literal>dist-upgrade</literal>-Befehl einige Pakete entfernen. Die <filename>/etc/apt/sources.list</filename>-Datei enthält eine Liste mit Orten, von denen gewünschte Paketdateien abgerufen werden. Siehe auch &apt-preferences; für einen Mechanismus zum überschreiben der allgemeinen Einstellungen für einzelne Pakete.
es: <literal>dist-upgrade</literal>, además de realizar las acciones de <literal>upgrade</literal>, trata inteligentemente los cambios de dependencias debidos a las nuevas versiones de paquetes. <command>apt-get</command> tiene un sistema «inteligente» de resolución de conflictos, y si es necesario tratará de actualizar los paquetes más importantes a costa de los menos importantes. El fichero <filename>/etc/apt/sources.list</filename> contiene la lista de sitios desde los que descargar los ficheros de paquetes. También puede consultar &apt-preferences; si quiere invalidar este comportamiento para paquetes individuales.

source: <literal>install</literal> is followed by one or more packages desired for installation or upgrading. Each package is a package name, not a fully qualified filename (for instance, in a Debian GNU/Linux system, libc6 would be the argument provided, not <literal>libc6_1.9.6-2.deb</literal>). All packages required by the package(s) specified for installation will also be retrieved and installed. The <filename>/etc/apt/sources.list</filename> file is used to locate the desired packages. If a hyphen is appended to the package name (with no intervening space), the identified package will be removed if it is installed. Similarly a plus sign can be used to designate a package to install. These latter features may be used to override decisions made by apt-get's conflict resolution system.
de: <literal>install</literal> wird gefolgt von einem oder mehreren gewünschten Paketen zur Installation oder zum Upgrade. Jedes Paket ist ein Paketname, kein vollständig zusammengesetzter Dateiname (zum Beispiel wäre in einem »Debian GNU/Linux«-System libc6 das bereitgestellte Argument, nicht <literal>libc6_1.9.6-2.deb</literal>). Alle von den zur Installation angegebenen Paketen benötigten Pakete werden zusätzlich heruntergeladen und installiert. Die <filename>/etc/apt/sources.list</filename>-Datei wird benutzt, um die gewünschten Pakete zu finden. Wenn ein Bindestrich an den Paketnamen (ohne Leerzeichen dazwischen) angehängt ist, wird das erkannte Pakete entfernt, falls es installiert ist. Ähnlich kann ein Pluszeichen benutzt werden, um ein Paket zum Installieren vorzumerken. Diese letzteren Funktionen können benutzt werden, um Entscheidungen zu überschreiben, die vom Konfliktauflösungssystem von apt-get getroffen wurden.
es: <literal>install</literal> instala o actualiza los paquetes que siguen a la palabra «install». Cada paquete es un nombre de paquete, y no el nombre completo del fichero del paquete (por ejemplo, en un sistema Debian GNU/Linux, el argumento sería libc6, no <literal>libc6_1.9.6-2.deb</literal>). Se obtendrán e instalarán todos los paquetes necesarios por los paquetes especificados para la instalación. El fichero <filename>/etc/apt/sources.list</filename> se usa para ubicar los paquetes. Si antepone un guión al nombre del paquete (sin ningún espacio) el paquete se desinstalará en vez de instalar. De forma similar, el signo de suma se puede usar para especificar que un paquete se debe instalar. Estas últimas características se pueden usar para invalidar las decisiones tomadas por el sistema de resolución de conflictos de apt-get.

source: A specific version of a package can be selected for installation by following the package name with an equals and the version of the package to select. This will cause that version to be located and selected for install. Alternatively a specific distribution can be selected by following the package name with a slash and the version of the distribution or the Archive name (stable, testing, unstable).
de: Eine bestimmte Version eines Paketes kann durch den Paketnamen gefolgt von einem Gleichheitszeichen und der Version des Paketes zur Installation ausgewählt werden. Dies bewirkt, dass diese Version gesucht und zum Installieren ausgewählt wird. Alternativ kann eine bestimmte Distribution durch den Paketnamen gefolgt von einem Schrägstrich und der Version der Distribution oder des Archivnamens (»stable«, »testing«, »unstable«) ausgewählt werden.
es: Puede seleccionar una versión especifica de un paquete poniendo a continuación del nombre del paquete un símbolo igual («=») seguido de la versión deseada. Esto provocará que se localice y seleccione esa versión para su instalación. Alternativamente se puede seleccionar una distribución específica poniendo a continuación del nombre del paquete una barra («/») seguida de la versión de la distribución o su nombre en el archivo de Debian (stable, testing, unstable).

source: Both of the version selection mechanisms can downgrade packages and must be used with care.
de: Beide Mechanismen der Versionsauswahl können ein Downgrade von Paketen durchführen und müssen mit Vorsicht gehandhabt werden.
es: Cualquiera de estos dos métodos de selección puede instalar una versión anterior de los paquetes y se debe usar con cuidado.

source: This is also the target to use if you want to upgrade one or more already-installed packages without upgrading every package you have on your system. Unlike the "upgrade" target, which installs the newest version of all currently installed packages, "install" will install the newest version of only the package(s) specified. Simply provide the name of the package(s) you wish to upgrade, and if a newer version is available, it (and its dependencies, as described above) will be downloaded and installed.
de: Dies ist außerdem die bevorzugt zu benutzende Art, wenn Sie Sie ein Upgrade eines oder mehrerer bereits installierter Pakete durchführen möchten, ohne ein Upgrade aller Pakete, die Sie auf Ihrem System haben, durchzuführen. Anders als das Ziel von »upgrade«, das die neusten Versionen aller aktuell installierten Pakete installiert, wird »install« nur die neusten Versionen der angegebenen Pakete installieren. Geben Sie einfach den Namen des Paketes an, von dem Sie ein Upgrade durchführen möchten und wenn eine neuere Version verfügbar ist, wird sie (und ihre Abhängigkeiten, wie oben beschrieben) heruntergeladen und installiert.
es: Esto también es el objetivo a usar si quiere actualizar uno o más paquetes instalados sin actualizar todos los paquetes del sistema. A diferencia del objetivo de «upgrade», que instala la versión más nueva de todos los paquetes instalados, «install» instalará la versión más nueva sólo de los paquetes especificados. Simplemente proporcione el nombre de los paquetes que quiere actualizar, y si una versión más nueva está disponible ésta (y sus dependencias, como se describió anteriormente) se descargarán e instalarán.

source: Finally, the &apt-preferences; mechanism allows you to create an alternative installation policy for individual packages.
de: Letztendlich erlaubt Ihnen der &apt-preferences;-Mechanismus eine alternative Installationsrichtlinie für eigene Pakete zu erzeugen.
es: Por último, &apt-preferences; permite modificar las normas de selección para paquetes individuales.

source: If no package matches the given expression and the expression contains one of '.', '?' or '*' then it is assumed to be a POSIX regular expression, and it is applied to all package names in the database. Any matches are then installed (or removed). Note that matching is done by substring so 'lo.*' matches 'how-lo' and 'lowest'. If this is undesired, anchor the regular expression with a '^' or '$' character, or create a more specific regular expression.
de: Wenn keine Pakete dem angegebenen Ausdruck entsprechen und der Ausdruck entweder ».«,»,«,»?« oder »*« enthält, dann wird vermutet, dass es sich um einen regulären POSIX-Ausdruck handelt und er wird auf alle Paketnamen in der Datenbank angewandt. Jeder Treffer wird dann installiert (oder entfernt). Beachten Sie, dass nach übereinstimmenden Zeichenkettenteilen gesucht wird, so dass »lo.*« auf »how-lo« und »lowest« passt. Wenn dies nicht gewünscht wird, hängen Sie an den regulären Ausdruck ein »^«- oder »$«-Zeichen, um genauere reguläre Ausdruck zu erstellen.
es: Si ningún paquete coincide con la expresión proporcionada y la expresión contiene un «.», «?» o un «*», entonces se asume que es una expresión regular de acuerdo con el estándar POSIX, y se aplica a todos los nombres de paquetes de la base de datos. Cualquier coincidencia se instala (o desinstala). Tenga en cuenta que la comparación se hace en subcadenas, de manera que «lo.*» es válido para «how-lo» y para «lowest». Si este no es el comportamiento deseado, debe anclar la expresión regular con un «^» o un «$», o bien crear una expresión regular más específica.

source: <literal>remove</literal> is identical to <literal>install</literal> except that packages are removed instead of installed. Note the removing a package leaves its configuration files in system. If a plus sign is appended to the package name (with no intervening space), the identified package will be installed instead of removed.
de: <literal>remove</literal> ist identisch mit <literal>install</literal>, mit der Ausnahme, dass Pakte entfernt anstatt installiert werden. Beachten Sie, dass das Entfernen von Paketen deren Konfigurationsdateien im System belässt. Wenn ein Pluszeichen an den Paketnamen angehängt wird (ohne Leerzeichen dazwischen) wird das erkannte Paket installiert anstatt entfernt.
es: <literal>remove</literal> se comporta del mismo modo que <literal>install</literal> con la diferencia de que elimina los paquetes en vez de instalarlos. Tenga en cuenta que al eliminar un paquete sus ficheros de configuración se quedan en el sistema. Si un signo de suma precede al nombre del paquete (sin ningún espacio en blanco entre los dos), el paquete en cuestión será instalado en vez de eliminado.

source: <literal>purge</literal> is identical to <literal>remove</literal> except that packages are removed and purged (any configuration files are deleted too).
de: <literal>purge</literal> entspricht <literal>remove</literal> mit der Ausnahme, dass Pakete entfernt und vollständig gelöscht werden (jegliche Konfigurationsdateien werden mitgelöscht).
es: <literal>purge</literal> es idéntico a <literal>remove</literal>, con la diferencia de que los paquetes se eliminarán y purgarán (se eliminará también cualquier fichero de configuración).

source: <literal>source</literal> causes <command>apt-get</command> to fetch source packages. APT will examine the available packages to decide which source package to fetch. It will then find and download into the current directory the newest available version of that source package while respect the default release, set with the option <literal>APT::Default-Release</literal>, the <option>-t</option> option or per package with the <literal>pkg/release</literal> syntax, if possible.
de: <literal>source</literal> veranlasst <command>apt-get</command> dazu, Paketquellen zu laden. APT wird die verfügbaren Pakete überprüfen, um zu entscheiden, welche Paketquellen geladen werden. Es wird dann die neueste Version der Paketquelle finden und in das aktuelle Verzeichnis herunterladen. Dabei berücksichtigt es das Vorgabe-Release, das mit der Option <literal>APT::Default-Release</literal>, der Option <option>-t</option> oder pro Paket mit der <literal>pkg/release</literal>-Syntax gesetzt wurde, wenn möglich.
es: <literal>source</literal> hace que <command>apt-get</command> descargue los paquetes fuente. APT examinará los paquetes disponibles para decidir qué paquete fuente descargará. Entonces descargará la versión más reciente del paquete fuente en el directorio actual respetando la versión predeterminada, que se define en la opción <literal>APT::Default-Release</literal>, la opción <option>-t</option> o según el paquete con la sintaxis <literal>pkg/release</literal>, si es posible.

source: Source packages are tracked separately from binary packages via <literal>deb-src</literal> type lines in the &sources-list; file. This means that you will need to add such a line for each repository you want to get sources from. If you don't do this you will properly get another (newer, older or none) source version than the one you have installed or could install.
de: Paketquellen werden vom Programmpaket getrennt über <literal>deb-src</literal>-Typzeilen in der &sources-list;-Datei nachverfolgt. Das bedeutet, dass Sie für jedes Depot, aus dem Sie Quellen erhalten wollen, eine solche Zeile hinzufügen müssen. Wenn Sie dies nicht tun, werden Sie eine andere als die passende (neuere, ältere oder keine) Quellenversion erhalten, die Sie installiert haben oder installieren könnten.
es: Los paquetes fuente se registran de forma separada a los paquetes binarios mediante líneas del tipo <literal>deb-src</literal> en el fichero &sources-list;. Esto significa que tendrá que añadir una línea como esa para cada repositorio del que quiera conseguir las fuentes. Si no hace esto obtendrá una versión de fuentes distinta (más nueva, vieja o ninguna) de la que tiene instalada o de la que podría instalar.

source: A specific source version can be retrieved by postfixing the source name with an equals and then the version to fetch, similar to the mechanism used for the package files. This enables exact matching of the source package name and version, implicitly enabling the <literal>APT::Get::Only-Source</literal> option.
de: Eine bestimmte Quellversion kann durch Voranstellen eines Gleichheitszeichens vor den Paketnamen und dann der Version zum Herunterladen erhalten werde, ähnlich dem Mechanismus, der für Paketdateien benutzt wird. Dies ermöglicht exakte Übereinstimmung von Quellpaketname und -Version und impliziert das Einschalten der<literal>APT::Get::Only-Source</literal>-Option.
es: Puede obtener una versión especifica de un paquete fuente insertando un signo igual («=») seguido de la versión a descargar después del nombre del paquete, de forma similar al método que se usa con los paquetes binarios. Esto permite seleccionar exactamente el nombre y versión del paquete fuente, activando implícitamente la opción <literal>APT::Get::Only-Source</literal>.

source: Note that source packages are not tracked like binary packages, they exist only in the current directory and are similar to downloading source tar balls.
de: Beachten Sie, dass Quellpakete nicht wie normale Programmpakete nachverfolgt werden, sie existieren nur im aktuellen Verzeichnis und sind heruntergeladenen Tarballs ähnlich.
es: Tenga en cuenta que los paquetes fuentes no se tratan como los binarios, sólo existen en el directorio actual y es parecido a descargar los paquetes tar comprimidos con las fuentes.

source: <literal>check</literal> is a diagnostic tool; it updates the package cache and checks for broken dependencies.
de: <literal>check</literal> ist ein Diagnosewerkzeug. Es aktualisiert den Paketzwischenspeicher und prüft, ob beschädigte Abhängigkeiten vorliegen.
es: <literal>check</literal> es una herramienta de diagnóstico, actualiza la caché de paquetes y revisa la existencia de dependencias rotas.

source: <literal>clean</literal> clears out the local repository of retrieved package files. It removes everything but the lock file from <filename>&cachedir;/archives/</filename> and <filename>&cachedir;/archives/partial/</filename>. When APT is used as a &dselect; method, <literal>clean</literal> is run automatically. Those who do not use dselect will likely want to run <literal>apt-get clean</literal> from time to time to free up disk space.
de: <literal>clean</literal> bereinigt das lokale Depot von heruntergeladenen Paketdateien. Es entfernt alles außer der Sperrdatei aus <filename>&cachedir;/archives/</filename> und <filename>&cachedir;/archives/partial/</filename>. Wenn APT als eine &dselect;-Methode benutzt wird, wird <literal>clean</literal> automatisch ausgeführt. Diejenigen, die Dselect nicht benutzen, werden <literal>apt-get clean</literal> wahrscheinlich von Zeit zu Zeit ausführen, um Plattenplatz freizugeben.
es: <literal>clean</literal> borra totalmente el repositorio local que contiene los ficheros de los paquetes descargados. Borra todo excepto el fichero de bloqueo de los directorios <filename>&cachedir;/archives/</filename> y <filename>&cachedir;/archives/partial/</filename>. Cuando APT se usa como un método de &dselect;, <literal>clean</literal> se ejecuta automáticamente. Si no usa dselect es probable que desee ejecutar <literal>apt-get clean</literal> de vez en cuando para liberar algo de espacio en disco.

source: Like <literal>clean</literal>, <literal>autoclean</literal> clears out the local repository of retrieved package files. The difference is that it only removes package files that can no longer be downloaded, and are largely useless. This allows a cache to be maintained over a long period without it growing out of control. The configuration option <literal>APT::Clean-Installed</literal> will prevent installed packages from being erased if it is set to off.
de: Wie <literal>clean</literal> bereinigt <literal>autoclean</literal> das lokale Depot von heruntergeladenen Paketdateien. Der Unterschied besteht darin, dass es nur Pakete entfernt, die nicht mehr heruntergeladen werden können und größtenteils nutzlos sind. Dies erlaubt es, einen Zwischenspeicher über eine lange Zeitspanne zu betreuen, ohne dass er unkontrolliert anwächst. Die Konfigurationsoption <literal>APT::Clean-Installed</literal> wird installierte Pakete vor der Löschung bewahren, wenn sie auf »off« gesetzt ist.
es: Al igual que <literal>clean</literal>, <literal>autoclean</literal> borra el repositorio local de paquetes descargados. La diferencia reside en que sólo borrará aquellos paquetes que ya no se pueden descargar, o que son claramente inservibles. Esto permite mantener el almacén durante largos periodos de tiempo sin que aumente su tamaño descontroladamente. Si la opción de configuración <literal>APT::Clean-Installed</literal> está desactivada impedirá que se borren los paquetes instalados.

source: <literal>changelog</literal> downloads a package changelog and displays it through <command>sensible-pager</command>. The server name and base directory is defined in the <literal>APT::Changelogs::Server</literal> variable (e. g. <ulink>http://packages.debian.org/changelogs</ulink> for Debian or <ulink>http://changelogs.ubuntu.com/changelogs</ulink> for Ubuntu). By default it displays the changelog for the version that is installed. However, you can specify the same options as for the <option>install</option> command.
de: <literal>changelog</literal> lädt ein Changelog eines Pakets herunter und zeigt es mit <command>sensible-pager</command> an. Der Servername und das Basisverzeichnis sind in der Variable <literal>APT::Changelogs::Server</literal> definiert (z.B. <ulink>http://packages.debian.org/changelogs</ulink> für Debian oder <ulink>http://changelogs.ubuntu.com/changelogs</ulink> für Ubuntu). Standardmäßig zeigt es das Changelog für die installierte Version. Sie können jedoch die gleichen Optionen wie für den Befehl <option>install</option> angeben.
