Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: Only perform operations that are 'trivial'. Logically this can be considered related to <option>--assume-yes</option>, where <option>--assume-yes</option> will answer yes to any prompt, <option>--trivial-only</option> will answer no. Configuration Item: <literal>APT::Get::Trivial-Only</literal>.
de: Nur Operationen ausführen, die »trivial« sind. Logischerweise kann dies in Betracht bezogen auf <option>--assume-yes</option> sein, wobei <option>--assume-yes</option> auf jede Frage mit »Ja« und <option>--trivial-only</option> mit »Nein« antworten wird. Konfigurationselement: <literal>APT::Get::Trivial-Only</literal>.
es: Sólo realiza acciones consideradas «triviales». Esta opción está relacionada con <option>--assume-yes</option> de modo que dónde <option>--assume-yes</option> responde afirmativamente a cualquier pregunta, <option>--trivial-only</option> responderá negativamente. Opción de configuración: <literal>APT::Get::Trivial-Only</literal>.

source: If any packages are to be removed apt-get immediately aborts without prompting. Configuration Item: <literal>APT::Get::Remove</literal>.
de: Wenn irgendwelche Pakete entfernt werden sollen, bricht apt-get sofort ohne Nachfrage ab. Konfigurationselement: <literal>APT::Get::Remove</literal>.
es: Si se va a desinstalar algún paquete, apt-get terminará inmediatamente sin preguntar. Opción de configuración: <literal>APT::Get::Remove</literal>

source: If the command is either <literal>install</literal> or <literal>remove</literal>, then this option acts like running <literal>autoremove</literal> command, removing the unused dependency packages. Configuration Item: <literal>APT::Get::AutomaticRemove</literal>.
de: Wenn der Befehl entweder <literal>install</literal> oder <literal>remove</literal> lautet, dann bewirkt diese Option wie das Ausführen des <literal>autoremove</literal>-Befehls das Entfernen der nicht benutzten Abhhängigkeitspakete. Konfigurationselement: <literal>APT::Get::AutomaticRemove</literal>.
es: Si la orden es <literal>install</literal> o <literal>remove</literal>, esta opción se ejecutará como <literal>autoremove</literal>, eliminando los paquetes que son dependencia de otro, pero que estén en desuso. Opción de configuración: <literal>APT::Get::AutomaticRemove</literal>.

source: Only has meaning for the <literal>source</literal> and <literal>build-dep</literal> commands. Indicates that the given source names are not to be mapped through the binary table. This means that if this option is specified, these commands will only accept source package names as arguments, rather than accepting binary package names and looking up the corresponding source package. Configuration Item: <literal>APT::Get::Only-Source</literal>.
de: Hat nur eine Bedeutung für die Befehle <literal>source</literal> und <literal>build-dep</literal>. Zeigt an, dass die angegebenen Quellnamen nicht durch die Programmtabelle ermittelt werden. Dies bedeutet, das dieser Befehl, wenn diese Option angegeben ist, nur Quellpaketnamen als Argumente akzeptiert, anstatt Programmpakete zu akzeptieren und nach den entsprechenden Quellpaketen zu suchen. Konfigurationselement: <literal>APT::Get::Only-Source</literal>.
es: Sólo tiene sentido para las órdenes <literal>source</literal> y <literal>build-dep</literal>. Indica que los nombres de paquetes fuente proporcionados no se deben tratar a través de la tabla de binarios. Esto significa que si se especifica esta opción, estas órdenes sólo aceptarán como argumento nombres de paquetes fuente, en vez de aceptar nombres de paquetes binarios, para luego buscar el nombre del paquete fuente correspondiente. Opción de configuración: <literal>APT::Get::Only-Source</literal>

source: Download only the diff, dsc, or tar file of a source archive. Configuration Item: <literal>APT::Get::Diff-Only</literal>, <literal>APT::Get::Dsc-Only</literal>, and <literal>APT::Get::Tar-Only</literal>.
de: Nur die diff-, dsc-, oder tar-Dateien eines Quellarchivs herunterladen. Konfigurationselemente: <literal>APT::Get::Diff-Only</literal>, <literal>APT::Get::Dsc-Only</literal> und <literal>APT::Get::Tar-Only</literal>.
es: Descarga sólo el fichero diff, dsc o tar del archivo de fuentes. Opciones de configuración: <literal>APT::Get::Diff-Only</literal>, <literal>APT::Get::Dsc-Only</literal> y <literal>APT::Get::Tar-Only</literal>.

source: Only process architecture-dependent build-dependencies. Configuration Item: <literal>APT::Get::Arch-Only</literal>.
de: Nur architekturabhängige Bauabhängigkeiten verarbeiten. Konfigurationselement: <literal>APT::Get::Arch-Only</literal>.
es: Procesa sólo las dependencias de construcción dependientes de la arquitectura. Opción de configuración: <literal>APT::Get::Arch-Only</literal>

source: Ignore if packages can't be authenticated and don't prompt about it. This is useful for tools like pbuilder. Configuration Item: <literal>APT::Get::AllowUnauthenticated</literal>.
de: Ignorieren, wenn Pakete nicht authentifiziert werden können und nicht danach fragen. Dies ist für Werkzeuge wie pbuilder nützlich. Konfigurationselement: <literal>APT::Get::AllowUnauthenticated</literal>.
es: Ignora si los paquetes no se pueden autenticar, sin generar ningún diálogo sobre ello. Esto es útil para herramientas como pbuilder. Opción de configuración: <literal>APT::Get::AllowUnauthenticated</literal>.

source: &apt-cache;, &apt-cdrom;, &dpkg;, &dselect;, &sources-list;, &apt-conf;, &apt-config;, &apt-secure;, The APT User's guide in &guidesdir;, &apt-preferences;, the APT Howto.
de: &apt-cache;, &apt-cdrom;, &dpkg;, &dselect;, &sources-list;, &apt-conf;, &apt-config;, &apt-secure;, Die APT-Benutzeranleitung in &guidesdir;, &apt-preferences;, das APT-Howto.
es: &apt-cache;, &apt-cdrom;, &dpkg;, &dselect;, &sources-list;, &apt-conf;, &apt-config;, &apt-secure;, la guía de usuario de APT en &guidesdir;, &apt-preferences;, el Cómo de APT.

source: <command>apt-get</command> returns zero on normal operation, decimal 100 on error.
de: <command>apt-get</command> gibt bei normalen Operationen 0 zurück, dezimal 100 bei Fehlern.
es: <command>apt-get</command> devuelve cero si no hay ningún error, y el valor 100 en caso de error.

source: ORIGINAL AUTHORS
de: ORIGINALAUTOREN
es: AUTORES ORIGINALES

source: CURRENT AUTHORS
de: AKTUELLE AUTOREN
es: AUTORES ACTUALES

source: APT key management utility
de: APT-Schlüsselverwaltungsdienstprogramm
es: Herramienta para gestionar las claves de APT

source: <command>apt-key</command> <arg><option>--keyring <replaceable>filename</replaceable></option></arg> <arg><replaceable>command</replaceable></arg> <arg rep="repeat"><option><replaceable>arguments</replaceable></option></arg>
de: <command>apt-key</command> <arg><option>--keyring <replaceable>Dateiname</replaceable></option></arg> <arg><replaceable>Befehl</replaceable></arg> <arg rep="repeat"><option><replaceable>Argumente</replaceable></option></arg>
es: <command>apt-key</command> <arg><option>--keyring <replaceable>nombre-de-fichero</replaceable></option></arg> <arg><replaceable>orden</replaceable></arg> <arg rep="repeat"><option><replaceable>argumentis</replaceable></option></arg>

source: <command>apt-key</command> is used to manage the list of keys used by apt to authenticate packages. Packages which have been authenticated using these keys will be considered trusted.
de: <command>apt-key</command> wird benutzt, um eine Liste von Schlüsseln zu verwalten, die APT benutzt, um Pakete zu authentifizieren. Pakete, die durch Benutzung dieser Schlüssel authentifiziert wurden, werden als vertrauenswürdig betrachtet.
es: <command>apt-key</command> sirve para gestionar la lista de claves que APT usa para autenticar paquetes. Los paquetes autenticados mediante estas claves se consideran de confianza.

source: Commands
de: Befehle
es: Órdenes

source: add <replaceable>filename</replaceable>
de: add <replaceable>Dateiname</replaceable>
es: add <replaceable>nombre-de-fichero</replaceable>

source: Add a new key to the list of trusted keys. The key is read from <replaceable>filename</replaceable>, or standard input if <replaceable>filename</replaceable> is <literal>-</literal>.
de: Einen neuen Schlüssel zur Liste der vertrauenswürdigen Schlüssel hinzufügen. Der Schlüssel wird aus <replaceable>Dateiname</replaceable> gelesen oder, wenn <replaceable>Dateiname</replaceable> <literal>-</literal> ist, von der Standardeingabe.
es: Añade una nueva clave a la lista de claves de confianza. Puede introducir la clave mediante un fichero (<replaceable>nombre-de-fichero</replaceable>) o por la entrada estándar si <replaceable>nombre-de-fichero</replaceable> es <literal>-</literal>.

source: del <replaceable>keyid</replaceable>
de: del <replaceable>Schlüssel-ID</replaceable>
es: del <replaceable>identificador-de-la-clave</replaceable>

source: Remove a key from the list of trusted keys.
de: Einen Schlüssel von der Liste der vertrauenswürdigen Schlüssel entfernen.
es: Elimina una clave de la lista de claves de confianza.

source: export <replaceable>keyid</replaceable>
de: export <replaceable>Schlüssel-ID</replaceable>
es: export <replaceable>identificador-de-la-clave</replaceable>

source: Output the key <replaceable>keyid</replaceable> to standard output.
de: Den Schlüssel <replaceable>Schlüssel-ID</replaceable> auf der Standardausgabe ausgeben.
es: Devuelve la clave identificada por el <replaceable>identificador-de-la-clave</replaceable> por la salida estándar.

source: Output all trusted keys to standard output.
de: Alle vertrauenswürdigen Schlüssel auf der Standardausgabe ausgeben.
es: Devuelve todas las claves de confianza por la salida estándar.

source: List trusted keys.
de: Vertrauenswürdige Schlüssel auflisten.
es: Lista las claves de confianza.

source: List fingerprints of trusted keys.
de: Fingerabdrücke vertrauenswürdiger Schlüssel auflisten.
es: Lista las huellas digitales de las claves de confianza.

source: Pass advanced options to gpg. With adv --recv-key you can download the public key.
de: Erweitere Optionen an gpg weiterleiten. Mit adv --recv-key können Sie den öffentlichen Schlüssel herunterladen.
es: Proporciona opciones avanzadas a gpg. Puede descargar la clave pública con «adv --recv-key».

source: Note that options need to be defined before the commands described in the previous section.
de: Beachten Sie, dass Optionen vor den im vorherigen Abschnitt beschriebenen Befehlen definiert sein müssen.
es: Tenga en cuenta que las opciones se deben definir antes de las órdenes descritas en el sección anterior.

source: --keyring <replaceable>filename</replaceable>
de: --keyring <replaceable>Dateiname</replaceable>
es: --keyring <replaceable>nombre-de-fichero</replaceable>

source: Local trust database of archive keys.
de: Lokale Datenbank vertrauenswürdiger Archivschlüssel.
es: Base de datos local de las claves de confianza de archivos Debian

source: mark/unmark a package as being automatically-installed
de: ein Paket als automatisch installiert markieren oder diese Markierung entfernen
es: Marca o desmarca un paquete como instalado automáticamente

source: <command>apt-mark</command> <arg><option>-hv</option></arg> <arg><option>-f=<replaceable>FILENAME</replaceable></option></arg> <group choice="plain"> <arg choice="plain"> <group choice="req"> <arg choice="plain">auto</arg> <arg choice="plain">manual</arg> <arg choice="plain">showauto</arg> <arg choice="plain">showmanual</arg> </group> <arg choice="plain" rep="repeat"><replaceable>package</replaceable></arg> </arg> </group>
de: <command>apt-mark</command> <arg><option>-hv</option></arg> <arg><option>-f=<replaceable>DATEINAME</replaceable></option></arg> <group choice="plain"> <arg choice="plain"> <group choice="req"> <arg choice="plain">auto</arg> <arg choice="plain">manual</arg> <arg choice="plain">showauto</arg> <arg choice="plain">showmanual</arg> </group> <arg choice="plain" rep="repeat"><replaceable>Paket</replaceable></arg> </arg> </group>

source: <command>apt-mark</command> will change whether a package has been marked as being automatically installed.
de: <command>apt-mark</command> wird ändern, ob ein Paket als automatisch installiert markiert ist.
es: <command>apt-mark</command> conmuta si un paquete se instaló automáticamente o no.

source: When you request that a package is installed, and as a result other packages are installed to satisfy its dependencies, the dependencies are marked as being automatically installed. Once these automatically installed packages are no longer depended on by any manually installed packages, they will be removed by e.g. <command>apt-get</command> or <command>aptitude</command>.
de: Wenn Sie die Installation eines Paketes anfordern und andere Pakete installiert werden, um dessen Abhängigkeiten zu erfüllen, werden die Abhängigkeiten als automatisch installiert markiert. Sobald keine manuell installierten Pakete mehr von diesen automatisch installierten Paketen abhängen, werden sie z.B durch <command>apt-get</command> oder <command>aptitude</command> entfernt.
es: Cuando solicita la instalación de un paquete y como resultado de ello se instalan otros paquetes para satisfacer sus dependencias, éstos se marcarán como instalados automáticamente. Una vez que estos paquetes instalados automáticamente ya no son necesarios para ningún paquete instalado manualmente, <command>apt-get</command> o <command>aptitude</command> los eliminará.

source: <literal>auto</literal> is used to mark a package as being automatically installed, which will cause the package to be removed when no more manually installed packages depend on this package.
de: <literal>auto</literal> wird benutzt, um ein Paket als automatisch installiert zu markieren, was veranlasst, dass das Paket entfernt wird, wenn keine manuell installierten Pakete von ihm abhängen.

source: <literal>manual</literal> is used to mark a package as being manually installed, which will prevent the package from being automatically removed if no other packages depend on it.
de: <literal>manual</literal> wird benutzt, um ein Paket als manuell installiert zu markieren, was verhindert, dass das Paket automatisch entfernt wird, wenn kein anderes Paket von ihm abhängt.

source: <literal>hold</literal> is used to mark a package as hold back, which will prevent the package from being automatically installed, upgraded or removed. The command is only a wrapper around <command>dpkg --set-selections</command> and the state is therefore maintained by &dpkg; and not effected by the <option>--filename</option> option.
de: <literal>hold</literal> wird benutzt, um ein Paket als zurückgehalten zu markieren, was verhindert, dass das Paket automatisch installiert, ein Upgrade davon durchgeführt oder es entfernt wird. Der Befehl ist nur ein Wrapper um <command>dpkg --set-selections</command> und der Status wird daher durch &dpkg; verwaltet und nicht durch die Option <option>--filename</option>.

source: <literal>unhold</literal> is used to cancel a previously set hold on a package to allow all actions again.
de: <literal>unhold</literal> wird benutzt, um ein vorher gesetztes »hold« auf ein Paket aufzuheben, um alle Aktionen wieder zu erlauben.

source: <literal>showauto</literal> is used to print a list of automatically installed packages with each package on a new line. All automatically installed packages will be listed if no package is given. If packages are given only those which are automatically installed will be shown.
de: <literal>showauto</literal> wird benutzt, um eine Liste automatisch installierter Pakete – mit einem Paket in jeder neuen Zeile – auszugeben. Wenn kein Paket angegeben ist, werden alle automatisch installierten Pakete aufgelistet. Falls Pakete angegeben sind, werden nur diejenigen angezeigt, die automatisch installiert wurden.

source: <literal>showmanual</literal> can be used in the same way as <literal>showauto</literal> except that it will print a list of manually installed packages instead.
de: <literal>showmanual</literal> kann auf die gleiche Weise wie <literal>showauto</literal> benutzt werden, mit der Ausnahme, dass es stattdessen eine Liste manuell installierter Pakete ausgibt.

source: <literal>showhold</literal> is used to print a list of packages on hold in the same way as for the other show commands.
de: <literal>showhold</literal> wird benutzt, um eine Liste auf »hold« gesetzter Pakete auf die gleiche Art wie für andere Anzeigebefehle auszugeben.

source: <option>-f=<filename><replaceable>FILENAME</replaceable></filename></option>
de: <option>-f=<filename><replaceable>DATEINAME</replaceable></filename></option>
es: <option>-f=<filename><replaceable>NOMBRE-DE-FICHERO</replaceable></filename></option>

source: <option>--file=<filename><replaceable>FILENAME</replaceable></filename></option>
de: <option>--file=<filename><replaceable>DATEINAME</replaceable></filename></option>
es: <option>--file=<filename><replaceable>nombre-de-fichero</replaceable></filename></option>

source: Read/Write package stats from <filename><replaceable>FILENAME</replaceable></filename> instead of the default location, which is <filename>extended_status</filename> in the directory defined by the Configuration Item: <literal>Dir::State</literal>.
de: Paketstatus von <filename><replaceable>DATEINAME</replaceable></filename> lesen/schreiben, anstatt vom Standardort, der <filename>extended_status</filename> im von Konfigurationselement <literal>Dir::State</literal> definierten Verzeichnis, ist.
es: Escribe y lee las estadísticas de los paquetes desde <filename><replaceable>nombre-de-fichero</replaceable></filename> en lugar de la ubicación predeterminada, que es <filename>extended_status</filename> en el directorio definido en la opción de configuración: <literal>Dir::State</literal>.

source: <command>apt-mark</command> returns zero on normal operation, non-zero on error.
de: <command>apt-mark</command> gibt bei normalen Operationen Null zurück, bei Fehlern nicht Null.
es: <command>apt-mark</command> devuelve cero si no hay ningún error, y el valor 100 en caso de error.

source: Archive authentication support for APT
de: Archivauthentifizierungsunterstützung für APT
es: Compatibilidad con la autenticación en el archivo para APT

source: Starting with version 0.6, <command>apt</command> contains code that does signature checking of the Release file for all archives. This ensures that packages in the archive can't be modified by people who have no access to the Release file signing key.
de: Beginnend mit Version 0.6 enthält <command>apt</command> Code, der die Signatur der Release-Datei für alle Archive prüft. Dies stellt sicher, dass Pakete im Archiv nicht von Leuten geändert werden können, die keinen Zugriff auf den Signierschlüssel der Release-Datei haben.
es: Desde la versión 0.6, <command>apt</command> contiene el código que realiza la comprobación de la firma del fichero «Release» para todos los archivos. Esto asegura que los paquetes del archivo no se han modificado por alguien sin acceso a la clave con la que se firmó el fichero «Release».

source: If a package comes from a archive without a signature or with a signature that apt does not have a key for that package is considered untrusted and installing it will result in a big warning. <command>apt-get</command> will currently only warn for unsigned archives, future releases might force all sources to be verified before downloading packages from them.
de: Wenn ein Paket aus einem Archiv ohne Signatur stammt oder einem mit Signatur, für das APT keinen Schlüssel hat, wird dieses Paket als nicht vertrauenswürdig angesehen und es zu installieren, führt zu einer großen Warnung. <command>apt-get</command> wird aktuell nur bei nicht signierten Archiven warnen, zukünftige Releases könnten die Prüfung aller Quellen vor dem Herunterladen von Paketen von dort erzwingen.
es: Si el paquete viene de un archivo sin una firma o con una firma de la que apt no tiene su clave, el paquete se considerará no fiable y su instalación provocará un gran aviso. <command>apt-get</command> actualmente sólo avisa de los archivos sin firmar, las próximas versiones puede que fuercen a verificar todas las fuentes antes de descargar paquetes desde ellas.

source: The package frontends &apt-get;, &aptitude; and &synaptic; support this new authentication feature.
de: Die Paketoberflächen &apt-get;, &aptitude; und &synaptic; unterstützen diese neue Authentifizierungsfunktion.
es: Las interfaces de gestión de paquetes &apt-get;, &aptitude; y &synaptic; pueden usar esta nueva funcionalidad de autenticación.

source: Trusted archives
de: Vertrauenswürdige Archive
es: Archivos de confianza

source: The chain of trust from an apt archive to the end user is made up of different steps. <command>apt-secure</command> is the last step in this chain, trusting an archive does not mean that the packages that you trust it do not contain malicious code but means that you trust the archive maintainer. It's the archive maintainer responsibility to ensure that the archive integrity is correct.
de: Eine Kette des Vertrauens von einem APT-Archiv zum Endanwender wird durch verschiedene Schritte erreicht. <command>apt-secure</command> ist der letzte Schritt in dieser Kette. Einem Archiv zu vertrauen bedeutet nicht, dass das Paket, dem Sie vertrauen, keinen schadhaften Code enthält, aber es bedeutet, dass Sie dem Archivbetreuer vertrauen. Der Archivbetreuer ist dafür verantwortlich, dass er die Korrektheit der Integrität des Archivs sicherstellt.
es: La cadena de confianza desde un archivo apt a un usuario final se realiza en diferentes pasos. <command>apt-secure</command> es el último paso en esta cadena, confiar en un archivo no significa que los paquetes en los que se confía no haya código malicioso, pero significa que se confía en el mantenedor del archivo. El mantenedor del archivo es el responsable de asegurar que la integridad del archivo es correcta.

source: apt-secure does not review signatures at a package level. If you require tools to do this you should look at <command>debsig-verify</command> and <command>debsign</command> (provided in the debsig-verify and devscripts packages respectively).
de: apt-secure überprüft keine Signaturen auf einer Ebene des Pakets. Falls Sie ein Werkzeug benötigen, das dies tut, sollten Sie einen Blick auf <command>debsig-verify</command> und <command>debsign</command> werfen (bereitgestellt von den Paketen debsig-verify beziehungsweise devscripts).
es: apt-secure no revisa las firmas a nivel de paquete. Si necesita herramientas para realizar esto, debería ver <command>debsig-verify</command> y <command>debsign</command> (proporcionados en los paquetes debsig-verify y devscripts respectivamente).
