Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: The <literal>release</literal> command generates a Release file from a directory tree. It recursively searches the given directory for uncompressed <filename>Packages</filename> and <filename>Sources</filename> files and the ones compressed with <command>gzip</command>, <command>bzip2</command> or <command>lzma</command> as well as <filename>Release</filename> and <filename>md5sum.txt</filename> files by default (<literal>APT::FTPArchive::Release::Default-Patterns</literal>). Additional filename patterns can be added by listing them in <literal>APT::FTPArchive::Release::Patterns</literal>. It then writes to stdout a Release file containing a MD5, SHA1 and SHA256 digest for each file.
de: Der Befehl <literal>release</literal> erzeugt eine Release-Datei aus einem Verzeichnisbaum. Standardmäßig durchsucht er rekursiv das angegebene Verzeichnis nach nicht komprimierten <filename>Packages</filename>- und <filename>Sources</filename>-Dateien und denen, die mit <command>gzip</command>, <command>bzip2</command> oder <command>lzma</command> komprimiert wurden, ebenso wie <filename>Release</filename>- und <filename>md5sum.txt</filename>-Dateien (<literal>APT::FTPArchive::Release::Default-Patterns</literal>). Zusätzliche Muster für Dateinamen können hinzugefügt werden, indem sie in <literal>APT::FTPArchive::Release::Patterns</literal> aufgeführt werden. Dann schreibt er eine Release-Datei auf die Standardausgabe, die für jede Datei eine MD5-, SHA1- und SHA256-Prüfsumme enthält.

source: Values for the additional metadata fields in the Release file are taken from the corresponding variables under <literal>APT::FTPArchive::Release</literal>, e.g. <literal>APT::FTPArchive::Release::Origin</literal>. The supported fields are: <literal>Origin</literal>, <literal>Label</literal>, <literal>Suite</literal>, <literal>Version</literal>, <literal>Codename</literal>, <literal>Date</literal>, <literal>Valid-Until</literal>, <literal>Architectures</literal>, <literal>Components</literal>, <literal>Description</literal>.
de: Werte für zusätzliche Metadatenfelder in der Release-Datei werden den entsprechenden Variablen unter <literal>APT::FTPArchive::Release</literal> entnommen, z.B. <literal>APT::FTPArchive::Release::Origin</literal>. Die unterstützten Felder sind: <literal>Origin</literal>, <literal>Label</literal>, <literal>Suite</literal>, <literal>Version</literal>, <literal>Codename</literal>, <literal>Date</literal>, <literal>Valid-Until</literal>, <literal>Architectures</literal>, <literal>Components</literal>, <literal>Description</literal>.
es: Los valores para los campos de metadatos adicionales en el fichero «Release» se toman de las variables correspondientes en <literal>APT::FTPArchive::Release</literal>, por ejemplo <literal>APT::FTPArchive::Release::Origin</literal>. Los campos permitidos son: <literal>Origin</literal>, <literal>Label</literal>, <literal>Suite</literal>, <literal>Version</literal>, <literal>Codename</literal>, <literal>Date</literal>, <literal>Valid-Until</literal>, <literal>Architectures</literal>, <literal>Components</literal> y <literal>Description</literal>.

source: The <literal>generate</literal> command is designed to be runnable from a cron script and builds indexes according to the given config file. The config language provides a flexible means of specifying which index files are built from which directories, as well as providing a simple means of maintaining the required settings.
de: Der <literal>generate</literal>-Befehl wurde entworfen, um von einem Cron-Skript ausführbar zu sein und bildet Indizes, die der angegebenen Konfigurationsdatei entsprechen. Die Konfigurationssprache stellt eine flexible Möglichkeit bereit, um anzugeben, welche Indexdateien von welchen Verzeichnissen gebildet wurden, ebenso wie sie eine einfache Möglichkeit zur Verwaltung der erforderlichen Einstellungen bereitstellt.
es: La orden <literal>generate</literal> se diseñó para ejecutarse desde un script de cron y genera los índices de acuerdo a lo proporcionado en el fichero de configuración. El lenguaje de configuración proporciona una forma flexible de definir qué ficheros de índice se generarán a partir de qué directorios, así como proporcionar una forma sencilla de mantener la configuración necesaria.

source: The <literal>clean</literal> command tidies the databases used by the given configuration file by removing any records that are no longer necessary.
de: Der <literal>clean</literal>-Befehl räumt die Datenbanken auf, die von der angegebenen Konfigurationsdatei benutzt wurden, indem es nicht länger nötige Datensätze entfernt.
es: La orden <literal>clean</literal> ordena las bases de datos que usa el fichero de configuración proporcionado, eliminando los registros que no son necesarios.

source: The Generate Configuration
de: Die Generate-Konfiguration
es: La configuración de «generate»

source: The <literal>generate</literal> command uses a configuration file to describe the archives that are going to be generated. It follows the typical ISC configuration format as seen in ISC tools like bind 8 and dhcpd. &apt-conf; contains a description of the syntax. Note that the generate configuration is parsed in sectional manner, but &apt-conf; is parsed in a tree manner. This only effects how the scope tag is handled.
de: Der <literal>generate</literal>-Befehl benutzt eine Konfigurationsdatei, um die Archive zu beschreiben, die generiert werden sollen. Es folgt dem typischen ISC-Konfigurationsformat, wie es in ISC-Werkzeugen wie Bind 8 oder DHCP gesehen werden kann. &apt-conf; enthält eine Beschreibung der Syntax. Beachten Sie, dass die generate-Konfiguration abschnittsweise ausgewertet wird, &apt-conf; aber baumartig ausgewertet wird. Dies hat nur Auswirkungen, wenn die Markierung »scope« behandelt wird.
es: La orden <literal>generate</literal> usa un fichero de configuración para describir los ficheros que se generarán. Sigue el típico formato de configuración de ISC visto en las herramientas de ISC como bind 8 y dhcpd. &apt-conf; contiene una descripción de la sintaxis. Tenga en cuenta que la configuración de «generate» se analiza por sección, pero &apt-conf; se analiza por árbol. Esto sólo afecta a cómo se maneja el ámbito de la etiqueta.

source: The generate configuration has 4 separate sections, each described below.
de: Die generate-Konfiguration hat vier getrennte Abschnitte, jeder ist unterhalb beschrieben
es: La configuración de «generate» tiene cuatro secciones diferentes, que se describen a continuación.

source: Dir Section
de: Dir-Abschnitt
es: Sección Dir

source: The <literal>Dir</literal> section defines the standard directories needed to locate the files required during the generation process. These directories are prepended certain relative paths defined in later sections to produce a complete an absolute path.
de: Der <literal>Dir</literal>-Abschnitt definiert die Vorgabeverzeichnisse, die zum Orten der benötigten Dateien während des Generierungsprozesses gebraucht werden. Diese Verzeichnisse werden bestimmten relativen Pfaden, die in späteren Abschnitten definiert werden, vorangestellt, um einen vollständigen absoluten Pfad zu bilden.
es: La sección <literal>Dir</literal> define los directorios estándar necesarios para ubicar los ficheros necesarios durante el proceso de generación. A estos directorios se les añaden ciertas rutas relativas definidas en secciones posteriores para producir una ruta absoluta.

source: Specifies the root of the FTP archive, in a standard Debian configuration this is the directory that contains the <filename>ls-LR</filename> and dist nodes.
de: Gibt die Wurzel des FTP-Archivs an. In einer Debian-Standardkonfiguration ist das das Verzeichnis, das die <filename>ls-LR</filename>- und dist-Knoten enthält.
es: Define la raíz del archivo FTP; en una configuración estándar de Debian éste es el directorio que contiene el <filename>ls-LR</filename> y los nodos «dist».

source: Specifies the location of the override files.
de: Gibt den Ort der Override-Dateien an
es: Define la ubicación de los ficheros alternativos.

source: Specifies the location of the cache files
de: Gibt den Ort der Zwischenspeicherdateien an
es: Define la ubicación de los ficheros de la caché.

source: Specifies the location of the file list files, if the <literal>FileList</literal> setting is used below.
de: Gibt den Ort der Dateilistendateien an, wenn die <literal>FileList</literal> unterhalb gesetzt ist.
es: Define la ubicación de los ficheros del listado de ficheros, si se usa posteriormente el valor <literal>FileList</literal>.

source: Default Section
de: Vorgabe-Abschnitt
es: Sección Default

source: The <literal>Default</literal> section specifies default values, and settings that control the operation of the generator. Other sections may override these defaults with a per-section setting.
de: Der <literal>Default</literal>-Abschnitt gibt Vorgabewerte an und Einstellungen, die den Betrieb des Generators steuern. Andere Abschnitte können diese Vorgaben mit einer Einstellung pro Abschnitt überschreiben.
es: La sección <literal>Default</literal> define los valores predeterminados, y los ajustes que controlan la operación del generador. Otras secciones pueden sobrescribir estos valores predeterminados con un valor de la sección.

source: Sets the default compression schemes to use for the Package index files. It is a string that contains a space separated list of at least one of: '.' (no compression), 'gzip' and 'bzip2'. The default for all compression schemes is '. gzip'.
de: Setzt das Vorgabe-Kompressionsschema, das für die Package-Indexdateien benutzt wird. Es ist eine Zeichenkette, die eine durch Leerzeichen getrennte Liste mit mindestens einem der folgenden Dinge enthält: ».« (keine Kompression), »gzip« und »bzip2«. Die Vorgabe für alle Kompressionsschemata ist ». gzip«.
es: Define los esquemas de compresión predeterminados para usar en los ficheros de índice de «Package». Es una cadena que contiene una lista separada por espacios de al menos uno de los siguientes valores: «.» (sin compresión), «gzip» y «bzip2». El valor predeterminado para todos los esquemas de compresión es «. gzip».

source: Sets the default list of file extensions that are package files. This defaults to '.deb'.
de: Setzt die Vorgabeliste von Dateierweiterungen, die Paketdateien sind. Vorgabe ist ».deb«.
es: Define la lista predeterminada de extensiones de fichero que son ficheros de paquete. El valor predeterminado es «.deb».

source: This is similar to <literal>Packages::Compress</literal> except that it controls the compression for the Sources files.
de: Dies ist <literal>Packages::Compress</literal> ähnlich, außer dass es die Kompression der Quelldateien steuert.
es: Esta opción es similar a <literal>Packages::Compress</literal> excepto que controla la compresión para los ficheros «Sources».

source: Sets the default list of file extensions that are source files. This defaults to '.dsc'.
de: Setzt die Vorgabeliste von Dateierweiterungen, die Quelldateien sind. Vorgabe ist ».dsc«.
es: Define la lista predeterminada de las extensiones de fichero que son ficheros de fuentes. El valor predeterminado es «.dsc».

source: This is similar to <literal>Packages::Compress</literal> except that it controls the compression for the Contents files.
de: Dies ist <literal>Packages::Compress</literal> ähnlich, außer dass es die Kompression der Inhaltsdateien steuert.
es: Esta opción es similar a <literal>Packages::Compress</literal> excepto que controla la compresión para los ficheros «Contents».

source: This is similar to <literal>Packages::Compress</literal> except that it controls the compression for the Translation-en master file.
de: Dies ist <literal>Packages::Compress</literal> ähnlich, außer dass es die Kompression der Translation-en-Hauptdatei steuert.
es: Esta opción es similar a <literal>Packages::Compress</literal> excepto que controla la compresión para el fichero maestro Translation-en.

source: Specifies the number of kilobytes to delink (and replace with hard links) per run. This is used in conjunction with the per-section <literal>External-Links</literal> setting.
de: Gibt die Anzahl von Kilobytes an, die pro Durchlauf delinkt (und durch Hardlinks ersetzt) werden sollen. Dies wird in Verbindung mit der <literal>External-Links</literal>-Einstellung pro Abschnitt benutzt.
es: Define el número de kilobytes a desenlazar (y reemplazar con enlaces duros) por ejecución. Se usa junto al valor <literal>External-Links</literal> de cada sección.

source: Specifies the mode of all created index files. It defaults to 0644. All index files are set to this mode with no regard to the umask.
de: Gibt die Rechte für alle erstellten Indexdateien an. Vorgabe ist 0644. Alle Indexdateien werden ohne Beachtung von umask auf diese Rechte gesetzt.
es: Define el modo de todos los ficheros de índice creados. El valor predeterminado es 0644. Todos los ficheros de índice se ajustan a este modo sin tener en cuenta la máscara de usuario («umask»).

source: Sets if long descriptions should be included in the Packages file or split out into a master Translation-en file.
de: Gesetzt, falls lange Beschreibungen in die Package-Datei eingeschlossen werden oder in eine Translation-en-Hauptdatei unterteilt werden sollen.
es: Define si se deben incluir las descripciones largas en el fichero «Packages», o si se deben separar, guardándolo en el fichero «Translation-en».

source: TreeDefault Section
de: TreeDefault-Abschnitt
es: Sección TreeDefault

source: Sets defaults specific to <literal>Tree</literal> sections. All of these variables are substitution variables and have the strings $(DIST), $(SECTION) and $(ARCH) replaced with their respective values.
de: Setzt Vorgaben speziell für <literal>Tree</literal>-Abschnitte. All diese Variablen sind Platzhaltervariablen und haben die Zeichenketten $(DIST), $(SECTION) und $(ARCH) durch ihre jeweiligen Werte ersetzt.
es: Define los valores predeterminados de las secciones <literal>Tree</literal>. Todas estas variables son variables de sustitución y reemplazan las cadenas $(DIST), $(SECTION) y $(ARCH) con sus valores respectivos.

source: Sets the number of kilobytes of contents files that are generated each day. The contents files are round-robined so that over several days they will all be rebuilt.
de: Setzt die Anzahl der Kilobytes der Inhaltdateien, die jeden Tag generiert werden. Die Inhaltdateien werden reihum ersetzt, so dass sie über mehrere Tage alle neu gebildet werden.
es: Define el número de kilobytes de los ficheros de contenido que se generan cada día. Los ficheros de contenido están en una cola «round-robin», de modo que durante varios días todos se regenerarán.

source: Controls the number of days a contents file is allowed to be checked without changing. If this limit is passed the mtime of the contents file is updated. This case can occur if the package file is changed in such a way that does not result in a new contents file [override edit for instance]. A hold off is allowed in hopes that new .debs will be installed, requiring a new file anyhow. The default is 10, the units are in days.
de: Steuert die Anzahl der Tage, die eine Inhaltsdatei erlaubt ist ohne Änderung geprüft zu werden. Wenn die Grenze überschritten ist, wird die mtime der Inhaltsdatei aktualisiert. Dieser Fall kann auftreten, wenn die Package-Datei auf einem Weg geändert wurde, der nicht in einer neuen Inhaltsdatei resultierte [überschreibendes Bearbeiten zum Beispiel]. Ein Aufhalten ist erlaubt, in der Hoffnung dass neue .debs installiert werden, die sowieso eine neue Datei benötigen. Die Vorgabe ist 10, die Einheiten sind Tage.
es: Controla el número de días en los que se permite comprobar un fichero de contenido sin cambios. Si este límite caduca, el tiempo de modificación (mtime) del fichero de contenido se actualiza. Este caso puede aparecer si un fichero de paquete cambia de forma que no resulte en un fichero de contenido nuevo (por ejemplo, una edición alternativa). Se permite la retención con la esperanza de que se instalen nuevos «.deb», lo cual precisa un fichero nuevo de todos modos. El valor predeterminado es diez, las unidades usadas son días.

source: Sets the top of the .deb directory tree. Defaults to <filename>$(DIST)/$(SECTION)/binary-$(ARCH)/</filename>
de: Setzt den Beginn des .deb-Verzeichnisbaumes. Vorgabe ist <filename>$(DIST)/$(SECTION)/binary-$(ARCH)/</filename>
es: Define la raíz del directorio «.deb». El valor predeterminado es <filename>$(DIST)/$(SECTION)/binary-$(ARCH)/</filename>

source: Sets the top of the source package directory tree. Defaults to <filename>$(DIST)/$(SECTION)/source/</filename>
de: Setzt den Beginn des Quellpaketverzeichnisbaumes. Vorgabe ist <filename>$(DIST)/$(SECTION)/source/</filename>
es: Define la raíz del directorio de los paquetes de fuentes. El valor predeterminado es <filename>$(DIST)/$(SECTION)/source/</filename>

source: Sets the output Packages file. Defaults to <filename>$(DIST)/$(SECTION)/binary-$(ARCH)/Packages</filename>
de: Setzt die Ausgabe-Packages-Datei. Vorgabe ist <filename>$(DIST)/$(SECTION)/binary-$(ARCH)/Packages</filename>
es: Define el fichero «Packages» de salida. El valor predeterminado es <filename>$(DIST)/$(SECTION)/binary-$(ARCH)/Packages</filename>

source: Sets the output Sources file. Defaults to <filename>$(DIST)/$(SECTION)/source/Sources</filename>
de: Setzt die Ausgabe-Quelldatei. Vorgabe ist <filename>$(DIST)/$(SECTION)/source/Sources</filename>
es: Define el fichero «Sources» de salida. El valor predeterminado es <filename>$(DIST)/$(SECTION)/source/Sources</filename>

source: Translation
de: Übersetzung

source: Set the output Translation-en master file with the long descriptions if they should be not included in the Packages file. Defaults to <filename>$(DIST)/$(SECTION)/i18n/Translation-en</filename>
de: Setzt die Ausgabe der Translation-en-Hauptdatei mit den langen Beschreibungen falls Sie nicht in der Packages-Datei enthalten sind. Vorgabe ist <filename>$(DIST)/$(SECTION)/i18n/Translation-en</filename>.
es: Define el fichero maestro «Translation-en» que contiene las descripciones maestras en el caso de que no se deban incluir en el fichero «Packages». El valor predeterminado es <filename>$(DIST)/$(SECTION)/i18n/Translation-en</filename>

source: Sets the path prefix that causes a symlink to be considered an internal link instead of an external link. Defaults to <filename>$(DIST)/$(SECTION)/</filename>
de: Setzt die Pfad-Präfix, die bewirkt, dass ein symbolischer Verweis wie ein interner anstatt wie ein externer Verweis behandelt wird. Vorgabe ist <filename>$(DIST)/$(SECTION)/</filename>
es: Define el prefijo de la ruta que hace que un enlace simbólico se considere un enlace interno en lugar de un enlace externo. El valor predeterminado es <filename>$(DIST)/$(SECTION)/</filename>

source: Sets the output Contents file. Defaults to <filename>$(DIST)/Contents-$(ARCH)</filename>. If this setting causes multiple Packages files to map onto a single Contents file (such as the default) then <command>apt-ftparchive</command> will integrate those package files together automatically.
de: Setzt die Ausgabe-Contens-Datei. Vorgabe ist <filename>$(DIST)/Contents-$(ARCH)</filename>. Wenn diese Einstellung bewirkt, dass mehrere Packages-Dateien auf einer einzelnen Inhaltsdatei abgebildet werden (so wie es Vorgabe ist), dann wird <command>apt-ftparchive</command> diese Dateien automatisch integrieren.
es: Define el fichero «Contents» de salida. El valor predeterminado es <filename>$(DIST)/Contents-$(ARCH)</filename>. Si este valor causa que varios ficheros «Packages» se relacionen en un único fichero «Contents» (el comportamiento predeterminado), <command>apt-ftparchive</command> integrará automáticamente esos ficheros de paquete juntos.

source: Sets header file to prepend to the contents output.
de: Setzt die Kopfdatendatei, um sie der Inhaltsausgabe voranzustellen.
es: Define el fichero de cabecera a añadir al fichero «Contents» de salida.

source: Sets the binary cache database to use for this section. Multiple sections can share the same database.
de: Setzt die Programmzwischenspeicherdatenbank zur Benutzung in diesem Abschnitt. Mehrere Abschnitte können sich die gleiche Datenbank teilen.
es: Define la base de datos binaria de la caché para usar en esta sección. Varias secciones pueden compartir la misma base de datos.

source: Specifies that instead of walking the directory tree, <command>apt-ftparchive</command> should read the list of files from the given file. Relative files names are prefixed with the archive directory.
de: Gibt an, dass <command>apt-ftparchive</command> die Liste der Dateien aus der vorgegebenen Datei liest, anstatt den Verzeichnisbaum zu durchlaufen. Relativen Dateinamen wird das Archivverzeichnis vorangestellt.
es: Define que <command>apt-ftparchive</command> debería leer la lista de ficheros del fichero proporcionado en lugar de explorar recursivamente el árbol de directorios. A los nombres de los ficheros relativos se les añade como prefijo el directorio del archivo.

source: Specifies that instead of walking the directory tree, <command>apt-ftparchive</command> should read the list of files from the given file. Relative files names are prefixed with the archive directory. This is used when processing source indexes.
de: Gibt an, dass <command>apt-ftparchive</command> die Liste der Dateien aus der vorgegebenen Datei liest, anstatt den Verzeichnisbaum zu durchlaufen. Relativen Dateinamen wird das Archivverzeichnis vorangestellt. Dies wird benutzt, wenn Quellindizes verarbeitet werden.
es: Define que <command>apt-ftparchive</command> debería leer la lista de ficheros del fichero proporcionado en lugar de explorar recursivamente el árbol de directorio. A los nombres de los ficheros relativos se les añade como prefijo el directorio del archivo. Sólo se usa cuando se procesan índices de fuentes.

source: Tree Section
de: Tree-Abschnitt
es: Sección Tree

source: The <literal>Tree</literal> section defines a standard Debian file tree which consists of a base directory, then multiple sections in that base directory and finally multiple Architectures in each section. The exact pathing used is defined by the <literal>Directory</literal> substitution variable.
de: Der <literal>Tree</literal>-Abschnitt definiert einen Standard-Debian-Dateibaum, der aus einem Basisverzeichnis, dann mehreren Abschnitten in diesem Basisverzeichnis und am Ende, mehreren Architekturen in jedem Abschnitt besteht. Die genaue benutzte Pfadeinstellung ist durch die <literal>Directory</literal>-Ersetzungsvariable definiert.
es: La sección <literal>Tree</literal> define un árbol de un archivo de paquetes Debian estándar que consiste en un directorio base, varias secciones en ese directorio base y finalmente varias arquitecturas en cada sección. La ruta exacta usada se define en la variable de sustitución <literal>Directory</literal>.

source: The <literal>Tree</literal> section takes a scope tag which sets the <literal>$(DIST)</literal> variable and defines the root of the tree (the path is prefixed by <literal>ArchiveDir</literal>). Typically this is a setting such as <filename>dists/&stable-codename;</filename>.
de: Der <literal>Tree</literal>-Abschnitt nimmt eine scope-Markierung, die die <literal>$(DIST)</literal>-Variable setzt und die Wurzel des Baumes definiert (der Pfad hat den Präfix von <literal>ArchiveDir</literal>). Typischerweise ist dies eine Einstellung wie <filename>dists/&stable-codename;</filename>.
es: La sección <literal>Tree</literal> toma un ámbito de una etiqueta que define la variable <literal>$(DIST)</literal> y la raíz del árbol (a la ruta se le añade el prefijo <literal>ArchiveDir</literal>). Normalmente esto es un valor como <filename>dists/&stable-codename;</filename>.
