Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: Do not consider recommended packages as a dependency for installing. Configuration Item: <literal>APT::Install-Recommends</literal>.
de: Empfohlene Pakete nicht als Abhängigkeit für die Installation betrachten. Konfigurationselement: <literal>APT::Install-Recommends</literal>.
es: No considera los paquetes recomendados como dependencia al instalar. Opción de configuración: <literal>APT::Install-Recommends</literal>.

source: Consider suggested packages as a dependency for installing. Configuration Item: <literal>APT::Install-Suggests</literal>.
de: Empfohlene Pakete als Abhängigkeit für die Installation betrachten. Konfigurationselement: <literal>APT::Install-Suggests</literal>.

source: Download only; package files are only retrieved, not unpacked or installed. Configuration Item: <literal>APT::Get::Download-Only</literal>.
de: Nur herunterladen; Paketdateien werden nur heruntergeladen, nicht entpackt oder installiert. Konfigurationselement: <literal>APT::Get::Download-Only</literal>.
es: Sólo descarga los ficheros de los paquetes, no los desempaqueta ni los instala. Opción de configuración: <literal>APT::Get::Download-Only</literal>.

source: Fix; attempt to correct a system with broken dependencies in place. This option, when used with install/remove, can omit any packages to permit APT to deduce a likely solution. If packages are specified, these have to completely correct the problem. The option is sometimes necessary when running APT for the first time; APT itself does not allow broken package dependencies to exist on a system. It is possible that a system's dependency structure can be so corrupt as to require manual intervention (which usually means using &dselect; or <command>dpkg --remove</command> to eliminate some of the offending packages). Use of this option together with <option>-m</option> may produce an error in some situations. Configuration Item: <literal>APT::Get::Fix-Broken</literal>.
de: Beheben; Versucht ein System von vorhandenen beschädigten Abhängigkeiten zu korrigieren. Diese Option kann, wenn sie mit »install«/»remove« benutzt wird, einige Pakete weglassen, um es APT zu erlauben, eine wahrscheinliche Lösung herzuleiten. Falls Pakete angegeben wurden, müssen diese das Problem vollständig korrigieren. Die Option ist manchmal nötig, wenn APT zum ersten Mal ausgeführt wird. APT selbst erlaubt es nicht, dass auf einen System beschädigte Paketabhängigkeiten existieren. Es ist möglich, dass eine Abhängigkeitsstruktur eines Systems so fehlerhaft ist, dass ein manuelles Eingreifen erforderlich ist (was normalerweise bedeutet, dass &dselect; oder <command>dpkg --remove</command> benutzt wird, um einige der fehlerhaften Pakete zu beseitigen). Wenn Sie die Option zusammen mit <option>-m</option> benutzen, könnte das in einigen Situationen zu Fehlern führen. Konfigurationselement: <literal>APT::Get::Fix-Broken</literal>.
es: Intenta arreglar un sistema con dependencias actualmente rotas. Si se usa esta opción junto a «install»/«remove» se puede omitir cualquier paquete para permitir a APT deducir una posible solución. Si se especifican problemas, deben corregir totalmente el problema. La opción, a veces, se necesita cuando se ejecuta APT por primera vez, APT no permite que existan dependencias de paquetes rotas en un sistema. Es posible que la estructura de dependencias de un sistema esté tan deteriorada que requiera una intervención manual (generalmente puede ejecutar &dselect; o <command>dpkg --remove</command> para desinstalar alguno de los paquetes que crean el conflicto). El uso de esta opción junto con <option>-m</option> puede producir un error en algunas situaciones. Opción de configuración: <literal>APT::Get::Fix-Broken</literal>.

source: Ignore missing packages; If packages cannot be retrieved or fail the integrity check after retrieval (corrupted package files), hold back those packages and handle the result. Use of this option together with <option>-f</option> may produce an error in some situations. If a package is selected for installation (particularly if it is mentioned on the command line) and it could not be downloaded then it will be silently held back. Configuration Item: <literal>APT::Get::Fix-Missing</literal>.
de: Fehlende Pakete ignorieren; Wenn Pakete nicht heruntergeladen werden können oder die Integritätsprüfung nach dem Herunterladen fehlschlägt (fehlerhafte Paketdateien), werden diese Pakete zurückgehalten und das Ergebnis verarbeitet. Die Benutzung dieser Option zusammen mit <option>-f</option> kann in einigen Situationen zu Fehlern führen. Wenn ein Paket zur Installation ausgewählt ist (besonders, wenn es auf der Befehlszeile genannt wurde) und es nicht heruntergeladen werden kann, wird es stillschweigend zurückgehalten. Konfigurationselement: <literal>APT::Get::Fix-Missing</literal>.
es: No tiene en cuenta los paquetes que no se hayan podido descargar o que después de la descarga se encuentren dañados (ficheros de paquete corruptos), estos paquetes se retienen y se continúa con el resto. Usar esta opción junto con <option>-f</option> puede producir un error en algunas situaciones. Si un paquete se selecciona para su instalación (particularmente si se hace mediante la línea de órdenes) y no se puede descargar, se le retendrá silenciosamente. Opción de configuración: <literal>APT::Get::Fix-Missing</literal>.

source: Disables downloading of packages. This is best used with <option>--ignore-missing</option> to force APT to use only the .debs it has already downloaded. Configuration Item: <literal>APT::Get::Download</literal>.
de: Schaltet das Herunterladen von Paketen aus. Dies wird am besten mit <option>--ignore-missing</option> benutzt, um APT zu zwingen, nur die .debs zu benutzten, die es bereits heruntergeladenen hat. Konfigurationselement: <literal>APT::Get::Download</literal>.
es: Deshabilita la descarga de paquetes. Usada junto con <option>--ignore-missing</option> ofrece la mejor manera de forzar a APT a usar sólo los ficheros «.deb» descargados con anterioridad. Opción de configuración: <literal>APT::Get::Download</literal>.

source: Quiet; produces output suitable for logging, omitting progress indicators. More q's will produce more quiet up to a maximum of 2. You can also use <option>-q=#</option> to set the quiet level, overriding the configuration file. Note that quiet level 2 implies <option>-y</option>, you should never use -qq without a no-action modifier such as -d, --print-uris or -s as APT may decided to do something you did not expect. Configuration Item: <literal>quiet</literal>.
de: Still; erzeugt eine Ausgabe, die für Protokollierung geeignet ist und Fortschrittsanzeiger weglässt. Mehr »q«s unterdrücken mehr Ausgaben, bis zu einem Maximum von 2. Sie können außerdem <option>-q=#</option> benutzen, um die Stillestufe zu setzen, was die Konfigurationsdatei überschreibt. Beachten Sie, dass Stillestufe 2 <option>-y</option> impliziert. Sie sollten niemals -qq ohne einen keine-Aktion-Umwandler, wie -d, --print-uris oder -s benutzen, da APT entscheiden könnte, etwas zu tun, das Sie nicht erwarten. Konfigurationselement: <literal>quiet</literal>.
es: Produce una salida adecuada para su registro, omitiendo los indicadores de progreso. Si se especifican más «q» (hasta un máximo de 2) se conseguirá una salida más silenciosa. También es posible usar <option>-q=#</option> para seleccionar el nivel de silencio, omitiendo el fichero de configuración. Tenga en cuenta que un nivel silencioso de 2 implica <option>-y</option>, por lo tanto nunca se deberá usar «-qq» sin añadir un modificador para que no realice ninguna acción como «-d», «--print-uris» o «-s» para evitar que APT realice algo que usted no espera. Opción de configuración: <literal>quiet</literal>.

source: No action; perform a simulation of events that would occur but do not actually change the system. Configuration Item: <literal>APT::Get::Simulate</literal>.
de: Keine Aktion; führt eine Simulation von Ereignissen aus, die eintreten würden, aber das aktuelle System nicht verändern. Konfigurationselement: <literal>APT::Get::Simulate</literal>.
es: No realiza ninguna acción, simula lo que hubiese ocurrido pero sin hacer cambios reales en el sistema. Opción de configuración: <literal>APT::Get::Simulate</literal>.

source: Simulation run as user will deactivate locking (<literal>Debug::NoLocking</literal>) automatic. Also a notice will be displayed indicating that this is only a simulation, if the option <literal>APT::Get::Show-User-Simulation-Note</literal> is set (Default: true). Neither NoLocking nor the notice will be triggered if run as root (root should know what he is doing without further warnings by <literal>apt-get</literal>).
de: Ausführung der Simulation als normaler Anwender wird das Sperren (<literal>Debug::NoLocking</literal>) automatisch deaktivieren. Außerdem wird eine Mitteilung angezeigt, die angibt, dass dies nur eine Simulation ist, wenn die Option <literal>APT::Get::Show-User-Simulation-Note</literal> gesetzt ist (Vorgabe ist »true«). Weder NoLocking noch die Mitteilung werden ausgelöst, wenn es als root ausgeführt wird (root sollte ohne weitere Warnungen von <literal>apt-get</literal> wissen, was er tut).
es: Si la simulación se ejecuta como usuario desactivará el bloqueo automático (<literal>Debug::NoLocking</literal>). Si la opción <literal>APT::Get::Show-User-Simulation-Note</literal> está activada (activa de forma predeterminada) se mostrará un mensaje indicando que sólo es una simulación. Ni se realizará «NoLocking» ni se mostrará el mensaje si se ejecuta como administrador («root»), ya que debería saber lo qué está haciendo sin más avisos de <literal>apt-get</literal>).

source: Simulate prints out a series of lines each one representing a dpkg operation, Configure (Conf), Remove (Remv), Unpack (Inst). Square brackets indicate broken packages and empty set of square brackets meaning breaks that are of no consequence (rare).
de: Simulieren gibt eine Serie von Zeilen aus, von denen jede eine Dpkg-Operation darstellt: Konfigurieren (Conf), Entfernen (Remv), Entpacken (Inst). Eckige Klammern zeigen beschädigte Pakete an und ein leeres Paar eckiger Klammern bedeutet Unterbrechungen, die keine Folgen haben (selten).
es: La simulación muestra en la pantalla una serie de líneas, cada una de las cuales representa una operación de dpkg, configurar (Conf), desinstalar (Remv), o desempaquetar (Inst). Un par de corchetes indican paquetes con dependencias rotas, si no hay nada entre ellos significa que no hay ningún problema (poco probable).

source: Automatic yes to prompts; assume "yes" as answer to all prompts and run non-interactively. If an undesirable situation, such as changing a held package, trying to install a unauthenticated package or removing an essential package occurs then <literal>apt-get</literal> will abort. Configuration Item: <literal>APT::Get::Assume-Yes</literal>.
de: Automatisches »Ja« auf Anfragen; Versucht »Ja« auf alle Anfragen zu antworten und ohne Eingaben zu laufen. Wenn eine unerwünschte Situation eintritt, wie ein gehaltenes Paket zu ändern, ein nicht authentifiziert Paket zu installieren oder ein essentielles Paket zu entfernen, dann wird <literal>apt-get</literal> abgebrochen. Konfigurationselement: <literal>APT::Get::Assume-Yes</literal>.
es: Supone una respuesta afirmativa a todas las preguntas, de esta forma apt-get se ejecuta sin necesidad de intervención posterior para tomar decisiones. <literal>apt-get</literal> terminará sin hacer nada de producirse una situación no deseada, como cambiar un paquete retenido, instalar un paquete sin autenticar o desinstalar un paquete esencial. Opción de configuración: <literal>APT::Get::Assume-Yes</literal>.

source: Show upgraded packages; Print out a list of all packages that are to be upgraded. Configuration Item: <literal>APT::Get::Show-Upgraded</literal>.
de: Zeigt Pakete, von denen ein Upgrade durchgeführt werden soll; Gibt eine Liste aller Pakete aus, von denen ein Upgrade gemacht wurde. Konfigurationselement: <literal>APT::Get::Show-Upgraded</literal>.
es: Muestra los paquetes que se van a actualizar. Opción de configuración: <literal>APT::Get::Show-Upgraded</literal>.

source: Show full versions for upgraded and installed packages. Configuration Item: <literal>APT::Get::Show-Versions</literal>.
de: Zeigt vollständige Versionen für Pakete, von denen ein Upgrade durchgeführt oder die installiert wurden. Konfigurationselement: <literal>APT::Get::Show-Versions</literal>.
es: Muestra las versiones completas para los paquetes actualizados e instalados. Opción de configuración: <literal>APT::Get::Show-Versions</literal>.

source: Compile source packages after downloading them. Configuration Item: <literal>APT::Get::Compile</literal>.
de: Kompiliert Quellpakete, nachdem sie heruntergeladen wurden. Konfigurationselement: <literal>APT::Get::Compile</literal>.
es: Descarga los paquetes fuente y luego los compila. Opción de configuración: <literal>APT::Get::Compile</literal>.

source: Ignore package Holds; This causes <command>apt-get</command> to ignore a hold placed on a package. This may be useful in conjunction with <literal>dist-upgrade</literal> to override a large number of undesired holds. Configuration Item: <literal>APT::Ignore-Hold</literal>.
de: Ignoriert zurückhalten des Paketes; Dies veranlasst <command>apt-get</command>, ein für das Paket gesetztes »Halten« zu ignorieren. Dies kann zusammen mit <literal>dist-upgrade</literal> nützlich sein, um eine große Anzahl ungewünschter »Halten« zu überschreiben. Konfigurationselement: <literal>APT::Ignore-Hold</literal>.
es: Ignora los paquetes retenidos. Esto hace que <command>apt-get</command> ignore toda retención impuesta a un paquete. Esto puede ser útil junto a <literal>dist-upgrade</literal> para invalidar un gran número de paquetes retenidos de manera no deseada. Opción de configuración: <literal>APT::Ignore-Hold</literal>.

source: Do not upgrade packages; When used in conjunction with <literal>install</literal>, <literal>no-upgrade</literal> will prevent packages on the command line from being upgraded if they are already installed. Configuration Item: <literal>APT::Get::Upgrade</literal>.
de: Kein Upgrade von Paketen durchführen; Wenn es zusammen mit <literal>install</literal> benutzt wird, wird <literal>no-upgrade</literal> auf der Befehlszeile ein Upgrade von Paketen verhindern, wenn sie bereits installiert sind. Konfigurationselement: <literal>APT::Get::Upgrade</literal>.
es: No actualiza los paquetes. Cuando se usa junto a <literal>install</literal>, <literal>no-upgrade</literal> evita que se actualicen los paquetes listados en la línea de órdenes si ya están instalados. Opción de configuración: <literal>APT::Get::Upgrade</literal>.

source: Do not install new packages; When used in conjunction with <literal>install</literal>, <literal>only-upgrade</literal> will prevent packages on the command line from being upgraded if they are not already installed. Configuration Item: <literal>APT::Get::Only-Upgrade</literal>.
de: Kein Upgrade von Paketen durchführen; Wenn es zusammen mit <literal>install</literal> benutzt wird, wird <literal>only-upgrade</literal> auf der Befehlszeile ein Upgrade von Paketen verhindern, wenn sie bereits installiert sind. Konfigurationselement: <literal>APT::Get::Only-Upgrade</literal>.
es: No instala paquetes nuevos. Cuando se usa junto a <literal>install</literal>, <literal>only-upgrade</literal> evita que se actualicen los paquetes listados en la línea de órdenes si no están ya instalados. Opción de configuración: <literal>APT::Get::Only-Upgrade</literal>.

source: Force yes; This is a dangerous option that will cause apt to continue without prompting if it is doing something potentially harmful. It should not be used except in very special situations. Using <literal>force-yes</literal> can potentially destroy your system! Configuration Item: <literal>APT::Get::force-yes</literal>.
de: »Ja« erzwingen; Dies ist eine gefährliche Option, die APT veranlasst, ohne Nachfrage fortzufahren, wenn es etwas möglicherweise schädliches tut. Es sollte nicht benutzt werden, außer in ganz besonderen Situationen. <literal>force-yes</literal> zu benutzen, kann möglicherweise ihr System zerstören! Konfigurationselement: <literal>APT::Get::force-yes</literal>.
es: Supone una respuesta afirmativa a todas las preguntas. Ésta es una opción peligrosa que hará que apt continúe sin preguntar incluso si se va a realizar algo potencialmente peligroso. No se debe usar excepto en situaciones muy especiales. ¡Usar <literal>force-yes</literal> puede destruir su sistema! Opción de configuración: <literal>APT::Get::force-yes</literal>.

source: Instead of fetching the files to install their URIs are printed. Each URI will have the path, the destination file name, the size and the expected md5 hash. Note that the file name to write to will not always match the file name on the remote site! This also works with the <literal>source</literal> and <literal>update</literal> commands. When used with the <literal>update</literal> command the MD5 and size are not included, and it is up to the user to decompress any compressed files. Configuration Item: <literal>APT::Get::Print-URIs</literal>.
de: Anstatt die Dateien herunterzuladen, werden ihre URIs ausgegeben. Jede URI wird den Pfad, den Zieldateinamen, die Größe und den erwarteten md5-Hash enthalten. Beachten Sie, dass der zu schreibende Dateiname nicht immer dem Dateinamen auf der entfernt gelegenen Seite entspricht. Dies funktioniert auch mit den Befehlen <literal>source</literal> und <literal>update</literal>. Wenn es mit dem Befehl <literal>update</literal> benutzt wird, sind MD5 und Größe nicht enthalten und es ist Aufgabe des Benutzers, komprimierte Dateien zu dekomprimieren. Konfigurationselement: <literal>APT::Get::Print-URIs</literal>.
es: Muestra las URI de los ficheros a instalar en vez de descargarlos. Cada URI contiene la dirección de dónde se obtendrá el paquete, el fichero de destino, su tamaño y el resumen MD5 esperado. Tenga en cuenta que el nombre de fichero no siempre coincide con el nombre del fichero en el sitio remoto. Esto también funciona con las órdenes <literal>source</literal> y <literal>update</literal>. Cuando se usa con la orden <literal>update</literal> no se incluyen ni el resumen MD5 ni el tamaño, y es tarea del usuario descomprimir cualquier fichero comprimido. Opción de configuración: <literal>APT::Get::Print-URIs</literal>.

source: Use purge instead of remove for anything that would be removed. An asterisk ("*") will be displayed next to packages which are scheduled to be purged. <option>remove --purge</option> is equivalent to the <option>purge</option> command. Configuration Item: <literal>APT::Get::Purge</literal>.
de: »purge« anstelle von »remove« für alles zu entfernende benutzen. Ein Stern (»*«) wird bei Paketen angezeigt, die zum vollständigen Entfernen vorgemerkt sind. <option>remove --purge</option> entspricht dem Befehl <option>purge</option>. Konfigurationselement: <literal>APT::Get::Purge</literal>.
es: Usa «purge» (purgar) en lugar de «remove» para todo aquello que se desinstale. Un asterisco («*») aparecerá a continuación de los paquetes que se vayan a purgar. <option>remove --purge</option> es equivalente a la orden <option>purge</option>. Opción de configuración: <literal>APT::Get::Purge</literal>.

source: Re-Install packages that are already installed and at the newest version. Configuration Item: <literal>APT::Get::ReInstall</literal>.
de: Paket erneut installieren, die bereits installiert und in der neuesten Version sind. Konfigurationselement: <literal>APT::Get::ReInstall</literal>.
es: Reinstala los paquetes ya instalados, incluso si son la última versión disponible del paquete. Opción de configuración: <literal>APT::Get::ReInstall</literal>.

source: This option defaults to on, use <literal>--no-list-cleanup</literal> to turn it off. When on <command>apt-get</command> will automatically manage the contents of <filename>&statedir;/lists</filename> to ensure that obsolete files are erased. The only reason to turn it off is if you frequently change your source list. Configuration Item: <literal>APT::Get::List-Cleanup</literal>.
de: Diese Option ist standardmäßig eingeschaltet. Um sie auszuschalten, benutzen Sie <literal>--no-list-cleanup</literal>. Wenn eingeschaltet, wird <command>apt-get</command> den Inhalt von <filename>&statedir;/lists</filename> automatisch verwalten, um sicherzustellen, dass veraltete Dateien gelöscht werden. Nur das häufige Ändern der Quelllisten stellt den einzigen Grund zum Ausschalten der Option dar. Konfigurationselement: <literal>APT::Get::List-Cleanup</literal>.
es: Esta opción está activada de forma predeterminada, si quiere desactivarla use <literal>--no-list-cleanup</literal>. Cuando está activada <command>apt-get</command> administrará automáticamente los contenidos de <filename>&statedir;/lists</filename> para asegurarse de que se borran los ficheros obsoletos. La única razón para desactivarla es si realiza frecuentemente cambios en la lista de fuentes. Opción de configuración: <literal>APT::Get::List-Cleanup</literal>.

source: This option controls the default input to the policy engine, it creates a default pin at priority 990 using the specified release string. This overrides the general settings in <filename>/etc/apt/preferences</filename>. Specifically pinned packages are not affected by the value of this option. In short, this option lets you have simple control over which distribution packages will be retrieved from. Some common examples might be <option>-t '2.1*'</option>, <option>-t unstable</option> or <option>-t sid</option>. Configuration Item: <literal>APT::Default-Release</literal>; see also the &apt-preferences; manual page.
de: Diese Option steuert die standardmäßige Eingabe an die Einheit zur Durchsetzung der Richtlinien (»policy«), sie erstellt eine Vorgabe-Pin mit Priorität 990 unter Benutzung der angegebenen Release-Zeichenkette. Dies überschreibt die allgemeinen Einstellungen in <filename>/etc/apt/preferences</filename>. Pakete mit speziellem Pinning sind nicht vom Wert dieser Option betroffen. Kurz gesagt, gibt Ihnen diese Option einfache Kontrolle darüber, welche Distributions-Pakete heruntergeladen werden sollen. Einige typische Beispiele könnten <option>-t '2.1*'</option>, <option>-t unstable</option> oder <option>-t sid</option> sein. Konfigurationselement: <literal>APT::Default-Release</literal>; Lesen Sie auch die &apt-preferences;-Handbuchseite.
es: Esta opción controla la entrada predeterminada del motor de directrices, creando un anclaje («pin») con una prioridad 990 usando la cadena de caracteres de la distribución especificada. Esto invalida la configuración general de <filename>/etc/apt/preferences</filename>. Aquellos paquetes con un anclaje específico no se verán afectados por el valor de esta opción. Resumiendo, esta opción le da control sobre la distribución de la que se obtienen los paquetes. Algunos ejemplos comunes pueden ser <option>-t '2.1*'</option> o <option>-t unstable</option> o <option>-t sid</option>. Opción de configuración: <literal>APT::Default-Release</literal>. Vea también la página del manual de &apt-preferences;.
