Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: Whenever the whole system is being upgraded there is the possibility that new versions of packages cannot be installed because they require new things or conflict with already installed things. In this case the package will appear in the Kept Back list. The best way to convince packages listed there to install is with <tt>apt-get install</tt> or by using <prgn>dselect</prgn> to resolve their problems.
de: Jedesmal, wenn ein Upgrade des ganzen Systems durchgeführt wird, besteht die Möglichkeit, dass neue Versionen von Paketen nicht installiert werden können, weil sie neue Dinge benötigen oder einen Konflikt mit bereits installierten Dingen haben. In diesem Fall wird das Paket auf der Liste zurückgehaltener Pakete erscheinen. Der beste Weg dort aufgeführte Pakete zur Installation zu bewegen, ist per <tt>apt-get install</tt> oder indem <prgn>dselect</prgn> zum Lösen ihrer Probleme benutzt wird.
es: Puede que al actualizar el sistema por completo no se puedan instalar versiones nuevas de paquetes porque requieren nuevos elementos que entran en conflicto con paquetes ya instalados. En este caso, el paquete aparecerá en la lista de paquetes retenidos. La mejor manera de instalar paquetes listados aquí es mediante <tt>apt-get install</tt> o mediante <prgn>dselect</prgn> para así resolver esos problemas.

source: Held Packages warning
de: Warnung wegen zurückgehaltener Pakete
es: Advertencia de paquetes retenidos

source: The following held packages will be changed: cvs
de: Die folgenden zurückgehaltenen Pakete werden geändert: cvs
es: Se cambiarán los siguientes paquetes retenidos: cvs

source: Sometimes you can ask APT to install a package that is on hold, in such a case it prints out a warning that the held package is going to be changed. This should only happen during dist-upgrade or install.
de: Manchmal können Sie APT bitten, ein auf »zurückgehalten« gesetztes Paket zu installieren. In einem solchen Fall gibt es eine Warnung aus, dass das zurückgehaltene Paket geändert wird. Dies sollte nur während »Dist-upgrade« oder »Install« vorkommen.
es: Puede que a veces ordene a APT que instale un paquete retenido, en cuyo caso verá una advertencia de que el paquete retenido se va a modificar. Esto sólo debería ocurrir durante un «dist-upgrade» o un «install».

source: Final summary
de: Abschließende Zusammenfassung
es: Resumen final

source: Finally, APT will print out a summary of all the changes that will occur.
de: Abschließend wird APT eine Zusammenfassung aller Änderungen ausgeben, die auftreten werden.
es: Por último, APT mostrará un resumen de los cambios que se llevarán a cabo.

source: 206 packages upgraded, 8 newly installed, 23 to remove and 51 not upgraded. 12 packages not fully installed or removed. Need to get 65.7M/66.7M of archives. After unpacking 26.5M will be used.
de: 206 Pakete aktualisiert, 8 zusätzlich installiert, 23 werden entfernt und 51 nicht aktualisiert. 12 Pakete nicht vollständig installiert oder entfernt. Muss 65,7MB/66,7MB an Archiven herunterladen. Nach dem Entpacken werden 26,5MB zusätzlich belegt sein.
es: 206 paquetes actualizados, 8 se instalarán, 23 para eliminar y 51 no actualizados. 12 paquetes no instalados del todo o eliminados. Se necesita descargar 65.7M/66.7M de archivos. Se usarán 26.5M después de desempaquetar.

source: The first line of the summary simply is a reduced version of all of the lists and includes the number of upgrades - that is packages already installed that have new versions available. The second line indicates the number of poorly configured packages, possibly the result of an aborted installation. The final line shows the space requirements that the installation needs. The first pair of numbers refer to the size of the archive files. The first number indicates the number of bytes that must be fetched from remote locations and the second indicates the total size of all the archives required. The next number indicates the size difference between the presently installed packages and the newly installed packages. It is roughly equivalent to the space required in /usr after everything is done. If a large number of packages are being removed then the value may indicate the amount of space that will be freed.
de: Die erste Zeile der Zusammenfassung ist bloß eine Zusammenfassung von all den Listen und umfasst die Anzahl der Upgrades – das sind bereits installierte Pakete, für die neue Versionen verfügbar sind. Die zweite Zeile zeigt die Anzahl von schlecht konfigurierten Paketen, die möglicherweise das Ergebnis einer abgebrochenen Installation sind. Die letzt Zeile zeigt den Speicherbedarf, den die Installation benötigt. Das erste Zahlenpaar bezieht sich auf die Größe der Archivdateien. Die erste Zahl zeigt die Anzahl der Bytes an, die von fernen Orten heruntergeladen werden müssen und die zweite zeigt die gesamte Größe aller benötigten Archive an. Die nächste Zahl zeigt den Größenunterschied zwischen den derzeit installierten Paketen und den neu installierten Paketen. Es entspricht ungefähr dem in /usr benötigten Speicher nachdem alles erledigt ist. Wenn eine große Anzahl Pakete entfernt wird, dann kann der Wert den Betrag des freiwerdenden Speichers anzeigen.
es: La primera línea del resumen es simplemente una versión reducida de todas las listas e incluye el número de actualizaciones, esto es, paquetes ya instalados y de los cuales existen versiones nuevas disponibles. La segunda línea indica el número de paquetes mal configurados, posiblemente el resultado de una instalación interrumpida. La última línea muestra los requerimientos de espacio para la instalación. El primer par de números indican el tamaño de los ficheros del archivo. El primer número indica el número de bytes que se tienen que obtener de ubicaciones remotas, y el segundo indica el tamaño total de todos los archivos requeridos. El siguiente número indica la diferencia de tamaño entre los paquetes instalados y los paquetes nuevos a instalar. Básicamente equivale al espacio requerido en «/usr» al finalizar el proceso. En caso de existir varios paquetes a eliminar el valor puede indicar la cantidad de espacio que se va a liberar.

source: Some other reports can be generated by using the -u option to show packages to upgrade, they are similar to the previous examples.
de: Einige andere Berichte können durch Benutzung der Option »-u« generiert werden, um Pakete anzuzeigen, von denen ein Upgrade durchgeführt werden soll. Dies ist den vorherigen Beispielen ähnlich.
es: Puede generar otros informes con la opción «-u» para mostrar los paquetes a actualizar, similar a los ejemplos anteriores.

source: The Status Display
de: Der Anzeigestatus
es: La pantalla de estado

source: During the download of archives and package files APT prints out a series of status messages.
de: Während des Herunterladens von Archiven und Paketdateien gibt APT eine Reihe von Statusmeldungen aus.
es: APT muestra una serie de mensajes de estado en el transcurso de descargar ficheros de paquete y archivo.

source: # apt-get update Get:1 http://ftp.de.debian.org/debian-non-US/ stable/non-US/ Packages Get:2 http://llug.sep.bnl.gov/debian/ testing/contrib Packages Hit http://llug.sep.bnl.gov/debian/ testing/main Packages Get:4 http://ftp.de.debian.org/debian-non-US/ unstable/binary-i386/ Packages Get:5 http://llug.sep.bnl.gov/debian/ testing/non-free Packages 11% [5 testing/non-free `Waiting for file' 0/32.1k 0%] 2203b/s 1m52s
de: # apt-get update Hole:1 http://ftp.de.debian.org/debian-non-US/ stable/non-US/ Packages Hole:2 http://llug.sep.bnl.gov/debian/ testing/contrib Packages Treffer http://llug.sep.bnl.gov/debian/ testing/main Packages Hole:4 http://ftp.de.debian.org/debian-non-US/ unstable/binary-i386/ Packages Hole:5 http://llug.sep.bnl.gov/debian/ testing/non-free Packages 11% [5 testing/non-free 'Warte auf Datei' 0/32.1k 0%] 2203b/s 1m52s
es: # apt-get update Des:1 http://ftp.de.debian.org/debian-non-US/ stable/non-US/ Packages Des:2 http://llug.sep.bnl.gov/debian/ testing/contrib Packages Obj http://llug.sep.bnl.gov/debian/ testing/main Packages Des:4 http://ftp.de.debian.org/debian-non-US/ unstable/binary-i386/ Packages es:5 http://llug.sep.bnl.gov/debian/ testing/non-free Packages 11% [5 testing/non-free Esperando las cabeceras 0/32.1k 0%] 2203b/s 1m52s

source: The lines starting with <em>Get</em> are printed out when APT begins to fetch a file while the last line indicates the progress of the download. The first percent value on the progress line indicates the total percent done of all files. Unfortunately since the size of the Package files is unknown <tt>apt-get update</tt> estimates the percent done which causes some inaccuracies.
de: Die Zeilen, die mit <em>Hole</em> beginnen, werden ausgegeben, wenn APT anfängt, eine Datei herunterzuladen, während die letzte Zeile den Fortschritt des Herunterladens anzeigt. Die erste Prozentzahl der Fortschrittszeile zeigt die gesamt erledigte Prozentzahl aller Dateien an. Unglücklicherweise schätzt <tt>apt-get update</tt> die erledigte Prozentzahl, da die Größe der Pakete unbekannt ist, was einige Ungenauigkeiten bewirkt.
es: Las líneas comenzando con <em>Des</em> aparecen cuando APT inicia la obtención de un fichero, mientras que la última línea indica el progreso de la descarga. El primer valor porcentual en la barra de progreso indica el porcentaje total de los ficheros ya descargados. Desafortunadamente, <tt>apt-get update</tt> desconoce el tamaño de los ficheros de paquete y por ello genera una estimación que puede ser inexacta.

source: The next section of the status line is repeated once for each download thread and indicates the operation being performed and some useful information about what is happening. Sometimes this section will simply read <em>Forking</em> which means the OS is loading the download module. The first word after the [ is the fetch number as shown on the history lines. The next word is the short form name of the object being downloaded. For archives it will contain the name of the package that is being fetched.
de: Der nächste Abschnitt der Statuszeile wird für jeden Download-Thread wiederholt und zeigt die durchgeführte Operation, sowie einige nützliche Informationen darüber an was geschieht. Manchmal wird dieser Abschnitt einfach nur <em>Forking</em> darstellen, was bedeutet, dass das Betriebssystem das Download-Modul am Laden ist. Das erste Wort nach dem »[« ist die Ladenummer, wie sie auf den Verlaufszeilen angezeigt wird. Das nächste Wort ist Name in Kurzform des Ojektes, das heruntergeladen wird. Für Archive wird es den Namen des Paketes enthalten, das heruntergeladen wird.
es: La siguiente sección de la línea de estado se repite por cada instancia de descarga e indica la operación realizada, así como información útil relativa a lo que está pasando. Puede que esta sección sólo muestre <em>Forking</em>, lo cual significa que el sistema operativo está cargando el módulo de descargas. La primera palabra después de «[» es el número de obtención tal y como se muestra en la línea del histórico. La siguiente palabra es la forma corta del nombre del objeto en descarga. Al conectarse con los archivos, contendrá el nombre del paquete obtenido.

source: Inside of the single quote is an informative string indicating the progress of the negotiation phase of the download. Typically it progresses from <em>Connecting</em> to <em>Waiting for file</em> to <em>Downloading</em> or <em>Resuming</em>. The final value is the number of bytes downloaded from the remote site. Once the download begins this is represented as <tt>102/10.2k</tt> indicating that 102 bytes have been fetched and 10.2 kilobytes is expected. The total size is always shown in 4 figure notation to preserve space. After the size display is a percent meter for the file itself. The second last element is the instantaneous average speed. This values is updated every 5 seconds and reflects the rate of data transfer for that period. Finally is shown the estimated transfer time. This is updated regularly and reflects the time to complete everything at the shown transfer rate.
de: Innerhalb von einzelnen Anführungszeichen folgt eine informative Zeichenkette, die den Fortschritt der Übertragungsphase des Downloads anzeigt. Normalerweise schreitet sie fort von <em>Verbinde</em> zu <em>Warte auf Datei</em> zu <em>Lade herunter</em> oder <em>Nehme wieder auf</em>. Der letzte Wert ist die Anzahl der von der fernen Site heruntergeladenen Bytes. Sobald der Download beginnt, zeigt sich dies wie <tt>102/10.2k</tt> was anzeigt, dass 102 Bytes heruntergeladen und 10,2 Kilobytes erwartet werden. Die Gesamtgröße wird immer in vierstelliger Schreibweise dargestellt, um Platz zu sparen. Nach der Größenanzeige ist eine Prozentangabe für die Datei selbst. Das zweitletzte Element ist die augenblickliche Fortschrittsgeschwindigkeit. Dieser Wert wird alle fünf Sekunden aktualisiert und spiegelt die Datenübertragungsgeschwindigkeit in dieser Periode wider. Am Ende wird die geschätzte Übertragungszeit angezeigt. Dies wird regelmäßig aktualisiert und spiegelt die Zeit zum Vervollständigen bei der angezeigten Datenübertragungsgeschwindigkeit wider.
es: Una cadena informativa aparecerá entre comillas simples indicando el progreso de la fase de negociación de la descarga. Generalmente progresa de <em>Conectando</em> a <em>Esperando fichero</em>, finalizando con <em>Descargando</em> o <em>Continuando</em>. El último valor es el número de bytes descargados desde el sitio remoto. Una vez que la descarga arranque se representará como <tt>102/10.2k</tt> indicando que ya se han obtenido 102 bytes y que se esperan 10.2 kilobytes. El tamaño total siempre aparece con la notación de la figura 4 para conservar espacio. A continuación aparece un medidor porcentual del fichero. El penúltimo elemento es la media instantánea de velocidad. Estos valores se actualizan cada 5 segundos y reflejan la tasa de descarga de datos de ese periodo. Por último puede ver el tiempo estimado para la transferencia. Esto se actualiza regularmente y refleja el tiempo restante para completar todo tal y como se ve en la tasa de transferencia visible.

source: The status display updates every half second to provide a constant feedback on the download progress while the Get lines scroll back whenever a new file is started. Since the status display is constantly updated it is unsuitable for logging to a file, use the <tt>-q</tt> option to remove the status display.
de: Die Statusanzeige aktualisiert sich alle halbe Sekunde, um eine gleichmäßige Rückmeldung über den Download-Fortschritt bereitzustellen, während die »Hole«-Zeilen bei jeder gestarteten neuen Datei zurückscrollen. Da die Statusanzeige ständig aktualisiert wird, ist sie für die Protokollierung in eine Datei ungeeignet. Benutzen Sie die Option <tt>-q</tt>, um die Statusanzeige zu entfernen.
es: La pantalla de estado se actualiza cada medio segundo para ofrecer una constante información del progreso de la descarga, mientras que las líneas «Des» se desplazan hacia atrás cuando se inicia la descarga de otro fichero. Ya que la pantalla de estado se actualiza constantemente carece de utilidad para su registro en un fichero. Puede usar la opción <tt>-q</tt> para omitir la pantalla de estado.

source: APT uses <prgn>dpkg</prgn> for installing the archives and will switch over to the <prgn>dpkg</prgn> interface once downloading is completed. <prgn>dpkg</prgn> will also ask a number of questions as it processes the packages and the packages themselves may also ask several questions. Before each question there is usually a description of what it is asking and the questions are too varied to discuss completely here.
de: APT benutzt <prgn>dpkg</prgn>, um die Archive zu installieren und wird zu der <prgn>dpkg</prgn>-Schnittstelle herüberschalten, sobald der Download vollständig ist. <prgn>dpkg</prgn> wird außerdem eine Reihe von Fragen stellen, während es die Pakete abarbeitet und die Pakete können auch mehrere Fragen stellen . Vor jeder Frage ist üblicherweise eine Beschreibung des Gefragten und die Fragen sind zu vielfältig, um sie vollständig hier zu besprechen.
es: APT usa <prgn>dpkg</prgn> para instalar ficheros, y pasará a interactuar con <prgn>dpkg</prgn> al finalizar la descarga. <prgn>dpkg</prgn> también planteará un número de preguntas a medida que procesa los paquetes, los cuales también pueden formular preguntas. A cada pregunta generalmente le precede una descripción de la pregunta en sí. Éstas son demasiado variadas como para poder tratarlas aquí en su totalidad.

source: Using APT Offline
de: APT offline verwenden
es: Usar APT Offline

source: $Id: offline.sgml,v 1.8 2003/02/12 15:06:41 doogie Exp $
de: $Id: offline.sgml,v 1.8 12.02.2003 15:06:41 doogie Exp $

source: This document describes how to use APT in a non-networked environment, specifically a 'sneaker-net' approach for performing upgrades.
de: Dieses Dokument beschreibt, wie APT in einer Umgebung ohne Netzwerk, speziell einem »Turnschuhnetzwerk«, an die Durchführung von Upgrades herangeht.
es: Este documento describe el uso de APT en un entorno sin conexión a red, específicamente una aproximación «sneaker-net» a la acción de actualizar.

source: Introduction
de: Einleitung
es: Introducción

source: Overview
de: Übersicht
es: Resumen

source: Normally APT requires direct access to a Debian archive, either from a local media or through a network. Another common complaint is that a Debian machine is on a slow link, such as a modem and another machine has a very fast connection but they are physically distant.
de: Normalerweise benötigt APT direkten Zugang zu einem Debian-Archiv, entweder von einem lokalen Medium oder über ein Netz. Eine andere häufige Beanstandung ist, dass eine Debian-Maschine an einer langsamen Anbindung, wie einem Modem, hängt und eine andere Maschine eine sehr schnelle Verbindung hat, sie jedoch physisch fern sind.
es: Generalmente, APT necesita un acceso directo a un archivo de Debian, bien desde un dispositivo local o a través de una red. Otra queja frecuente es que una máquina con un sistema Debian dispone de una conexión lenta como la de un módem, y otra máquina físicamente lejos dispone de una conexión muy rápida.

source: The solution to this is to use large removable media such as a Zip disc or a SuperDisk disc. These discs are not large enough to store the entire Debian archive but can easily fit a subset large enough for most users. The idea is to use APT to generate a list of packages that are required and then fetch them onto the disc using another machine with good connectivity. It is even possible to use another Debian machine with APT or to use a completely different OS and a download tool like wget. Let <em>remote host</em> mean the machine downloading the packages, and <em>target host</em> the one with bad or no connection.
de: Die Lösung dazu besteht darin, große Wechselmedien, wie eine Zip-Platte oder eine SuperDisk zu benutzen. Diese Platten sind nicht groß genug, um ein ganzes Debian-Archiv zu speichern, können aber leicht eine Untermenge aufnehmen, die für die meisten Anwender groß genug ist. Die Idee besteht darin, APT zu benutzen, um eine Liste benötigter Pakete zu generieren und diese dann mit einer anderen Maschine mit guter Verbindung auf die Platte herunterzuladen. Es ist sogar möglich, eine andere Debian-Maschine mit APT oder ein komplett unterschiedliches Betriebssystem und ein Download-Werkzeug wie Wget zu benutzen. Nennen wir die Maschine, die die Pakete herunterlädt <em>ferner Rechner</em> und die mit der schlechten oder fehlenden Verbindung <em>Zielrechner</em>.
es: La solución a esto es usar dispositivos extraíbles de gran capacidad tales como un disco Zip o uno SuperDisk. Estos discos no tienen la suficiente capacidad para almacenar todo el archivo de Debian, pero pueden contener un sub-conjunto suficientemente grande para la mayoría de usuarios. La idea es usar APT para generar una lista de los paquetes requeridos para después almacenarlos en un disco usando el sistema que tiene una conexión rápida. Es incluso posible usar otro sistema Debian con APT, o usar un sistema operativo totalmente distinto junto con una herramienta de descarga como wget. Digamos que el <em>sistema remoto</em> es aquél que descarga los paquetes, y <em>sistema destino</em> es aquél con poca o ninguna conexión.

source: This is achieved by creatively manipulating the APT configuration file. The essential premise to tell APT to look on a disc for it's archive files. Note that the disc should be formated with a filesystem that can handle long file names such as ext2, fat32 or vfat.
de: Dies wird durch kreatives Manipulieren der APT-Konfigurationsdatei erreicht. Die wesentliche Voraussetzung besteht darin, APT mitzuteilen, dass es für seine Archivdateien auf einer Platte nachsieht. Beachten Sie, dass diese Platte mit einem Dateisystem formatiert sein sollte, das mit langen Dateinamen umgehen kann, so wie ext2, fat32 oder vfat.
es: Esto se logra manipulando con imaginación el fichero de configuración de APT. La premisa esencial es decirle a APT que busque en el disco los ficheros del archivo. Tenga en cuenta que el disco debería tener un formato de un sistema de ficheros capaz de gestionar nombres largos de ficheros, tales como ext2, fat32 o vfat.

source: Using APT on both machines
de: APT auf beiden Maschinen benutzen
es: Usar APT en ambas máquinas

source: APT being available on both machines gives the simplest configuration. The basic idea is to place a copy of the status file on the disc and use the remote machine to fetch the latest package files and decide which packages to download. The disk directory structure should look like:
de: Ein verfügbares APT auf beiden Maschinen stellt die einfachste Konfiguration dar. Die Grundidee besteht darin, eine Kopie der Statusdatei auf der Platte zu platzieren und die ferne Maschine zu benutzen, um die neusten Paketdateien herunterzuladen und zu entscheiden, welche Pakete heruntergeladen werden. Die Plattenverzeichnisstruktur sollte so aussehen:
es: La configuración más sencilla es posible si APT está instalado en ambas máquinas. La idea básica es guardar una copia del fichero de estado en el disco, después usar el sistema remoto para obtener los últimos ficheros de paquete y decidir qué paquetes descargar. La estructura de directorios del disco debería tener este aspecto:

source: /disc/ archives/ partial/ lists/ partial/ status sources.list apt.conf
de: /Platte/ Archive/ partial/ lists/ partial/ status sources.list apt.conf

source: The configuration file
de: Die Konfigurationsdatei
es: El fichero de configuración
