Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: Rename a disc; change the label of a disk or override the disks given label. This option will cause <command>apt-cdrom</command> to prompt for a new label. Configuration Item: <literal>APT::CDROM::Rename</literal>.
de: Ein Medium umbenennen. Ändert den Namen eines Mediums oder überschreibt den Namen, der dem Medium gegeben wurde. Diese Option wird <command>apt-cdrom</command> veranlassen, nach einem neuen Namen zu fragen. Konfigurationselement: <literal>APT::CDROM::Rename</literal>.
es: Renombra un disco. Cambia la etiqueta de un disco o invalida la etiqueta del disco. Esta opción hará que <command>apt-cdrom</command> solicite una etiqueta nueva. Opción de configuración: <literal>APT::CDROM::Rename</literal>.

source: No mounting; prevent <command>apt-cdrom</command> from mounting and unmounting the mount point. Configuration Item: <literal>APT::CDROM::NoMount</literal>.
de: Kein Einhängen. Hindert <command>apt-cdrom</command> am Ein- und Aushängen des Einhängepunkts. Konfigurationselement: <literal>APT::CDROM::NoMount</literal>.
es: No montar. Evita que <command>apt-cdrom</command> monte y desmonte el punto de montaje. Opción de configuración: <literal>APT::CDROM::NoMount</literal>.

source: Fast Copy; Assume the package files are valid and do not check every package. This option should be used only if <command>apt-cdrom</command> has been run on this disc before and did not detect any errors. Configuration Item: <literal>APT::CDROM::Fast</literal>.
de: Schnelle Kopie. Unterstellt, dass die Paketdateien gültig sind und prüft nicht jedes Paket. Diese Option sollte nur benutzt werden, wenn <command>apt-cdrom</command> vorher für dieses Medium ausgeführt wurde und keine Fehler festgestellt hat. Konfigurationselement: <literal>APT::CDROM::Fast</literal>.
es: Crea una copia rápida. Asume que los ficheros de paquete son válidos y no comprueba cada paquete. Esta opción sólo se debe usar si <command>apt-cdrom</command> comprobó el disco anteriormente y no detectó ningún error. Opción de configuración: <literal>APT::CDROM::Fast</literal>.

source: Thorough Package Scan; This option may be needed with some old Debian 1.1/1.2 discs that have Package files in strange places. It takes much longer to scan the CD but will pick them all up.
de: Gründliche Paketdurchsuchung. Diese Option könnte für einige alte Debian-1.1/1.2-Medien nötig sein, die Paketdateien an seltsamen Orten haben. Dies verlängert das Durchsuchen des Mediums deutlich, nimmt aber alle auf.
es: Comprobación meticulosa de los paquetes. Esta opción puede ser necesaria con algunos discos viejos de Debian 1.1/1.2, que tienen los ficheros de paquete en lugares extraños. El análisis del disco óptico lleva mucho más tiempo, pero encontrará todo el contenido.

source: No Changes; Do not change the &sources-list; file and do not write index files. Everything is still checked however. Configuration Item: <literal>APT::CDROM::NoAct</literal>.
de: Keine Änderungen. Die &sources-list;-Datei nicht ändern und keine Indexdateien schreiben. Alles wird jedoch immer noch geprüft. Konfigurationselement: <literal>APT::CDROM::NoAct</literal>.
es: Sin cambios. No cambia el fichero &sources-list; y no escribe los ficheros de índice. Aun así, se revisará todo. Opción de configuración: <literal>APT::CDROM::NoAct</literal>.

source: <command>apt-cdrom</command> returns zero on normal operation, decimal 100 on error.
de: <command>apt-cdrom</command> gibt bei normalen Operationen 0 zurück, dezimal 100 bei Fehlern.
es: <command>apt-cdrom</command> devuelve cero si no hay ningún error y el valor 100 en caso de error.

source: &apt-author.jgunthorpe; &apt-author.team; &apt-email; &apt-product; <date>29 February 2004</date>
de: &apt-author.jgunthorpe; &apt-author.team; &apt-email; &apt-product; <date>29. Februar 2004</date>
es: &apt-author.jgunthorpe; &apt-author.team; &apt-email; &apt-product; <date>29 de Febrero de 2004</date>

source: APT Configuration Query program
de: APT-Konfigurationsabfrageprogramm
es: Programa para consultar la configuración de APT

source: <command>apt-config</command> <arg><option>-hv</option></arg> <arg><option>-o=<replaceable>config string</replaceable></option></arg> <arg><option>-c=<replaceable>file</replaceable></option></arg> <group choice="req"> <arg>shell</arg> <arg>dump</arg> </group>
de: <command>apt-config</command><arg><option>-hv</option></arg><arg><option>-o=<replaceable>Konfigurationszeichenkette</replaceable></option></arg><arg><option>-c=<replaceable>Datei</replaceable></option></arg><group choice="req"> <arg>shell</arg> <arg>dump</arg> </group>
es: <command>apt-config</command> <arg><option>-hv</option></arg> <arg><option>-o=<replaceable>cadena-de-configuración</replaceable></option></arg> <arg><option>-c=<replaceable>fichero</replaceable></option></arg> <group choice="req"> <arg>shell</arg> <arg>dump</arg> </group>

source: <command>apt-config</command> is an internal program used by various portions of the APT suite to provide consistent configurability. It accesses the main configuration file <filename>/etc/apt/apt.conf</filename> in a manner that is easy to use by scripted applications.
de: <command>apt-config</command> ist ein internes Programm, das von vielen Teilen des APT-Pakets benutzt wird, um durchgängige Konfigurierbarkeit bereitzustellen. Es greift auf die Hauptkonfigurationsdatei <filename>/etc/apt/apt.conf</filename> auf eine Art zu, die leicht für geskriptete Anwendungen zu benutzen ist.
es: <command>apt-config</command> es un programa interno que usan varios programas del conjunto de herramientas de APT para ofrecer un método de configuración sólido. Este programa accede al fichero principal de configuración <filename>/etc/apt/apt.conf</filename> de forma que resulta sencillo de usar por aplicaciones con scripts.

source: Unless the <option>-h</option>, or <option>--help</option> option is given one of the commands below must be present.
de: Außer, wenn die <option>-h</option>- oder <option>--help</option>-Option angegeben wurde, muss einer der Befehle unterhalb vorkommen.
es: Se debe proporcionar alguna de las siguientes órdenes, a menos que se proporcione una de las opciones <option>-h</option> o <option>--help</option>.

source: shell is used to access the configuration information from a shell script. It is given pairs of arguments, the first being a shell variable and the second the configuration value to query. As output it lists a series of shell assignments commands for each present value. In a shell script it should be used like:
de: shell wird benutzt, um aus einem Shellskript auf Konfigurationsinformationen zuzugreifen. Es wird ein Paar aus Argumenten angegeben – das erste als Shell-Variable und das zweite als Konfigurationswert zum Abfragen. Als Ausgabe listet es eine Serie von Shell-Zuweisungsbefehlen für jeden vorhandenen Wert auf. In einen Shellskript sollte es wie folgt benutzt werden:
es: Se usa para acceder a la información de la configuración mediante un script. Se proporcionan parejas de argumentos, el primero es una variable del intérprete de órdenes y el segundo el valor de la configuración a consultar. Como salida muestra una serie de listas de órdenes asignadas al intérprete de órdenes para cada valor presente. Ésto se debería usar de la siguiente manera en un script:

source: This will set the shell environment variable $OPTS to the value of MyApp::options with a default of <option>-f</option>.
de: Dies wird die Shell-Umgebungsvariable $OPT auf den Wert von MyApp::options mit einer Vorgabe von <option>-f</option> setzen.
es: Esto define la variable de entorno del intérprete de órdenes $OPTS con el valor de MyApp::Opciones, y con <option>-f</option> por omisión.

source: The configuration item may be postfixed with a /[fdbi]. f returns file names, d returns directories, b returns true or false and i returns an integer. Each of the returns is normalized and verified internally.
de: An das Konfigurationselement kann /[fdbi] angehängt werden. »f« gibt Dateinamen zurück, »d« gibt Verzeichnisse zurück, »b« gibt true oder false zurück und »i« gibt eine Ganzzahl zurück. Jede Rückgabe ist normiert und intern geprüft.
es: La opción de configuración se puede corregir posteriormente con un «/[fdbi]». El parámetro «f» devuelve nombres de fichero, «d» devuelve los directorios, «b» devuelve verdadero o falso, e «i» devuelve un número entero. Cada uno de los valores devueltos se normaliza y se verifica internamente.

source: Just show the contents of the configuration space.
de: Nur der Inhalt des Konfigurationsbereichs wird angezeigt.
es: Sólo muestra el contenido del espacio de configuración.

source: <command>apt-config</command> returns zero on normal operation, decimal 100 on error.
de: <command>apt-config</command> gibt bei normalen Operationen 0 zurück, dezimal 100 bei Fehlern.
es: <command>apt-config</command> devuelve cero si no hay ningún error, y el valor 100 en caso de error.

source: Utility to extract DebConf config and templates from Debian packages
de: Hilfsprogramm zum Extrahieren der DebConf-Konfiguration und Schablonen von Debian-Paketen
es: Herramienta para extraer la configuración de DebConf y las plantillas de los paquetes de Debian

source: <command>apt-extracttemplates</command> <arg><option>-hv</option></arg> <arg><option>-t=<replaceable>temporary directory</replaceable></option></arg> <arg choice="plain" rep="repeat"><replaceable>file</replaceable></arg>
de: <command>apt-extracttemplates</command> <arg><option>-hv</option></arg> <arg><option>-t=<replaceable>temporäres Verzeichnis</replaceable></option></arg> <arg choice="plain" rep="repeat"><replaceable>Datei</replaceable></arg>
es: <command>apt-extracttemplates</command> <arg><option>-hv</option></arg> <arg><option>-t=<replaceable>directorio-temporal</replaceable></option></arg> <arg choice="plain" rep="repeat"><replaceable>fichero</replaceable></arg>

source: <command>apt-extracttemplates</command> will take one or more Debian package files as input and write out (to a temporary directory) all associated config scripts and template files. For each passed in package that contains config scripts and templates, one line of output will be generated in the format:
de: <command>apt-extracttemplates</command> nimmt als Eingabe ein oder mehrere Debian-Paketdateien entgegen und schreibt alle verbundenen Konfigurationsskripte und Schablonendateien (in ein temporäres Verzeichnis) heraus. Für jedes übergebene Paket das Konfigurationsskripte und Schablonendateien enthält, wird eine Ausgabezeile in folgendem Format generiert:
es: <command>apt-extracttemplates</command> tomará uno o más ficheros de paquetes de Debian como entrada para escribir (a un directorio temporal) todos los scripts de configuración asociados y los ficheros de plantilla. Para cada paquete proporcionado que contenga scripts de configuración y plantillas, se generará una salida de una línea con el formato:

source: package version template-file config-script
de: Paket Version Schablonendatei Konfigurationsskript
es: paquete versión fichero-de-plantilla script-de-configuración

source: template-file and config-script are written to the temporary directory specified by the -t or --tempdir (<literal>APT::ExtractTemplates::TempDir</literal>) directory, with filenames of the form <filename>package.template.XXXX</filename> and <filename>package.config.XXXX</filename>
de: Schablonendatei und Konfigurationsskript werden in das temporäre Verzeichnis geschrieben, das durch »-t« oder »--tempdir« (<literal>APT::ExtractTemplates::TempDir</literal>) Verzeichnis mit Dateinamen der Form <filename>package. template.XXXX</filename> und <filename>package.config.XXXX</filename> angegeben wurde
es: El fichero de plantilla y el script de configuración se escribirán en el directorio temporal definido mediante la opción «-t» o «--tempdir» (<literal>APT::ExtractTemplates::TempDir</literal>), los nombres de los ficheros tendrán la forma <filename>paquete.template.XXXX</filename> y <filename>paquete.config.XXXX</filename>

source: Temporary directory in which to write extracted debconf template files and config scripts. Configuration Item: <literal>APT::ExtractTemplates::TempDir</literal>
de: Temporäres Verzeichnis, in das die extrahierten DebConf-Schablonendateien und Konfigurationsdateien geschrieben werden. Konfigurationselement: <literal>APT::ExtractTemplates::TempDir</literal>
es: El directorio temporal en el que se escribirán los ficheros de plantillas debconf y los scripts de configuración extraídos. Opción de configuración: <literal>APT::ExtractTemplates::TempDir</literal>

source: <command>apt-extracttemplates</command> returns zero on normal operation, decimal 100 on error.
de: <command>apt-extracttemplates</command> gibt bei normalen Operationen 0 zurück, dezimal 100 bei Fehlern.
es: <command>apt-extracttemplates</command> devuelve cero si no hay ningún error, y el valor 100 en caso de error.

source: Utility to generate index files
de: Hilfsprogramm zum Generieren von Indexdateien
es: Herramienta para generar ficheros de índice

source: <command>apt-ftparchive</command> <arg><option>-hvdsq</option></arg> <arg><option>--md5</option></arg> <arg><option>--delink</option></arg> <arg><option>--readonly</option></arg> <arg><option>--contents</option></arg> <arg><option>--arch <replaceable>architecture</replaceable></option></arg> <arg><option>-o <replaceable>config</replaceable>=<replaceable>string</replaceable></option></arg> <arg><option>-c=<replaceable>file</replaceable></option></arg> <group choice="req"> <arg>packages<arg choice="plain" rep="repeat"><replaceable>path</replaceable></arg><arg><replaceable>override</replaceable><arg><replaceable>pathprefix</replaceable></arg></arg></arg> <arg>sources<arg choice="plain" rep="repeat"><replaceable>path</replaceable></arg><arg><replaceable>override</replaceable><arg><replaceable>pathprefix</replaceable></arg></arg></arg> <arg>contents <arg choice="plain"><replaceable>path</replaceable></arg></arg> <arg>release <arg choice="plain"><replaceable>path</replaceable></arg></arg> <arg>generate <arg choice="plain"><replaceable>config-file</replaceable></arg> <arg choice="plain" rep="repeat"><replaceable>section</replaceable></arg></arg> <arg>clean <arg choice="plain"><replaceable>config-file</replaceable></arg></arg> </group>
de: <command>apt-ftparchive</command> <arg><option>-hvdsq</option></arg> <arg><option>--md5</option></arg> <arg><option>--delink</option></arg> <arg><option>--readonly</option></arg> <arg><option>--contents</option></arg> <arg><option>--arch <replaceable>Architektur</replaceable></option></arg> <arg><option>-o <replaceable>Konfiguration</replaceable>=<replaceable>Zeichenkette</replaceable></option></arg> <arg><option>-c=<replaceable>Datei</replaceable></option></arg> <group choice="req"> <arg>packages<arg choice="plain" rep="repeat"><replaceable>Pfad</replaceable></arg><arg><replaceable>überschreiben</replaceable><arg><replaceable>Pfad-Präfix</replaceable></arg></arg></arg> <arg>sources<arg choice="plain" rep="repeat"><replaceable>Pfad</replaceable></arg><arg><replaceable>überschreiben</replaceable><arg><replaceable>Pfad-Präfix</replaceable></arg></arg></arg> <arg>contents <arg choice="plain"><replaceable>Pfad</replaceable></arg></arg> <arg>release <arg choice="plain"><replaceable>Pfad</replaceable></arg></arg> <arg>generate <arg choice="plain"><replaceable>Konfigurationsdatei</replaceable></arg> <arg choice="plain" rep="repeat"><replaceable>Abschnitt</replaceable></arg></arg> <arg>clean <arg choice="plain"><replaceable>Konfigurationsdatei</replaceable></arg></arg> </group>
es: <command>apt-ftparchive</command> <arg><option>-hvdsq</option></arg> <arg><option>--md5</option></arg> <arg><option>--delink</option></arg> <arg><option>--readonly</option></arg> <arg><option>--contents</option></arg> <arg><option>--arch <replaceable>arquitectura</replaceable></option></arg> <arg><option>-o <replaceable>configuración</replaceable>=<replaceable>cadena</replaceable></option></arg> <arg><option>-c=<replaceable>fichero</replaceable></option></arg> <group choice="req"> <arg>packages<arg choice="plain" rep="repeat"><replaceable>ruta</replaceable></arg><arg><replaceable>fichero-alternativo</replaceable><arg><replaceable>prefijo-ruta</replaceable></arg></arg></arg> <arg>sources<arg choice="plain" rep="repeat"><replaceable>ruta</replaceable></arg><arg><replaceable>fichero-alternativo</replaceable><arg><replaceable>prefijo-ruta</replaceable></arg></arg></arg> <arg>contents <arg choice="plain"><replaceable>ruta</replaceable></arg></arg> <arg>release <arg choice="plain"><replaceable>ruta</replaceable></arg></arg> <arg>generate <arg choice="plain"><replaceable>fichero-configuración</replaceable></arg> <arg choice="plain" rep="repeat"><replaceable>sección</replaceable></arg></arg> <arg>clean <arg choice="plain"><replaceable>fichero-configuración</replaceable></arg></arg> </group>

source: <command>apt-ftparchive</command> is the command line tool that generates the index files that APT uses to access a distribution source. The index files should be generated on the origin site based on the content of that site.
de: <command>apt-ftparchive</command> ist das Befehlszeilenwerkzeug, das Indexdateien generiert, die APT zum Zugriff auf eine Distributionsquelle benutzt. Die Indexdateien sollten auf der Ursprungs-Site auf Basis des Inhalts dieser Stelle generiert werden.
es: <command>apt-ftparchive</command> es la herramienta de la línea de órdenes que genera los ficheros de índice que APT utiliza para acceder a la fuente de la distribución. Los ficheros de índice se deberían generar en el sitio de origen basado en el contenido de ese sitio.

source: <command>apt-ftparchive</command> is a superset of the &dpkg-scanpackages; program, incorporating its entire functionality via the <literal>packages</literal> command. It also contains a contents file generator, <literal>contents</literal>, and an elaborate means to 'script' the generation process for a complete archive.
de: <command>apt-ftparchive</command> ist eine Obermenge des &dpkg-scanpackages;-Programms, das dessen ganze Funktionalität über den <literal>packages</literal>-Befehl enthält ist ein durchdachtes Mittel den Generierungsprozess für ein komplettes Archiv zu »skripten«.
es: <command>apt-ftparchive</command> es un superconjunto del programa &dpkg-scanpackages;, e incorpora su funcionalidad al completo mediante la orden <literal>packages</literal>. También contiene un generador de contenidos de fichero, <literal>contents</literal>, y un modo elaborado para realizar un «script» para el proceso de generación de un archivo completo.

source: Internally <command>apt-ftparchive</command> can make use of binary databases to cache the contents of a .deb file and it does not rely on any external programs aside from &gzip;. When doing a full generate it automatically performs file-change checks and builds the desired compressed output files.
de: Intern kann <command>apt-ftparchive</command> von Programmdatenbanken Gebrauch machen, um die Inhalte einer .deb-Datei zwischenzuspeichern und es verlasst sich nicht auf irgendwelche externen Programme, abgesehen von &gzip;. Wenn eine vollständige Generierung erfolgt, werden automatisch Dateiänderungsprüfungen durchgeführt und die gewünschten gepackten Ausgabedateien erzeugt.
es: Internamente, <command>apt-ftparchive</command> puede hacer uso de bases de datos binarias para almacenar los contenidos de un fichero «.deb» y no depender de ningún programa externo como &gzip;. Cuando se realiza una generación completa, automáticamente realiza comprobaciones de cambios en los ficheros y genera los ficheros de salida comprimidos deseados.

source: The packages command generates a package file from a directory tree. It takes the given directory and recursively searches it for .deb files, emitting a package record to stdout for each. This command is approximately equivalent to &dpkg-scanpackages;.
de: Der »packages«-Befehl generiert eine Paketdatei aus einem Verzeichnisbaum. Er nimmt ein vorgegebenes Verzeichnis und durchsucht es rekursiv nach .deb-Dateien, wobei es für jede einen Paketdatensatz auf stdout ausgibt.Dieser Befehl entspricht etwa &dpkg-scanpackages;.
es: La orden «packages» genera un fichero de paquete a partir de un directorio. Busca recursivamente ficheros «.deb» en el directorio proporcionado, generando un registro de paquete en la salida estándar para cada uno. Esta orden es casi un equivalente de &dpkg-scanpackages;.

source: The option <option>--db</option> can be used to specify a binary caching DB.
de: Die Option <option>--db</option> kann benutzt werden, um eine Datenbank zum Zwischenspeichern von Programmen anzugeben.
es: La opción <option>--db</option> se puede usar para especificar una base de datos binaria para la caché (registro de paquetes).

source: The <literal>sources</literal> command generates a source index file from a directory tree. It takes the given directory and recursively searches it for .dsc files, emitting a source record to stdout for each. This command is approximately equivalent to &dpkg-scansources;.
de: Der <literal>sources</literal>-Befehl generiert eine Quellenindexdatei aus einem Verzeichnisbaum. Er nimmt ein vorgegebenes Verzeichnis und durchsucht es rekursiv nach .dsc-Dateien, wobei es für jede einen Quelldatensatz auf stdout ausgibt. Dieser Befehl entspricht etwa &dpkg-scansources;.
es: La orden <literal>sources</literal> genera un fichero de índice de fuentes a partir de un directorio. Toma el directorio proporcionado y busca en él recursivamente ficheros «.dsc», generando un registro de fuente en la salida estándar para cada uno. Esta orden es casi un equivalente de &dpkg-scansources;.

source: If an override file is specified then a source override file will be looked for with an extension of .src. The --source-override option can be used to change the source override file that will be used.
de: Wenn eine Override-Datei angegeben ist, wird nach einer Quellen-Override-Datei mit einer .src-Dateiendung gesucht. Die Option »--source-override« kann benutzt werden, um die Quellen-Override-Datei, die benutzt wird, zu ändern.
es: Si se define un fichero alternativo, se buscará un fichero de fuentes alternativo con la extensión «.src». Puede usar la opción --source-override para cambiar el fichero de fuentes alternativo que se usará.

source: The <literal>contents</literal> command generates a contents file from a directory tree. It takes the given directory and recursively searches it for .deb files, and reads the file list from each file. It then sorts and writes to stdout the list of files matched to packages. Directories are not written to the output. If multiple packages own the same file then each package is separated by a comma in the output.
de: Der <literal>contents</literal>-Befehl generiert eine Inhaltsdatei aus einem Verzeichnisbaum. Er nimmt ein vorgegebenes Verzeichnis und durchsucht es rekursiv nach .deb-Dateien und liest die Dateiliste von jeder Datei. Dann sortiert er die Liste der passenden Pakete und schreibt sie nach stdout. Verzeichnisse werden nicht in die Ausgabe geschrieben. Falls mehrere Pakete die gleiche Datei besitzen, dann befindet sich jedes Paket durch Komma getrennt in der Ausgabe.
es: La orden <literal>contents</literal> genera un fichero de contenidos a partir de un directorio. Toma el directorio proporcionado y busca en él recursivamente ficheros «.deb», lee la lista de ficheros para cada uno, los ordena y muestra en la salida estándar la lista de ficheros que coinciden con los paquetes. Los directorios no se muestran por la salida estándar. Si varios paquetes tienen el mismo fichero, entonces cada paquete se separará por una coma en la salida.
