Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: The chain of trust in Debian starts when a maintainer uploads a new package or a new version of a package to the Debian archive. This upload in order to become effective needs to be signed by a key of a maintainer within the Debian maintainer's keyring (available in the debian-keyring package). Maintainer's keys are signed by other maintainers following pre-established procedures to ensure the identity of the key holder.
de: Die Kette des Vertrauens in Debian beginnt, wenn eine Betreuer ein neues Paket oder eine neue Version eines Pakets in das Debian-Archiv hochlädt. Dieser Upload muss mit einem Schlüssel des Betreuers, der sich im Schlüsselbund der Debian-Betreuer befindet (verfügbar im Paket debian-keyring) signiert werden. Betreuerschlüssel werden von anderen Betreuern gemäß vorbestimmter Regeln signiert, um die Identität des Schlüsselinhabers sicherzustellen.
es: La cadena de confianza de Debian comienza cuando un mantenedor sube un nuevo paquete o una nueva versión de un paquete al archivo de Debian. Para que la subida sea efectiva, se debe firmar con una clave de un mantenedor del registro de claves de los mantenedores de Debian (disponible en el paquete debian-keyring). Las claves del mantenedor se firman por otros mantenedores siguiendo unos procedimientos pre-establecidos para asegurar la identidad del propietario de la clave.

source: Once the uploaded package is verified and included in the archive, the maintainer signature is stripped off, an MD5 sum of the package is computed and put in the Packages file. The MD5 sum of all of the packages files are then computed and put into the Release file. The Release file is then signed by the archive key (which is created once a year) and distributed through the FTP server. This key is also on the Debian keyring.
de: Sobald das hochgeladenen Paket überprüft und in das Archiv hinzugefügt wurde, wird die Betreuersignatur entfernt, eine MD5-Summe des Pakets berechnet und in die Paketdatei getan. Dann werden die MD5-Summen aller Paketdateien berechnet und in die Release-Datei getan. Dann wird die Release-Datei durch den Archivschlüssel signiert (der einmal jährlich erzeugt und per FTP-Server verteilt wird). Dieser Schlüssel ist außerdem der Debian-Schlüsselbund.
es: Una vez subido el paquete se comprueba y se incluye en el archivo, se elimina la firma del mantenedor, se genera un resumen MD5 del paquete y se coloca en el fichero «Packages». Se genera el resumen MD5 de todos los ficheros de paquetes y se coloca en el fichero «Release». Entonces se firma el fichero «Release» con la clave del archivo (que se crea una vez al año) y se distribuye mediante un servidor FTP. Esta clave también está en el registro de claves de Debian.

source: Any end user can check the signature of the Release file, extract the MD5 sum of a package from it and compare it with the MD5 sum of the package he downloaded. Prior to version 0.6 only the MD5 sum of the downloaded Debian package was checked. Now both the MD5 sum and the signature of the Release file are checked.
de: Jeder Endanwender kann die Signatur der Release-Datei prüfen, die MD5-Summe eines Paketes daraus entpacken und mit der MD5-Summe des Pakets vergleichen, das er heruntergeladen hat. Vor Version 0.6 wurde nur die MD5-Summe des heruntergeladenen Debian-Pakets geprüft. Nun werden sowohl die MD5-Summe als auch die Signatur der Release-Datei geprüft.
es: Cualquier usuario final puede comprobar la firma del fichero «Release», extraer el resumen MD5 de un paquete y compararlo con el resumen MD5 del paquete que haya descargado. Antes de la versión 0.6, sólo se comprobaba el resumen MD5 del paquete de Debian descargado. Ahora se comprueban el resumen MD5 y la firma del fichero «Release».

source: Notice that this is distinct from checking signatures on a per package basis. It is designed to prevent two possible attacks:
de: Beachten Sie, dass dies verschieden von geprüften Signaturen auf Paketbasis ist. Es wurde entworfen, um zwei mögliche Angriffe zu verhindern:
es: Tenga en cuenta que esto es distinto a comprobar las firmas de cada paquete individualmente. Se diseñó para prevenir dos posible ataques:

source: <literal>Network "man in the middle" attacks</literal>. Without signature checking, a malicious agent can introduce himself in the package download process and provide malicious software either by controlling a network element (router, switch, etc.) or by redirecting traffic to a rogue server (through arp or DNS spoofing attacks).
de: <literal>Network "man in the middle" attacks</literal>. Ohne Signaturprüfung kann ein schädlicher Mittelsmann sich selbst in das Herunterladen von Paketen einbringen und Schadsoftware bereitstellen. Dies kann entweder durch Kontrolle eines Netzwerkelements (Router, Switch, etc.) oder durch Umleiten des Netzverkehrs zu einem bösartigen Server (durch ARP- oder DNS-Manipulationsangriffe) erfolgen.
es: <literal>Ataques de red «man in the middle» (persona entre medias)</literal>. Sin la comprobación de las firmas, una persona malvada puede introducirse en el proceso de descarga del paquete y proporcionar programas con contenido malicioso para controlar un elemento de la red (enrutador, switch, etc) o para redirigir el tráfico a un servidor ficticio (mediante ataques de envenenamiento de arp o de DNS).

source: <literal>Mirror network compromise</literal>. Without signature checking, a malicious agent can compromise a mirror host and modify the files in it to propagate malicious software to all users downloading packages from that host.
de: <literal>Mirror network compromise</literal>. Ohne Signaturprüfung kann ein schädlicher Mittelsmann einen Spiegelserver kompromittieren und die Dateien darauf verändern, um schädliche Software an alle Anwender zu verbreiten, die Pakete von diesem Rechner herunterladen.
es: <literal>Réplica de la red comprometida</literal>. Sin la comprobación de la firma, una persona malvada puede comprometer una réplica y modificar los ficheros de ésta para propagar programas con contenido malicioso a todos los usuarios que descarguen paquetes de dicha réplica.

source: However, it does not defend against a compromise of the Debian master server itself (which signs the packages) or against a compromise of the key used to sign the Release files. In any case, this mechanism can complement a per-package signature.
de: Es schützt jedoch nicht gegen eine Kompromittierung des Haupt-Debian-Servers selbst (der die Pakete signiert) oder gegen eine Kompromittierung des Schlüssels, der zum Signieren der Release-Dateien benutzt wird. In jedem Fall kann dieser Mechanismus eine Signatur pro Paket ergänzen.
es: Sin embargo, esto no protege de un servidor maestro de Debian (que firma los paquetes) comprometido o contra una clave usada para firmar los ficheros «Release» comprometida. En cualquier caso, este mecanismo puede complementar una firma por paquete.

source: User configuration
de: Benutzerkonfiguration
es: Configuración de usuario

source: <command>apt-key</command> is the program that manages the list of keys used by apt. It can be used to add or remove keys although an installation of this release will automatically provide the default Debian archive signing keys used in the Debian package repositories.
de: <command>apt-key</command> ist das Programm, das die Liste der von APT verwendeten Schlüssel verwaltet. Es kann benutzt werden, um Schlüssel hinzuzufügen oder zu entfernen, obwohl eine Installation dieses Releases automatisch die Standard-Debian-Archivsignierschlüssel bereitstellt, die in den Debian-Paketdepots benutzt werden.
es: <command>apt-key</command> es el programa que gestiona la lista de claves usadas por apt. Se puede usar para añadir o eliminar claves, aunque la instalación de esta versión proporciona automáticamente las claves predeterminadas del archivo de Debian que se usan en los repositorios de paquetes de Debian.

source: In order to add a new key you need to first download it (you should make sure you are using a trusted communication channel when retrieving it), add it with <command>apt-key</command> and then run <command>apt-get update</command> so that apt can download and verify the <filename>InRelease</filename> or <filename>Release.gpg</filename> files from the archives you have configured.
de: Um einen neuen Schlüssel hinzuzufügen, müssen Sie ihn zuerst herunterladen (Sie sollten sicherstellen, dass Sie einen vertrauenswürdigen Kommunikationskanal benutzen, wenn Sie ihn herunterladen), ihn mit <command>apt-key</command> hinzufügen und dann <command>apt-get update</command> ausführen, so dass APT die Dateien <filename>InRelease</filename> oder <filename>Release.gpg</filename> der von Ihnen konfigurierten Archive herunterladen und prüfen kann.

source: Archive configuration
de: Archivkonfiguration
es: Configuración del archivo

source: If you want to provide archive signatures in an archive under your maintenance you have to:
de: Wenn Sie Archivsignaturen in einem von Ihnen betreuten Archiv zur Verfügung stellen möchten, müssen Sie:
es: Si quiere proporcionar firmas de archivo en un archivo bajo su control tiene que:

source: <emphasis>Create a toplevel Release file</emphasis>, if it does not exist already. You can do this by running <command>apt-ftparchive release</command> (provided in apt-utils).
de: <emphasis>Erzeugen einer Release-Datei der obersten Stufe</emphasis>, wenn sie nicht bereits existiert. Sie können dies erledigen, indem Sie <command>apt-ftparchive release</command> (aus apt-utils) ausführen.
es: <emphasis>Crear un fichero «Release»</emphasis>, si no existe. Para ello se ejecuta <command>apt-ftparchive release</command> (proporcionado en apt-utils).

source: <emphasis>Sign it</emphasis>. You can do this by running <command>gpg --clearsign -o InRelease Release</command> and <command>gpg -abs -o Release.gpg Release</command>.
de: <emphasis>Es signieren</emphasis>. Sie können dies tun, indem Sie <command>gpg --clearsign -o InRelease Release</command> und <command>gpg -abs -o Release.gpg Release</command> ausführen.

source: <emphasis>Publish the key fingerprint</emphasis>, that way your users will know what key they need to import in order to authenticate the files in the archive.
de: <emphasis>Veröffentlichen Sie den Schlüsselfingerabdruck</emphasis>, damit Ihre Anwender wissen, welchen Schlüssel sie importieren müssen, um die Dateien im Archiv zu authentifizieren.
es: <emphasis>Publicar la huella digital de la clave</emphasis>, de modo que los usuarios conozcan qué clave necesitan importar para autenticar los ficheros del archivo.

source: Whenever the contents of the archive changes (new packages are added or removed) the archive maintainer has to follow the first two steps previously outlined.
de: Immer wenn sich die Inhalte des Archivs ändern (neue Pakete hinzugefügt oder entfernt werden), muss der Archivbetreuer den beiden zuerst skizzierten Schritten folgen.
es: Cuando los contenidos del archivo cambien (se añadan paquetes nuevos o se eliminen) el mantenedor del archivo tiene que seguir los dos primeros pasos explicados anteriormente.

source: For more background information you might want to review the <ulink url="http://www.debian.org/doc/manuals/securing-debian-howto/ch7.en.html">Debian Security Infrastructure</ulink> chapter of the Securing Debian Manual (available also in the harden-doc package) and the <ulink url="http://www.cryptnet.net/fdp/crypto/strong_distro.html" >Strong Distribution HOWTO</ulink> by V. Alex Brennen.
de: Um weitere Hintergrundinformationen zu erhalten, können Sie die <ulink url="http://www.debian.org/doc/manuals/securing-debian-howto/ch7.de.html">Die Infrastruktur für Sicherheit in Debian</ulink>-Kapitel des Handbuchs »Anleitung zum Absichern von Debian« (auch verfügbar im Paket harden-doc) und dem <ulink url="http://www.cryptnet.net/fdp/crypto/strong_distro.html" >Strong Distribution HOWTO</ulink> von V. Alex Brennen lesen.
es: Para más información puede que quiera revisar el capítulo de la <ulink url="http://www.debian.org/doc/manuals/securing-debian-howto/ch7.en.html">Infraestructura de Seguridad de Debian</ulink> del Manual de Seguridad de Debian (también disponible en el paquete harden-doc) y el <ulink url="http://www.cryptnet.net/fdp/crypto/strong_distro.html" >COMO Fortificar una Distribución</ulink> de V. Alex Brennen.

source: Manpage Authors
de: Autoren der Handbuchseite
es: Autores de la página del manual

source: This man-page is based on the work of Javier Fernández-Sanguino Peña, Isaac Jones, Colin Walters, Florian Weimer and Michael Vogt.
de: Diese Handbuchseite basiert auf der Arbeit von Javier Fernández-Sanguino Peña, Isaac Jones, Colin Walters, Florian Weimer und Michael Vogt.
es: Esta página del manual se basa en el trabajo de Javier Fernández-Sanguino Peña, Isaac Jones, Colin Walters, Florian Weimer y Michael Vogt.

source: Utility to sort package index files
de: Werkzeug zum Sortieren von Paketindexdateien
es: Herramienta para ordenar los ficheros de índice de paquetes

source: <command>apt-sortpkgs</command> <arg><option>-hvs</option></arg> <arg><option>-o=<replaceable>config string</replaceable></option></arg> <arg><option>-c=<replaceable>file</replaceable></option></arg> <arg choice="plain" rep="repeat"><replaceable>file</replaceable></arg>
de: <command>apt-sortpkgs</command> <arg><option>-hvs</option></arg> <arg><option>-o=<replaceable>Konfigurationszeichenkette</replaceable></option></arg> <arg><option>-c=<replaceable>Datei</replaceable></option></arg> <arg choice="plain" rep="repeat"><replaceable>Datei</replaceable></arg>
es: <command>apt-sortpkgs</command> <arg><option>-hvs</option></arg> <arg><option>-o=<replaceable>cadena-de-configuración</replaceable></option></arg> <arg><option>-c=<replaceable>fichero</replaceable></option></arg> <arg choice="plain" rep="repeat"><replaceable>fichero</replaceable></arg>

source: <command>apt-sortpkgs</command> will take an index file (Source index or Package index) and sort the records so that they are ordered by the package name. It will also sort the internal fields of each record according to the internal sorting rules.
de: <command>apt-sortpkgs</command> nimmt eine Indexdatei (Quell- oder Paketindex) und sortiert die Datensätze nach Paketnamen. Es wird außerdem die internen Felder jedes Datensatzes gemäß interner Sortierregeln sortieren.
es: <command>apt-sortpkgs</command> toma un fichero de índice (índice de fuentes («Source») o índice de paquetes («Package»)) y ordena los registros por nombre de paquete. También ordena los campos internos de cada registro de acuerdo a las reglas de ordenación internas.

source: All output is sent to stdout, the input must be a seekable file.
de: Alle Ausgaben werden an stdout gesendet, die Eingabe muss eine durchsuchbare Datei sein.
es: Toda la salida se muestra por la salida estándar, la entrada debe ser un fichero ubicable.

source: Use Source index field ordering. Configuration Item: <literal>APT::SortPkgs::Source</literal>.
de: Quellindexfeldanordnung benutzen. Konfigurationselement: <literal>APT::SortPkgs::Source</literal>.
es: Ordena por el campo de índice Source. Opción de configuración: <literal>APT::SortPkgs::Source</literal>.

source: <command>apt-sortpkgs</command> returns zero on normal operation, decimal 100 on error.
de: <command>apt-sortpkgs</command> gibt bei normalen Operationen 0 zurück, dezimal 100 bei Fehlern.
es: <command>apt-sortpkgs</command> devuelve cero si no hay ningún error, y el valor 100 en caso de error.

source: &apt-author.jgunthorpe; &apt-author.team; <author> <firstname>Daniel</firstname> <surname>Burrows</surname> <contrib>Initial documentation of Debug::*.</contrib> <email>dburrows@debian.org</email> </author> &apt-email; &apt-product; <date>16 January 2010</date>
de: &apt-author.jgunthorpe; &apt-author.team; <author> <firstname>Daniel</firstname> <surname>Burrows</surname> <contrib>Erste Dokumentation von Debug::*.</contrib> <email>dburrows@debian.org</email> </author> &apt-email; &apt-product; <date>16. Januar 2010</date>
es: &apt-author.jgunthorpe; &apt-author.team; <author> <firstname>Daniel</firstname> <surname>Burrows</surname> <contrib>Documentación inicial de Debug::*.</contrib> <email>dburrows@debian.org</email> </author> &apt-email; &apt-product; <date>16 de Enero de 2009</date>

source: Configuration file for APT
de: Konfigurationsdatei für APT
es: Fichero de configuración de APT

source: <filename>apt.conf</filename> is the main configuration file for the APT suite of tools, but by far not the only place changes to options can be made. All tools therefore share the configuration files and also use a common command line parser to provide a uniform environment.
de: <filename>apt.conf</filename> ist die Hauptkonfigurationsdatei für die APT-Werkzeugsammlung, aber bei weitem nicht der einzige Ort, an dem Änderungen vorgenommen werden können. Alle Werkzeuge nutzen die Konfigurationsdateien daher gemeinsam und außerdem wird ein einheitlicher Befehlszeilenauswerter benutzt, um eine einheitliche Umgebung bereitzustellen.
es: <filename>apt.conf</filename> es el fichero de configuración principal del conjunto de herramientas APT, pero no es ni mucho menos donde se pueden ubicar cambios a las opciones. Por ello, todas las herramientas comparten los ficheros de configuración y también usan un analizador de línea de órdenes común para ofrecer un entorno uniforme.

source: When an APT tool starts up it will read the configuration files in the following order:
de: Wenn ein APT-Werkzeug startet, wird es die Konfigurationsdateien in der folgenden Reihenfolge lesen:
es: Cuando se inicia una herramienta de APT, leerá los ficheros de configuración en el siguiente orden:

source: the file specified by the <envar>APT_CONFIG</envar> environment variable (if any)
de: die Datei, die durch die Umgebungsvariable <envar>APT_CONFIG</envar> angegeben wird (falls gesetzt)
es: El fichero definido por la variable de entorno <envar>APT_CONFIG</envar> (de existir).

source: the main configuration file specified by <literal>Dir::Etc::main</literal>
de: die Hauptkonfigurationsdatei, die durch <literal>Dir::Etc::main</literal> angegeben wird
es: El fichero de configuración principal definido por <literal>Dir::Etc::main</literal>.

source: the command line options are applied to override the configuration directives or to load even more configuration files.
de: die Befehlszeilenoptionen werden angewandt, um die Konfigurationsdirektiven zu überschreiben oder um sogar mehrere Konfigurationsdateien zu laden.
es: Las opciones de línea de órdenes se aplican para anular directivas de configuración o para cargar más ficheros de configuración.

source: The configuration file is organized in a tree with options organized into functional groups. Option specification is given with a double colon notation, for instance <literal>APT::Get::Assume-Yes</literal> is an option within the APT tool group, for the Get tool. Options do not inherit from their parent groups.
de: Die Konfigurationsdatei ist in einem Baum mit Optionen organisiert, die in funktionellen Gruppen organisiert sind. Optionsspezifikation wird mit einer doppelten Doppelpunktschreibweise angegeben, zum Beispiel ist <literal>APT::Get::Assume-Yes</literal> eine Option innerhalb der APT-Werkzeuggruppe für das Werkzeug Get. Optionen werden nicht von ihren Elterngruppe geerbt.
es: El fichero de configuración está organizado en forma de árbol con las opciones organizadas en grupos funcionales. Las opciones se proporcionan con dos puntos dobles, por ejemplo <literal>APT::Get::Assume-Yes</literal> es una opción de la herramienta Get, dentro del conjunto de herramientas de APT. Las opciones no se heredan de sus grupos paternos.

source: Syntactically the configuration language is modeled after what the ISC tools such as bind and dhcp use. Lines starting with <literal>//</literal> are treated as comments (ignored), as well as all text between <literal>/*</literal> and <literal>*/</literal>, just like C/C++ comments. Each line is of the form <literal>APT::Get::Assume-Yes "true";</literal>. The trailing semicolon and the quotes are required. The value must be on one line, and there is no kind of string concatenation. It must not include inside quotes. The behavior of the backslash "\" and escaped characters inside a value is undefined and it should not be used. An option name may include alphanumerical characters and the "/-:._+" characters. A new scope can be opened with curly braces, like:
de: Syntaktisch ist die Konfigurationssprache dem nachempfunden, was die ISC-Werkzeuge, wie bind und dhcp, benutzen. Zeilen, die mit <literal>//</literal> beginnen, werden als Kommentar betrachtet (und ignoriert), ebenso wie jeglicher Text zwischen <literal>/*</literal> und <literal>*/</literal>, wie bei C/C++-Kommentaren. Jede Zeile hat die Form <literal>APT::Get::Assume-Yes "true";</literal>. Das abschließende Semikolon und die Anführungszeichen werden benötigt. Der Wert muss in einer Zeile stehen und es gibt keine Möglichkeit Zeichenketten aneinander zu hängen. Er darf keine inneren Anführungszeichen enthalten. Das Verhalten des Backslashs »\« und maskierter Zeichen innerhalb eines Wertes ist nicht festgelegt und diese sollten nicht benutzt werden. Ein Optionsname darf alphanumerische Zeichen und die Zeichen »/-:._+« enthalten. Ein neuer Geltungsbereich kann mit geschweiften Klammern geöffnet werden, wie:
es: Sintácticamente, el modelo del lenguaje de configuración es similar a las herramientas de ISC como pueden ser «bind» y «dhcp». Las líneas que comienzan con <literal>//</literal> se tratan como comentarios (se ignoran), así como todo el texto que haya entre <literal>/*</literal> y <literal>*/</literal>, igual que en los comentarios de C/C++. Cada línea tiene la forma <literal>APT::Get::Assume-Yes "true";</literal>. El punto y coma del final y las comillas son necesarias. El valor debe estar en única línea y no hay posibilidad de concatenar cadenas. No puede incluir comillas internas. El comportamiento de barras inversas «\» y caracteres de escape dentro de un valor no está definido y no se debería usar. Un nombre de una opción debería incluir caracteres alfanuméricos y los caracteres «/-:._+». Un nuevo ámbito se puede abrir con llaves, como:

source: with newlines placed to make it more readable. Lists can be created by opening a scope and including a single string enclosed in quotes followed by a semicolon. Multiple entries can be included, each separated by a semicolon.
de: mit eingefügten Zeilenumbrüchen, um es leserlicher zu gestalten. Listen können erstellt werden, indem ein Geltungsbereich geöffnet wird und eine einzelne, von Anführungszeichen, denen ein Semikolon folgt, eingeschlossene Zeichenkette eingefügt wird. Es können mehrere Einträge eingefügt werden, jeweils getrennt durch ein Semikolon.
es: con nuevas líneas ubicadas para hacerlo más legible. Las listas pueden crearse abriendo un nuevo ámbito e incluyendo una única cadena acotada entre comillas seguida de un punto y coma. Se pueden incluir varias entradas, cada una separada por un punto y coma.

source: In general the sample configuration file in <filename>&docdir;examples/apt.conf</filename> &configureindex; is a good guide for how it should look.
de: Im Allgemeinen bietet die Beispielkonfigurationsdatei in <filename>&docdir;examples/apt.conf</filename> &configureindex; eine gute Anleitung, wie dies aussehen könnte.
es: En general, el fichero de configuración de ejemplo <filename>&docdir;examples/apt.conf</filename> &configureindex; es una buena guía para entender su aspecto.
