Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: The general form assigns a priority to all of the package versions in a given distribution (that is, to all the versions of packages that are listed in a certain <filename>Release</filename> file) or to all of the package versions coming from a particular Internet site, as identified by the site's fully qualified domain name.
de: Die allgemeine Form weist allen Paketversionen in einer gegebenen Distribution (d.h. allen Versionen von Paketen, die in einer bestimmten <filename>Release</filename>-Datei gelistet sind) oder allen Paketversionen, die von einer speziellen Internet-Site kommen, die durch ihren voll ausgebildeten Domänennamen identifiziert wird, eine Priorität zu.
es: El formato «general» asigna una prioridad a todas las versiones de los paquetes en una distribución (esto es, a todas las versiones de paquetes listados en un fichero <filename>Release</filename> particular), o a todas las versiones de un paquete provenientes de un sitio concreto en Internet, identificado por su nombre de dominio.

source: This general-form entry in the APT preferences file applies only to groups of packages. For example, the following record assigns a high priority to all package versions available from the local site.
de: Dieser Eintrag in allgemeiner Form in der APT-Einstellungsdatei verwendet nur Gruppen von Paketen. Der folgende Eintrag weist zum Beispiel allen Paketversionen eine hohe Priorität zu, die lokal liegen.
es: Esta entrada con formato general en el fichero de preferencias de APT sólo afecta a grupos de paquetes. Por ejemplo, el siguiente registro asigna una prioridad alta a todas las versiones disponibles desde un sitio local.

source: A note of caution: the keyword used here is "<literal>origin</literal>" which can be used to match a hostname. The following record will assign a high priority to all versions available from the server identified by the hostname "ftp.de.debian.org"
de: Eine Mahnung zur Vorsicht: Das hier benutzte Schlüsselwort ist »<literal>origin</literal>«, was zum Finden des Rechnernamens benutzt werden kann. Der folgende Eintrag wird allen Versionen eine hohe Priorität zuweisen, die auf dem Server verfügbar sind, der durch den Rechnernamen »ftp.de.debian.org« identifiziert wird.
es: Una nota de aviso: la palabra clave usada aquí es «<literal>origin</literal>», el cual se puede usar para coincidir con un nombre de sistema. El siguiente registro asignará una prioridad alta a todas las versiones disponibles desde el servidor identificado con el nombre de sistema «ftp.de.debian.org».

source: This should <emphasis>not</emphasis> be confused with the Origin of a distribution as specified in a <filename>Release</filename> file. What follows the "Origin:" tag in a <filename>Release</filename> file is not an Internet address but an author or vendor name, such as "Debian" or "Ximian".
de: Dies sollte nicht mit der Herkunft einer Distribution verwechselt werden, wie sie in einer <filename>Release</filename>-Datei angegeben wurde. Was dem »Origin:«-Kennzeichen in einer <filename>Release</filename>-Datei folgt, ist keine Internet-Adresse, sondern ein Autoren- oder Anbietername, wie »Debian« oder »Ximian«.
es: <emphasis>No</emphasis> se debe confundir con el origen («Origin») de una distribución tal y como se especifica un fichero <filename>Release</filename>. Lo que sigue a la etiqueta «Origin:» en un fichero <filename>Release</filename> no es la dirección de un sitio de Internet, sino el autor o el nombre del proveedor, tales como «Debian» o «Ximian».

source: The following record assigns a low priority to all package versions belonging to any distribution whose Archive name is "<literal>unstable</literal>".
de: Der folgende Datensatz weist allen Paketversionen, die zu Distributionen gehören, deren Archivname »<literal>unstable</literal>« ist, eine niedrige Priorität zu.
es: El siguiente registro asigna una prioridad baja a todas las versiones de los paquetes pertenecientes a cualquier distribución que tenga como nombre de archivo de paquetes «<literal>unstable</literal>» (inestable).

source: The following record assigns a high priority to all package versions belonging to any distribution whose Codename is "<literal>&testing-codename;</literal>".
de: Der folgende Datensatz weist allen Paketversionen, die zu einer Distribution gehören, deren Codename »<literal>&testing-codename;</literal>« ist, eine hohe Priorität zu.
es: El siguiente registro asigna una prioridad alta a todas las versiones de los paquetes pertenecientes a cualquier distribución que tenga como nombre clave «<literal>&testing-codename;</literal>».

source: The following record assigns a high priority to all package versions belonging to any release whose Archive name is "<literal>stable</literal>" and whose release Version number is "<literal>3.0</literal>".
de: Der folgende Datensatz weist allen Paketversionen, die zu einer Distribution gehören, deren Archivname »<literal>stable</literal>« und deren Release-Nummer »<literal>3.0</literal>« ist, eine hohe Priorität zu.
es: El siguiente registro asigna una prioridad alta a todas las versiones de los paquetes pertenecientes a cualquier publicación que tenga como nombre de archivo de paquetes «<literal>stable</literal>» y como número de versión «<literal>3.0</literal>».

source: Regular expressions and glob() syntax
de: Reguläre Ausdrücke und glob()-Syntax

source: How APT Interprets Priorities
de: Wie APT Prioritäten interpretiert
es: ¿Cómo interpreta APT las prioridades?

source: causes a version to be installed even if this constitutes a downgrade of the package
de: veranlasst, dass eine Version installiert wird, auch wenn dies ein Downgrade des Pakets durchführt
es: La versión se instala incluso si es una versión anterior a la instalada en el sistema.

source: causes a version to be installed even if it does not come from the target release, unless the installed version is more recent
de: veranlasst, dass eine Version installiert wird, auch wenn diese nicht vom Ziel-Release kommt, außer wenn die installierte Version aktueller ist
es: La versión se instala aunque no venga de la distribución objetivo, a menos que la versión instalada sea más reciente.

source: causes a version to be installed unless there is a version available belonging to the target release or the installed version is more recent
de: veranlasst, dass eine Version installiert wird, außer wenn eine Version verfügbar ist, die zum Ziel-Release gehört oder die installierte Version neuer ist
es: La versión se instala a menos que exista otro ejemplar disponible perteneciente a la distribución objetivo, o bien si la versión instalada es más reciente.

source: causes a version to be installed unless there is a version available belonging to some other distribution or the installed version is more recent
de: veranlasst, dass eine Version installiert wird, außer wenn eine Version verfügbar ist, die zu einer anderen Distribution gehört oder die installierte Version neuer ist
es: La versión se instala a menos que exista una versión disponible perteneciente a otra distribución, o si la versión instalada es más reciente.

source: causes a version to be installed only if there is no installed version of the package
de: veranlasst, dass eine Version nur dann installiert wird, wenn es keine installierte Version des Pakets gibt
es: La versión sólo se instala si no hay ninguna versión del paquete instalada.

source: prevents the version from being installed
de: verhindert das Installieren der Version
es: Evita la instalación de la versión.

source: Priorities (P) assigned in the APT preferences file must be positive or negative integers. They are interpreted as follows (roughly speaking): <placeholder type="variablelist" id="0"/>
de: Die in der APT-Einstellungsdatei zugewiesenen Prioritäten (P) müssen positive oder negative Ganzzahlen sein. Sie werden wie folgt interpretiert (grob gesagt): <placeholder type="variablelist" id="0"/>
es: Las prioridades (P) asignadas en el fichero de preferencias deben ser números enteros positivos o negativos. Se interpretan (en general) del siguiente modo: <placeholder type="variablelist" id="0"/>

source: If any specific-form records match an available package version then the first such record determines the priority of the package version. Failing that, if any general-form records match an available package version then the first such record determines the priority of the package version.
de: Wenn irgendwelche Datensätze mit speziellem Format zu einer verfügbaren Paketversion passen, dann legt der erste dieser Datensätze die Priorität der Paketversion fest. Schlägt dies fehl und es passen irgendwelche Datensätze mit allgemeinem Format zu einer verfügbaren Paketversion, dann legt der erste dieser Datensätze die Priorität der Paketversion fest.
es: Si cualquier registro con formato específico coincide con una versión disponible de un paquete, el registro determina la prioridad de la versión del paquete. De no ser así, y si cualquier número de registros con formato general coinciden con una versión, el primero determina la prioridad de la versión del paquete.

source: For example, suppose the APT preferences file contains the three records presented earlier:
de: Nehmen wir zum Beispiel an, die APT-Einstellungsdatei enthält die drei bereits gezeigten Datensätze:
es: Por ejemplo, suponga que el fichero de preferencias de APT contiene los tres registros antes mencionados:

source: Then:
de: Dann:
es: Por ello:

source: The most recent available version of the <literal>perl</literal> package will be installed, so long as that version's version number begins with "<literal>5.8</literal>". If <emphasis>any</emphasis> 5.8* version of <literal>perl</literal> is available and the installed version is 5.9*, then <literal>perl</literal> will be downgraded.
de: Es wird die aktuellste verfügbare Version des Pakets <literal>perl</literal> installiert, so lange die Versionsnummer mit »<literal>5.8</literal>« anfängt. Wenn <emphasis>irgendeine</emphasis> 5.8*-Version von <literal>perl</literal> verfügbar ist und die installierte Version 5.9* ist, dann wird von <literal>perl</literal> ein Downgrade durchgeführt.
es: La versión más reciente disponible del paquete <literal>perl</literal> se instalará siempre que el número de versión empiece con «<literal>5.8</literal>». De existir <emphasis>cualquier</emphasis> versión 5.8* disponible de <literal>perl</literal>, y si la versión instalada es 5.9*, se instalará la versión 5.8*, desactualizando el paquete.

source: A version of any package other than <literal>perl</literal> that is available from the local system has priority over other versions, even versions belonging to the target release.
de: Eine Version irgendeines anderen Pakets als <literal>perl</literal>, die vom lokalen System verfügbar ist, hat eine Priorität über anderen Versionen, sogar wenn diese Versionen zum Ziel-Release gehören.
es: Cualquier otra versión de un paquete distinto de <literal>perl</literal> disponible desde el sistema local tiene prioridad sobre el resto de las versiones, incluso sobre los pertenecientes a la distribución objetivo.

source: A version of a package whose origin is not the local system but some other site listed in &sources-list; and which belongs to an <literal>unstable</literal> distribution is only installed if it is selected for installation and no version of the package is already installed.
de: Eine Version eines Pakets, dessen Ursprung nicht das lokale System ist, aber ein anderer in &sources-list; aufgelisteter Ort und der zu einer <literal>unstable</literal>-Distribution gehört, wird nur installiert, falls es zur Installation ausgewählt wurde und nicht bereits eine Version des Pakets installiert ist.
es: Otras versiones que tengan un origen distinto al sistema local listadas en «&sources-list;» y que pertenezcan a la distribución <literal>unstable</literal> sólo se instalarán si se seleccionan para su instalación y si no hay ninguna versión del paquete ya instalado.

source: Determination of Package Version and Distribution Properties
de: Festlegung von Paketversion und Distributions-Eigenschaften
es: Determinar la versión del paquete y las propiedades de la distribución

source: The locations listed in the &sources-list; file should provide <filename>Packages</filename> and <filename>Release</filename> files to describe the packages available at that location.
de: Die in der &sources-list;-Datei aufgelisteten Orte sollten <filename>Packages</filename>- und <filename>Release</filename>-Dateien bereitstellen, um die an diesem Ort verfügbaren Pakete zu beschreiben.
es: Los recursos listados en el fichero «&sources-list;» deben proporcionar los ficheros <filename>Packages</filename> y <filename>Release</filename>. Éstos describen los paquetes disponibles en cada uno de los sitios.

source: the <literal>Package:</literal> line
de: die <literal>Package:</literal>-Zeile
es: La línea <literal>Package:</literal>

source: gives the package name
de: gibt den Paketnamen an
es: indica el nombre del paquete.

source: the <literal>Version:</literal> line
de: die <literal>Version:</literal>-Zeile
es: La línea <literal>Version:</literal>

source: gives the version number for the named package
de: gibt die Versionsnummer für das genannte Paket an
es: indica el número de versión del paquete.

source: The <filename>Packages</filename> file is normally found in the directory <filename>.../dists/<replaceable>dist-name</replaceable>/<replaceable>component</replaceable>/<replaceable>arch</replaceable></filename>: for example, <filename>.../dists/stable/main/binary-i386/Packages</filename>. It consists of a series of multi-line records, one for each package available in that directory. Only two lines in each record are relevant for setting APT priorities: <placeholder type="variablelist" id="0"/>
de: Die <filename>Packages</filename>-Datei wird normalerweise im Verzeichnis <filename>…/dists/<replaceable>Distributions-Name</replaceable>/<replaceable>Komponente</replaceable>/<replaceable>Architektur</replaceable></filename> gefunden, zum Beispiel <filename>…/dists/stable/main/binary-i386/Packages</filename>. Sie besteht aus einer Serie mehrzeiliger Datensätze, einem für jedes verfügbare Paket in diesem Verzeichnis. In jedem Datensatz sind nur zwei Zeilen zum Setzen der APT-Prioritäten relevant: <placeholder type="variablelist" id="0"/>
es: El fichero <filename>Packages</filename> se suele encontrar en el directorio <filename>.../dists/<replaceable>nombre-dist</replaceable>/<replaceable>componente</replaceable>/<replaceable>arquitectura</replaceable></filename>, por ejemplo, <filename>.../dists/stable/main/binary-i386/Packages</filename>. Este fichero consiste en una serie de registros de varias líneas, uno por cada paquete disponible en ese directorio. Sólo dos líneas en cada registro son relevantes a la hora de definir las prioridades de APT: <placeholder type="variablelist" id="0"/>

source: the <literal>Archive:</literal> or <literal>Suite:</literal> line
de: die <literal>Archive:</literal>- oder <literal>Suite:</literal>-Zeile
es: Las líneas <literal>Archive:</literal> o <literal>Suite:</literal>

source: names the archive to which all the packages in the directory tree belong. For example, the line "Archive: stable" or "Suite: stable" specifies that all of the packages in the directory tree below the parent of the <filename>Release</filename> file are in a <literal>stable</literal> archive. Specifying this value in the APT preferences file would require the line:
de: benennt das Archiv, zu dem alle Pakete im Verzeichnisbaum gehören. Die Zeile »Archive: stable« oder »Suite: stable« gibt zum Beispiel an, dass alle Pakete im Verzeichnisbaum unterhalb des der <filename>Release</filename>-Datei übergeordneten Verzeichnisses sich in einem <literal>stable</literal>-Archiv befinden. Diesen Wert in der APT-Einstellungsdatei anzugeben würde die folgende Zeile benötigen:
es: indican el nombre del archivo al que pertenecen todos los paquetes del árbol de directorios. Por ejemplo, la línea «Archive: stable» o «Suite: stable» especifica que todos los paquetes en el árbol de directorios por debajo del directorio raíz marcado en el fichero <filename>Release</filename> están en un archivo «<literal>stable</literal>» (estable). Para especificar una preferencia de acuerdo con este parámetro tendrá que insertar la siguiente línea en el fichero de preferencias de APT:

source: the <literal>Codename:</literal> line
de: die <literal>Codename:</literal>-Zeile
es: La línea <literal>Codename:</literal>

source: names the codename to which all the packages in the directory tree belong. For example, the line "Codename: &testing-codename;" specifies that all of the packages in the directory tree below the parent of the <filename>Release</filename> file belong to a version named <literal>&testing-codename;</literal>. Specifying this value in the APT preferences file would require the line:
de: benennt den Codenamen, zu dem alle Pakete im Verzeichnisbaum gehören. Die Zeile »Codename: &testing-codename;« gibt zum Beispiel an, dass alle Pakete im Verzeichnisbaum unterhalb des der <filename>Release</filename>-Datei übergeordneten Verzeichnisses zu einer Version mit Namen <literal>&testing-codename;</literal> gehören. Diesen Wert in der APT-Einstellungsdatei anzugeben würde die folgende Zeile benötigen:
es: indica el nombre de la distribución a la que pertenecen todos los paquetes del árbol de directorios. Por ejemplo, la línea «Codename: &testing-codename;» especifica que todos los paquetes en el árbol de directorios por debajo del directorio padre marcado en el fichero <filename>Release</filename> pertenecen a la versión llamada <literal>&testing-codename;</literal>. Para especificar una preferencia de acuerdo con este parámetro tendrá que poner una de las siguientes líneas en el fichero de preferencias de APT:

source: names the release version. For example, the packages in the tree might belong to Debian GNU/Linux release version 3.0. Note that there is normally no version number for the <literal>testing</literal> and <literal>unstable</literal> distributions because they have not been released yet. Specifying this in the APT preferences file would require one of the following lines.
de: benennt die Release-Version. Die Pakete im Baum könnten zum Beispiel zur Debian GNU/Linux-Release-Version 3.0 gehören. Beachten Sie, dass es normalerweise keine Versionsnummer für <literal>testing</literal>- und <literal>unstable</literal>-Distributionen gibt, weil sie noch nicht veröffentlicht wurden. Diese in der APT-Einstellungsdatei anzugeben würde eine der folgenden Zeilen benötigen:
es: nombra la versión de la publicación. Por ejemplo, los paquetes en el árbol pueden pertenecer a la versión 3.0 de Debian GNU/Linux. Observe que, generalmente, <literal>testing</literal> y <literal>unstable</literal> no tienen una versión asignada porque no se han publicado. Para especificar una preferencia de acuerdo con este parámetro tendrá que poner una de las siguientes línea en el fichero de preferencias de APT:

source: the <literal>Component:</literal> line
de: die <literal>Component:</literal>-Zeile
es: La línea <literal>Component:</literal>

source: names the licensing component associated with the packages in the directory tree of the <filename>Release</filename> file. For example, the line "Component: main" specifies that all the packages in the directory tree are from the <literal>main</literal> component, which entails that they are licensed under terms listed in the Debian Free Software Guidelines. Specifying this component in the APT preferences file would require the line:
de: benennt die Lizenzierungskomponente, die mit den Paketen im Verzeichnisbaum der <filename>Release</filename>-Datei verbunden ist. Die Zeile »Component: main« gibt zum Beispiel an, dass alle Pakete im Verzeichnisbaum von der <literal>main</literal>-Komponente stammen, was zur Folge hat, dass sie unter den Bedingungen der Debian-Richtlinien für Freie Software stehen. Diese Komponente in der APT-Einstellungsdatei anzugeben würde die folgende Zeilen benötigen:
es: indica la licencia asociada a los paquetes en el árbol de directorios correspondiente al fichero <filename>Release</filename>. Por ejemplo, la línea <literal>Component: main</literal> especifica que todos los paquetes en el árbol de directorios pertenecen a la sección <literal>main</literal>, lo cual asegura que su licencia se ajusta a las Directrices sobre software libre de Debian (DFSG). Para especificar una preferencia de acuerdo con este parámetro tendrá que poner la siguiente línea en el fichero de preferencias de APT:

source: the <literal>Origin:</literal> line
de: die <literal>Origin:</literal>-Zeile
es: La línea <literal>Origin:</literal>

source: names the originator of the packages in the directory tree of the <filename>Release</filename> file. Most commonly, this is <literal>Debian</literal>. Specifying this origin in the APT preferences file would require the line:
de: benennt den Urheber des Pakets im Verzeichnisbaum der <filename>Release</filename>-Datei. Zumeist ist dies <literal>Debian</literal>. Diesen Ursprung in der APT-Einstellungsdatei anzugeben würde die folgende Zeile benötigen:
es: indica la procedencia de los paquetes en el árbol de directorios del fichero <filename>Release</filename>. La fuente más común es <literal>Debian</literal>. Puede definir esta fuente en el fichero de preferencias de APT mediante la siguiente línea:

source: the <literal>Label:</literal> line
de: die <literal>Label:</literal>-Zeile
es: La línea <literal>Label:</literal>

source: names the label of the packages in the directory tree of the <filename>Release</filename> file. Most commonly, this is <literal>Debian</literal>. Specifying this label in the APT preferences file would require the line:
de: benennt die Beschriftung des Pakets im Verzeichnisbaum der <filename>Release</filename>-Datei. Zumeist ist dies <literal>Debian</literal>. Diese Beschriftung in der APT-Einstellungsdatei anzugeben würde die folgende Zeile benötigen:
es: nombra la etiqueta de los paquetes en los árboles de directorios del fichero <filename>Release</filename>. Generalmente, es <literal>Debian</literal>. Puede definir esta etiqueta en el fichero de preferencias de APT mediante la siguiente línea:
