Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: <!-- TRANSLATOR: This is a placeholder. You should write here who has contributed to the translation in the past, who is responsible now and maybe further information specially related to your translation. --> <!ENTITY translation-holder " The english translation was done by John Doe <email>john@doe.org</email> in 2009, 2010 and Daniela Acme <email>daniela@acme.us</email> in 2010 together with the Debian Dummy l10n Team <email>debian-l10n-dummy@lists.debian.org</email>. ">
de: <!ENTITY translation-holder " Die deutsche Übersetzung wurde 2009 von Chris Leick <email>c.leick@vollbio.de</email> in Zusammenarbeit mit dem deutschen l10n-Team von Debian <email>debian-l10n-german@lists.debian.org</email> angefertigt. ">
es: <!-- TRANSLATOR: This is a placeholder. You should write here who has contributed to the translation in the past, who is responsible now and maybe further information specially related to your translation. --> <!ENTITY translation-holder " La traducción al español la realizaron Ismael Fanlo, Carlos Mestre, Rudy Godoy, Gustavo Saldumbide, Javier Fernández-Sanguino y Rubén Porras Campo entre los años 2003 y 2004. La traducción fue actualizada por Francisco Javier Cuadrado y Omar Campagne Polaino entre los años 2009 y 2010. ">

source: <!-- TRANSLATOR: As a translation is allowed to have 20% of untranslated/fuzzy strings in a shipped manpage newer/modified paragraphs will maybe appear in english in the generated manpage. This sentence is therefore here to tell the reader that this is not a mistake by the translator - obviously the target is that at least for stable releases this sentence is not needed. :) --> <!ENTITY translation-english " Note that this translated document may contain untranslated parts. This is done on purpose, to avoid losing content when the translation is lagging behind the original content. ">
de: <!ENTITY translation-english " Beachten Sie, dass diese Übersetzung Teile enthalten kann, die nicht übersetzt wurden. Dies ist so, damit kein Inhalt verloren geht, wenn die Übersetzung hinter dem Originalinhalt hinterherhängt. ">
es: <!-- TRANSLATOR: As a translation is allowed to have 20% of untranslated/fuzzy strings in a shipped manpage newer/modified paragraphs will maybe appear in english in the generated manpage. This sentence is therefore here to tell the reader that this is not a mistake by the translator - obviously the target is that at least for stable releases this sentence is not needed. :) --> <!ENTITY translation-english " Tenga en cuenta que este documento puede contener secciones sin traducir. Esto es intencionado para evitar perder contenido cuando la traducción no está actualizada con respecto al documento original. ">

source: &apt-author.jgunthorpe; &apt-author.team; &apt-email; &apt-product; <date>04 February 2011</date>
de: &apt-author.jgunthorpe; &apt-author.team; &apt-email; &apt-product; <date>04. Februar 2011</date>

source: query the APT cache
de: den APT-Zwischenspeicher abfragen

source: <command>apt-cache</command> <arg><option>-hvsn</option></arg> <arg><option>-o=<replaceable>config string</replaceable></option></arg> <arg><option>-c=<replaceable>file</replaceable></option></arg> <group choice="req"> <arg>gencaches</arg> <arg>showpkg <arg choice="plain" rep="repeat"><replaceable>pkg</replaceable></arg></arg> <arg>showsrc <arg choice="plain" rep="repeat"><replaceable>pkg</replaceable></arg></arg> <arg>stats</arg> <arg>dump</arg> <arg>dumpavail</arg> <arg>unmet</arg> <arg>search <arg choice="plain"><replaceable>regex</replaceable></arg></arg> <arg>show <arg choice="plain" rep="repeat"><replaceable>pkg</replaceable></arg></arg> <arg>depends <arg choice="plain" rep="repeat"><replaceable>pkg</replaceable></arg></arg> <arg>rdepends <arg choice="plain" rep="repeat"><replaceable>pkg</replaceable></arg></arg> <arg>pkgnames <arg choice="plain"><replaceable>prefix</replaceable></arg></arg> <arg>dotty <arg choice="plain" rep="repeat"><replaceable>pkg</replaceable></arg></arg> <arg>xvcg <arg choice="plain" rep="repeat"><replaceable>pkg</replaceable></arg></arg> <arg>policy <arg choice="plain" rep="repeat"><replaceable>pkgs</replaceable></arg></arg> <arg>madison <arg choice="plain" rep="repeat"><replaceable>pkgs</replaceable></arg></arg> </group>
de: <command>apt-cache</command> <arg><option>-hvsn</option></arg> <arg><option>-o=<replaceable>Konfigurationszeichenkette</replaceable></option></arg> <arg><option>-c=<replaceable>Datei</replaceable></option></arg> <group choice="req"> <arg>gencaches</arg> <arg>showpkg <arg choice="plain" rep="repeat"><replaceable>Paket</replaceable></arg></arg> <arg>showsrc <arg choice="plain" rep="repeat"><replaceable>Paket</replaceable></arg></arg> <arg>stats</arg> <arg>dump</arg> <arg>dumpavail</arg> <arg>unmet</arg> <arg>search <arg choice="plain"><replaceable>regulärer_Ausdruck</replaceable></arg></arg> <arg>show <arg choice="plain" rep="repeat"><replaceable>Paket</replaceable></arg></arg> <arg>depends <arg choice="plain" rep="repeat"><replaceable>Paket</replaceable></arg></arg> <arg>rdepends <arg choice="plain" rep="repeat"><replaceable>Paket</replaceable></arg></arg> <arg>pkgnames <arg choice="plain"><replaceable>Präfix</replaceable></arg></arg> <arg>dotty <arg choice="plain" rep="repeat"><replaceable>Paket</replaceable></arg></arg> <arg>xvcg <arg choice="plain" rep="repeat"><replaceable>Paket</replaceable></arg></arg> <arg>policy <arg choice="plain" rep="repeat"><replaceable>Pakete</replaceable></arg></arg> <arg>madison <arg choice="plain" rep="repeat"><replaceable>Pakete</replaceable></arg></arg> </group>

source: Description
de: Beschreibung
es: Descripción

source: <command>apt-cache</command> performs a variety of operations on APT's package cache. <command>apt-cache</command> does not manipulate the state of the system but does provide operations to search and generate interesting output from the package metadata.
de: <command>apt-cache</command> führt eine Vielzahl von Operationen auf dem Paketzwischenspeicher von APT durch. <command>apt-cache</command> manipuliert nicht den Status des Systems, stellt aber Operationen zum Suchen und Generieren von interessanten Ausgaben der Paket-Metadaten bereit.
es: <command>apt-cache</command> realiza una serie de operaciones sobre la caché (registro o lista) de paquetes de APT. <command>apt-cache</command> no modifica el estado del sistema pero proporciona operaciones de búsqueda y genera información interesante a partir de los metadatos del paquete.

source: Unless the <option>-h</option>, or <option>--help</option> option is given, one of the commands below must be present.
de: Sofern nicht die <option>-h</option>-, oder <option>--help</option>-Option angegeben ist, muss einer der unten aufgeführten Befehle vorkommen.
es: A menos que se use la opción <option>-h</option> o <option>--help</option>, una de las siguientes órdenes debe estar presente.

source: <literal>gencaches</literal> performs the same operation as <command>apt-get check</command>. It builds the source and package caches from the sources in &sources-list; and from <filename>/var/lib/dpkg/status</filename>.
de: <literal>gencaches</literal> führt die gleichen Operationen wie <command>apt-get check</command> durch. Es bildet die Quellen- und Paketzwischenspeicher aus den Quellen in &sources-list; und von <filename>/var/lib/dpkg/status</filename>.
es: <literal>gencaches</literal> realiza la misma operación que <command>apt-get check</command>. Genera las caches de los paquetes fuente y de los paquetes binarios a partir de la lista de fuentes en &sources-list; y a partir de <filename>/var/lib/dpkg/status</filename>.

source: showpkg <replaceable>pkg(s)</replaceable>
de: showpkg <replaceable>Paket(e)</replaceable>
es: showpkg <replaceable>paquete(s)</replaceable>

source: <literal>showpkg</literal> displays information about the packages listed on the command line. Remaining arguments are package names. The available versions and reverse dependencies of each package listed are listed, as well as forward dependencies for each version. Forward (normal) dependencies are those packages upon which the package in question depends; reverse dependencies are those packages that depend upon the package in question. Thus, forward dependencies must be satisfied for a package, but reverse dependencies need not be. For instance, <command>apt-cache showpkg libreadline2</command> would produce output similar to the following:
de: <literal>showpkg</literal> zeigt Informationen über die auf der Befehlszeile aufgelisteten Pakete. Die übrigen Argumente sind Paketnamen. Die verfügbaren Versionen und Rückwärtsabhängigkeiten jedes aufgeführten Paketes werden ebenso aufgelistet, wie die Vorwärtsabhängigkeiten jeder Version. Vorwärtsabhängigkeiten (normale Abhängigkeiten) sind jene Pakete, von denen das betreffende Paket abhängt. Rückwärtsabhängigkeiten sind jene Pakete, die von dem betreffenden Paket abhängen. Deshalb müssen Vorwärtsabhängigkeiten für das Paket erfüllt werden, Rückwärtsabhängigkeiten allerdings nicht. <command>apt-cache showpkg libreadline2</command> würde zum Beispiel eine Ausgabe ähnlich der folgenden erzeugen:
es: <literal>showpkg</literal> muestra la información relativa a los paquetes listados en la línea de órdenes. Los argumentos restantes se consideran nombres de paquetes. Para cada paquete de la lista se listan las versiones y dependencias inversas disponibles, así como las dependencias de cada versión. Las dependencias (normales) son los paquetes de los que depende el paquete en cuestión, las dependencias inversas son los paquetes que dependen del paquete en cuestión. Por ello, las dependencias se deben satisfacer para un paquete, pero las dependencias inversas no. Por ejemplo, <command>apt-cache showpkg libreadline2</command> produciría una salida similar a la siguiente:

source: Thus it may be seen that libreadline2, version 2.1-12, depends on libc5 and ncurses3.0 which must be installed for libreadline2 to work. In turn, libreadlineg2 and libreadline2-altdev depend on libreadline2. If libreadline2 is installed, libc5 and ncurses3.0 (and ldso) must also be installed; libreadlineg2 and libreadline2-altdev do not have to be installed. For the specific meaning of the remainder of the output it is best to consult the apt source code.
de: Dadurch sieht man, dass libreadline2, Version 2.1-12, von libc5 und ncurses3.0 abhängt, die installiert sein müssen, damit libreadline2 funktioniert. Im Gegenzug hängen libreadlineg2 und libreadline2-altdev von libreadline2 ab. Wenn libreadline2 installiert ist, müssen außerdem libc5 und ncurses3.0 (und ldso) installiert sein. Für die spezielle Bedeutung der restlichen Ausgabe ist es am besten, den apt-Quelltext zu konsultieren.
es: La información de salida muestra que libreadline2, con versión 2.1-12, depende de libc5 y ncurses3.0, que se deben instalar para que libreadline2 funcione. Además, libreadlineg2 y libreadline2-altdev dependen de libreadline2. De modo que si libreadline2 está instalado, libc5 y ncurses3.0 (y ldso) también deben estar instalados, pero libreadlineg2 y libreadline2-altdev no tienen que estarlo. Para el significado específico del resto de la salida lo mejor es consultar el código fuente de apt.

source: <literal>stats</literal> displays some statistics about the cache. No further arguments are expected. Statistics reported are:
de: <literal>stats</literal> zeigt einige Statistiken über den Zwischenspeicher. Es werden keine weiteren Argumente erwartet. Berichtete Statistiken sind:
es: <literal>stats</literal> muestra algunas estadísticas sobre la caché. No necesita ningún argumento adicional. Las estadísticas que muestra son:

source: <literal>Total package names</literal> is the number of package names found in the cache.
de: <literal>Total package names</literal> ist die Gesamtzahl der im Zwischenspeicher gefundenen Pakete.
es: <literal>Total de nombres de paquetes</literal> es el número de paquetes encontrados en la caché.

source: <literal>Normal packages</literal> is the number of regular, ordinary package names; these are packages that bear a one-to-one correspondence between their names and the names used by other packages for them in dependencies. The majority of packages fall into this category.
de: <literal>Normal packages</literal> ist die Anzahl der regulären, gewöhnlichen Paketnamen. Diese sind Pakete, die eine Eins-zu-Eins-Entsprechung zwischen ihren Namen und den Namen, die andere Pakete für ihre Abhängigkeiten benutzen, tragen. Die Mehrzahl der Pakete fällt in diese Kategorie.
es: <literal>Paquetes normales</literal> es el número de nombres de paquetes normales. Estos paquetes tienen una correspondencia unívoca entre sus nombres y los nombres que usan otros paquetes al listarlos en sus dependencias. La mayoría de los paquetes pertenecen a este grupo.

source: <literal>Pure virtual packages</literal> is the number of packages that exist only as a virtual package name; that is, packages only "provide" the virtual package name, and no package actually uses the name. For instance, "mail-transport-agent" in the Debian GNU/Linux system is a pure virtual package; several packages provide "mail-transport-agent", but there is no package named "mail-transport-agent".
de: <literal>Pure virtual packages</literal> ist die Anzahl der Pakete, die nur als ein virtueller Paketname existieren. Das kommt vor, wenn Pakete nur den virtuellen Paketnamen »bereitstellen« und aktuell kein Paket den Namen benutzt. Zum Beispiel ist im Debian-GNU/Linux-System »mail-transport-agent« ein rein virtuelles Paket. Mehrere Pakete stellen »mail-transport-agent« bereit, aber es gibt kein Paket mit dem Namen »mail-transport-agent«.
es: <literal>Paquetes virtuales puros</literal> es el número de paquetes que existen sólo como nombre de un paquete virtual, esto es, paquetes que sólo «proporcionan» el nombre del paquete virtual, y no hay ningún paquete más que use el nombre. Por ejemplo, «mail-transport-agent» en un sistema Debian GNU/Linux es un paquete virtual puro, varios paquetes proporcionan «mail-transport-agent», pero no hay ningún paquete que se llame «mail-transport-agent».

source: <literal>Single virtual packages</literal> is the number of packages with only one package providing a particular virtual package. For example, in the Debian GNU/Linux system, "X11-text-viewer" is a virtual package, but only one package, xless, provides "X11-text-viewer".
de: <literal>Single virtual packages</literal> ist die Anzahl der Pakete mit nur einem Paket, das ein bestimmtes virtuelles Paket bereitstellt. »X11-text-viewer« ist zum Beispiel im Debian-GNU/Linux-System ein virtuelles Paket, aber nur ein Paket, xless, stellt »X11-text-viewer« bereit.
es: <literal>Paquetes virtuales únicos</literal> es el número de paquetes con un único paquete que proporciona un paquete virtual en concreto. Por ejemplo, en un sistema Debian GNU/Linux, «X11-text-viewer» es un paquete virtual, pero sólo un paquete, xless, proporciona «X11-text-viewer».

source: <literal>Mixed virtual packages</literal> is the number of packages that either provide a particular virtual package or have the virtual package name as the package name. For instance, in the Debian GNU/Linux system, "debconf" is both an actual package, and provided by the debconf-tiny package.
de: <literal>Mixed virtual packages</literal> ist die Anzahl der Pakete, die entweder ein bestimmtes virtuelles Paket bereitstellen oder den virtuellen Paketnamen als Paketnamen haben. »debconf« ist zum Beispiel sowohl ein tatsächliches Paket, wird aber auch vom Paket debconf-tiny bereitgestellt.
es: <literal>Paquetes virtuales mixtos</literal> es el número de paquetes que o bien proporcionan un determinado paquete virtual o tienen el mismo nombre como paquete virtual y como paquete normal. Por ejemplo, en un sistema Debian GNU/Linux debconf es a la vez un paquete normal, y lo proporciona el paquete debconf-tiny.

source: <literal>Missing</literal> is the number of package names that were referenced in a dependency but were not provided by any package. Missing packages may be an evidence if a full distribution is not accessed, or if a package (real or virtual) has been dropped from the distribution. Usually they are referenced from Conflicts or Breaks statements.
de: <literal>Missing</literal> ist die Anzahl der Paketnamen, auf die eine Abhängigkeit verweist, die aber von keinem Paket bereitgestellt werden. Fehlende Pakete könnten auftauchen, wenn nicht auf eine vollständige Distribution zugegriffen oder ein (echtes oder virtuelles) Paket aus einer Distribution gestrichen wurde. Normalerweise wird auf sie von Conflicts oder Breaks-Angaben Bezug genommen.
es: <literal>No encontrados</literal> es el número de nombres de paquetes mencionados como dependencia pero que ningún paquete los proporciona. Estos paquetes pueden ser una prueba de que no se tiene acceso a toda la distribución, o de la eliminación de algún paquete (real o virtual) dentro de la distribución. Normalmente se hace referencia a ellos desde los campos «Conflicts» o «Breaks» de la descripción de los paquetes.

source: <literal>Total distinct</literal> versions is the number of package versions found in the cache; this value is therefore at least equal to the number of total package names. If more than one distribution (both "stable" and "unstable", for instance), is being accessed, this value can be considerably larger than the number of total package names.
de: <literal>Total distinct</literal> Versionen ist die Anzahl der im Zwischenspeicher gefundenen Paketversionen. Dieser Wert ist daher meistens gleich der Anzahl der gesamten Paketnamen. Wenn auf mehr als eine Distribution (zum Beispiel »stable« und »unstable« zusammen) zugegriffen wird, kann dieser Wert deutlich größer als die gesamte Anzahl der Paketnamen sein.
es: <literal>Total de versiones distintas</literal> es el número de versiones de paquetes encontradas en la caché, por lo tanto el número es al menos igual al número total de paquetes. Si se encuentra en la caché más de una distribución («estable» e «inestable», por ejemplo) al mismo tiempo, este valor puede ser considerablemente mayor que el número total de paquetes.

source: <literal>Total dependencies</literal> is the number of dependency relationships claimed by all of the packages in the cache.
de: <literal>Total dependencies</literal> ist die Anzahl der Abhängigkeitsbeziehungen, den alle Pakete im Zwischenspeicher beanspruchen.
es: <literal>Total de dependencias</literal> es el número total de relaciones de dependencia de todos los paquetes de la caché.

source: showsrc <replaceable>pkg(s)</replaceable>
de: showsrc <replaceable>Paket(e)</replaceable>
es: showsrc <replaceable>paquete(s)</replaceable>

source: <literal>showsrc</literal> displays all the source package records that match the given package names. All versions are shown, as well as all records that declare the name to be a Binary.
de: <literal>showsrc</literal> zeigt alle Quellpaketdatensätze, die den angegebenen Paketnamen entsprechen. Alle Versionen werden ebenso angezeigt, wie alle Datensätze, die den Namen für ein Programm deklarieren.
es: <literal>showsrc</literal> muestra todos los campos de los paquetes fuente que coinciden con los nombres de los paquetes proporcionados. Se muestran todas las versiones, así como todos los campos cuyo nombre manifiesta que son binarios.

source: <literal>dump</literal> shows a short listing of every package in the cache. It is primarily for debugging.
de: <literal>dump</literal> zeigt einen kurzen Programmausdruck von jedem Paket im Zwischenspeicher. Es dient in erster Linie der Fehlersuche.
es: <literal>dump</literal> muestra una pequeña lista de todos los paquetes en la caché. Fundamentalmente para depuración.

source: <literal>dumpavail</literal> prints out an available list to stdout. This is suitable for use with &dpkg; and is used by the &dselect; method.
de: <literal>dumpavail</literal> gibt eine verfügbare Liste auf stdout aus. Dies ist geeignet für die Benutzung mit &dpkg; und wird für die &dselect;-Methode benutzt.
es: <literal>dumpavail</literal> muestra por la salida estándar una lista de los paquetes disponibles. Esta lista es apropiada para su uso con &dpkg; y, además, la usa el método &dselect;.

source: <literal>unmet</literal> displays a summary of all unmet dependencies in the package cache.
de: <literal>unmet</literal> zeigt die Zusammenfassung aller unerfüllten Abhängigkeiten im Paketzwischenspeicher.
es: <literal>unmet</literal> muestra un resumen de todas las dependencias no satisfechas en la caché de paquetes.

source: show <replaceable>pkg(s)</replaceable>
de: show <replaceable>Paket(e)</replaceable>
es: show <replaceable>paquete(s)</replaceable>

source: <literal>show</literal> performs a function similar to <command>dpkg --print-avail</command>; it displays the package records for the named packages.
de: <literal>show</literal> führt eine Funktion aus, die <command>dpkg --print-avail</command> ähnlich ist. Es zeigt die Paketdatensätze für die genannten Pakete.
es: <literal>show</literal> realiza una función similar a <command>dpkg --print-avail</command>, muestra los campos del paquete para los paquetes nombrados.

source: <literal>search</literal> performs a full text search on all available package lists for the POSIX regex pattern given, see <citerefentry><refentrytitle><command>regex</command></refentrytitle> <manvolnum>7</manvolnum></citerefentry>. It searches the package names and the descriptions for an occurrence of the regular expression and prints out the package name and the short description, including virtual package names. If <option>--full</option> is given then output identical to <literal>show</literal> is produced for each matched package, and if <option>--names-only</option> is given then the long description is not searched, only the package name is.
de: <literal>search</literal> führt eine Volltextsuche in der Liste aller verfügbaren Pakete für das gegebene POSIX-regex-Muster durch, siehe <citerefentry><refentrytitle><command>regex</command></refentrytitle> <manvolnum>7</manvolnum></citerefentry>. Es durchsucht die Paketnamen und die Beschreibungen nach einem Vorkommen des regulären Ausdrucks und gibt den Paketnamen mit einer kurzen Beschreibung, einschließlich virtueller Paketnamen, aus. Wenn <option>--full</option> angegeben wurde, ist die Ausgabe gleich der, die <literal>show</literal> für jedes Paket erzeugt und wenn <option>--names-only</option> angegeben wurde, wird die lange Beschreibung nicht durchsucht, sondern nur der Paketname.
es: <literal>search</literal> realiza una búsqueda de la expresión regular POSIX proporcionada en todo el texto de todos los paquetes disponibles, véase <citerefentry><refentrytitle><command>regex</command></refentrytitle> <manvolnum>7</manvolnum></citerefentry>. Busca la expresión regular tanto en el nombre de los paquetes como en su descripción y muestra el nombre del paquete y una pequeña descripción de éste, incluyendo nombres de paquetes virtuales. Si se proporciona el argumento <option>--full</option> el resultado es igual al que produce <literal>show</literal> para cada paquete, pero si se proporciona el argumento <option>--names-only</option> entonces sólo se busca en el nombre de los paquetes, no en la descripción larga.

source: Separate arguments can be used to specify multiple search patterns that are and'ed together.
de: Separate Argumente können benutzt werden, um mehrere Suchmuster anzugeben, die »und«-verknüpft werden.
es: Se pueden usar argumentos separados para especificar varios patrones de búsqueda que se juntarán mediante una «Y lógica».

source: depends <replaceable>pkg(s)</replaceable>
de: depends <replaceable>Paket(e)</replaceable>
es: depends <replaceable>paquete(s)</replaceable>
