Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: The <filename>Release</filename> file is normally found in the directory <filename>.../dists/<replaceable>dist-name</replaceable></filename>: for example, <filename>.../dists/stable/Release</filename>, or <filename>.../dists/&stable-codename;/Release</filename>. It consists of a single multi-line record which applies to <emphasis>all</emphasis> of the packages in the directory tree below its parent. Unlike the <filename>Packages</filename> file, nearly all of the lines in a <filename>Release</filename> file are relevant for setting APT priorities: <placeholder type="variablelist" id="0"/>
de: Die <filename>Release</filename>-Datei ist normalerweise im Verzeichnis <filename>…/dists/<replaceable>Distributionsname</replaceable></filename> zu finden, zum Beispiel <filename>…/dists/stable/Release</filename> oder <filename>…/dists/&stable-codename;/Release</filename>. Sie besteht aus einem einzelnen mehrzeiligen Datensatz, der auf <emphasis>alle</emphasis> Pakete im Verzeichnisbaum unterhalb des übergeordneten Verzeichnisses zutrifft. Anders als die <filename>Packages</filename>-Datei sind nahezu alle Zeilen in einer <filename>Release</filename>-Datei für das Setzen von APT-Prioritäten relevant: <placeholder type="variablelist" id="0"/>
es: El fichero <filename>Release</filename> se suele encontrar en el directorio <filename>.../dists/<replaceable>nombre-dist</replaceable></filename>, por ejemplo <filename>.../dists/stable/Release</filename> o <filename>.../dists/&stable-codename;/Release</filename>. El fichero consiste en registros de una sola línea que se aplican a <emphasis>todos</emphasis> los paquetes por debajo del directorio padre. Al contrario que el fichero <filename>Packages</filename>, casi todas las líneas del fichero <filename>Release</filename> son relevantes para las prioridades de APT: <placeholder type="variablelist" id="0"/>

source: All of the <filename>Packages</filename> and <filename>Release</filename> files retrieved from locations listed in the &sources-list; file are stored in the directory <filename>/var/lib/apt/lists</filename>, or in the file named by the variable <literal>Dir::State::Lists</literal> in the <filename>apt.conf</filename> file. For example, the file <filename>debian.lcs.mit.edu_debian_dists_unstable_contrib_binary-i386_Release</filename> contains the <filename>Release</filename> file retrieved from the site <literal>debian.lcs.mit.edu</literal> for <literal>binary-i386</literal> architecture files from the <literal>contrib</literal> component of the <literal>unstable</literal> distribution.
de: Alle <filename>Packages</filename>- und <filename>Release</filename>-Dateien, die von Orten heruntergeladen werden, die in der Datei &sources-list; aufgelistet sind, werden im Verzeichnis <filename>/var/lib/apt/lists</filename> oder in der von der Variablen <literal>Dir::State::Lists</literal> in der Datei <filename>apt.conf</filename> benannten Datei gespeichert. Die Datei <filename>debian.lcs.mit.edu_debian_dists_unstable_contrib_binary-i386_Release</filename> enthält zum Beispiel die <filename>Release</filename>-Datei, die von der Site <literal>debian.lcs.mit.edu</literal> für die <literal>binary-i386</literal>-Architekturdateien von der <literal>contrib</literal>-Komponente der <literal>unstable</literal>-Distribution heruntergeladen wurde.
es: Todos los ficheros <filename>Packages</filename> y <filename>Release</filename> obtenidos de los recursos en «&sources-list;» se guardan en el directorio <filename>/var/lib/apt/lists</filename>, o en el directorio definido por la variable <literal>Dir::State::Lists</literal>, que se puede definir en el fichero <filename>apt.conf</filename>. Por ejemplo, el fichero <filename>debian.lcs.mit.edu_debian_dists_unstable_contrib_binary-i386_Release</filename> contiene los ficheros <filename>Release</filename> obtenidos de <literal>debian.lcs.mit.edu</literal> para la arquitectura <literal>binary-i386</literal> de la sección <literal>contrib</literal> de la distribución «<literal>unstable</literal>» (inestable).

source: Optional Lines in an APT Preferences Record
de: Optionale Zeilen in einem APT-Einstellungsdatensatz
es: Líneas opcionales en el registro de preferencias de APT

source: Each record in the APT preferences file can optionally begin with one or more lines beginning with the word <literal>Explanation:</literal>. This provides a place for comments.
de: Optional kann jeder Datensatz in der APT-Einstellungsdatei mit einer oder mehreren Zeilen beginnen, die mit dem Wort <literal>Explanation:</literal> anfangen. Dieses stellt einen Platz für Kommentare bereit.
es: Cada registro en el fichero de preferencias de APT puede comenzar con una o más líneas que tengan como primera palabra <literal>Explanation:</literal>. Útil para comentarios.

source: Tracking Stable
de: Stable verfolgen
es: Seguir la distribución «stable» (estable)

source: Explanation: Uninstall or do not install any Debian-originated Explanation: package versions other than those in the stable distro Package: * Pin: release a=stable Pin-Priority: 900 Package: * Pin: release o=Debian Pin-Priority: -10
de: Explanation: Deinstallieren oder nicht installieren von anderen von Debian Explanation: stammenden Paketversionen als denen der Stable-Distribution Package: * Pin: release a=stable Pin-Priority: 900 Package: * Pin: release o=Debian Pin-Priority: -10
es: Explanation: Desinstalar o no instalar los ejemplares que no Explanation: pertenecen a la distribución estable Package: * Pin: release a=stable Pin-Priority: 900 Package: * Pin: release o=Debian Pin-Priority: -10

source: The following APT preferences file will cause APT to assign a priority higher than the default (500) to all package versions belonging to a <literal>stable</literal> distribution and a prohibitively low priority to package versions belonging to other <literal>Debian</literal> distributions. <placeholder type="programlisting" id="0"/>
de: Die folgende APT-Einstellungsdatei wird APT veranlassen, allen Paketversionen eine höhere Priorität als die Vorgabe (500) zu geben, die zu einer <literal>stable</literal>-Distribution gehören und eine ungeheuer niedrige Priorität Paketversionen, die zu anderen <literal>Debian</literal>-Distributionen gehören. <placeholder type="programlisting" id="0"/>
es: El siguiente fichero de preferencias de APT provoca que APT asigne una prioridad mayor de la que asigna por omisión (500) a todas las versiones de paquete de la distribución <literal>stable</literal> y una prioridad más baja al resto de versiones de paquetes de otras distribuciones <literal>Debian</literal>. <placeholder type="programlisting" id="0"/>

source: apt-get install <replaceable>package-name</replaceable> apt-get upgrade apt-get dist-upgrade
de: apt-get install <replaceable>Paketname</replaceable> apt-get upgrade apt-get dist-upgrade
es: apt-get install <replaceable>paquete</replaceable> apt-get upgrade apt-get dist-upgrade

source: With a suitable &sources-list; file and the above preferences file, any of the following commands will cause APT to upgrade to the latest <literal>stable</literal> version(s). <placeholder type="programlisting" id="0"/>
de: Mit einer geeigneten &sources-list;-Datei und der obigen Einstellungsdatei wird jeder der folgenden Befehle APT veranlassen, ein Upgrade auf die neuste(n) <literal>stable</literal>-Version(en) durchzuführen. <placeholder type="programlisting" id="0"/>
es: Con un fichero «&sources-list;» adecuado y el fichero de preferencias mostrado anteriormente, cualquiera de las siguientes órdenes de APT hace que o bien todo el sistema o bien sólo algunos paquetes se actualicen a la última versión en <literal>stable</literal>. <placeholder type="programlisting" id="0"/>

source: apt-get install <replaceable>package</replaceable>/testing
de: apt-get install <replaceable>Paket</replaceable>/testing
es: apt-get install <replaceable>paquete</replaceable>/testing

source: The following command will cause APT to upgrade the specified package to the latest version from the <literal>testing</literal> distribution; the package will not be upgraded again unless this command is given again. <placeholder type="programlisting" id="0"/>
de: Der folgende Befehl wird APT veranlassen, ein Upgrade des angegebenen Pakets auf die neuste Version der <literal>testing</literal>-Distribution durchzuführen. Von dem Paket wird kein weiteres Upgrade durchgeführt, außer wenn dieser Befehl wieder angegeben wird. <placeholder type="programlisting" id="0"/>
es: La siguiente orden hace que APT actualice un paquete a la última versión de la distribución <literal>testing</literal>, el paquete no se actualizará de nuevo a menos que se ejecute la orden otra vez. <placeholder type="programlisting" id="0"/>

source: Tracking Testing or Unstable
de: Testing oder Unstable verfolgen
es: Seguir la distribución «testing» (en pruebas) o «unstable» (inestable)

source: The following APT preferences file will cause APT to assign a high priority to package versions from the <literal>testing</literal> distribution, a lower priority to package versions from the <literal>unstable</literal> distribution, and a prohibitively low priority to package versions from other <literal>Debian</literal> distributions. <placeholder type="programlisting" id="0"/>
de: Die folgende APT-Einstellungsdatei wird APT veranlassen, Paketversionen der <literal>testing</literal>-Distribution eine hohe Priorität, Paketversionen der <literal>unstable</literal>-Distribution eine niedrigere Priorität und eine ungeheuer niedrige Priorität zu Paketversionen von anderen <literal>Debian</literal>-Distributionen zuzuweisen. <placeholder type="programlisting" id="0"/>
es: El siguiente fichero de preferencias de APT provocará que APT asigne mayor prioridad a las versiones de la distribución <literal>testing</literal>, una prioridad menor a los paquetes de la distribución <literal>unstable</literal>, y una prioridad prohibitiva a los paquetes de otras distribuciones de <literal>Debian</literal>. <placeholder type="programlisting" id="0"/>

source: With a suitable &sources-list; file and the above preferences file, any of the following commands will cause APT to upgrade to the latest <literal>testing</literal> version(s). <placeholder type="programlisting" id="0"/>
de: Mit einer geeigneten &sources-list;-Datei und der obigen Einstellungsdatei wird jeder der folgenden Befehle APT veranlassen, ein Upgrade auf die neuste(n) <literal>testing</literal>-Version(en) durchzuführen. <placeholder type="programlisting" id="0"/>
es: Con un fichero &sources-list; adecuado y el fichero de preferencias anterior cualquiera de las siguientes órdenes hará que APT actualice los paquetes a la última versión de la distribución <literal>testing</literal>. <placeholder type="programlisting" id="0"/>

source: apt-get install <replaceable>package</replaceable>/unstable
de: apt-get install <replaceable>Paket</replaceable>/unstable
es: apt-get install <replaceable>paquete</replaceable>/unstable

source: The following command will cause APT to upgrade the specified package to the latest version from the <literal>unstable</literal> distribution. Thereafter, <command>apt-get upgrade</command> will upgrade the package to the most recent <literal>testing</literal> version if that is more recent than the installed version, otherwise, to the most recent <literal>unstable</literal> version if that is more recent than the installed version. <placeholder type="programlisting" id="0"/>
de: Der folgende Befehl wird APT veranlassen, ein Upgrade des angegebenen Pakets auf die neuste Version der <literal>unstable</literal>-Distribution durchzuführen. Danach wird <command>apt-get upgrade</command> ein Upgrade des Pakets auf die aktuellste <literal>testing</literal>-Version durchführen, falls diese aktueller als die installierte Version ist, andernfalls auf die aktuellste <literal>unstable</literal>-Version, wenn diese aktueller als die installierte Version ist. <placeholder type="programlisting" id="0"/>
es: La siguiente orden hace que APT actualice un determinado paquete a la última versión de la distribución <literal>unstable</literal>. Más tarde, <command>apt-get upgrade</command> actualizará el paquete a la última versión de la distribución <literal>testing</literal> si es más reciente que la versión instalada. De otro modo, se instalará la versión más reciente de la distribución<literal>unstable</literal> si es más reciente que la versión instalada. <placeholder type="programlisting" id="0"/>

source: Tracking the evolution of a codename release
de: Die Entwicklung eines Codename-Releases verfolgen
es: Seguir la evolución de una publicación por el nombre

source: Explanation: Uninstall or do not install any Debian-originated package versions Explanation: other than those in the distribution codenamed with &testing-codename; or sid Package: * Pin: release n=&testing-codename; Pin-Priority: 900 Explanation: Debian unstable is always codenamed with sid Package: * Pin: release n=sid Pin-Priority: 800 Package: * Pin: release o=Debian Pin-Priority: -10
de: Explanation: Deinstallieren oder nicht installieren von anderen von Debian Explanation: stammenden Paketversionen als denen der &testing-codename;- Explanation: oder Sid-Distribution Package: * Pin: release n=&testing-codename; Pin-Priority: 900 Explanation: Debian-Unstable hat immer den Codenamen sid Package: * Pin: release a=sid Pin-Priority: 800 Package: * Pin: release o=Debian Pin-Priority: -10
es: Explanation: Eliminar o no instalar cualquier paquete de Debian cuya versión sea Explanation: distinta a aquellos en las distribuciones de nombre squeeze o sid Package: * Pin: release n=&testing-codename; Pin-Priority: 900 Explanation: El nombre clave de Debian «unstable» siempre es sid Package: * Pin: release n=sid Pin-Priority: 800 Package: * Pin: release o=Debian Pin-Priority: -10

source: The following APT preferences file will cause APT to assign a priority higher than the default (500) to all package versions belonging to a specified codename of a distribution and a prohibitively low priority to package versions belonging to other <literal>Debian</literal> distributions, codenames and archives. Note that with this APT preference APT will follow the migration of a release from the archive <literal>testing</literal> to <literal>stable</literal> and later <literal>oldstable</literal>. If you want to follow for example the progress in <literal>testing</literal> notwithstanding the codename changes you should use the example configurations above. <placeholder type="programlisting" id="0"/>
de: Die folgende APT-Einstellungsdatei wird APT veranlassen, allen Paketen, die zu einem bestimmten Codenamen einer Distribution gehören, eine höhere Priorität als die Vorgabe (500) zu geben und Paketversionen, die zu anderen <literal>Debian</literal>-Distributionen, Codenamen und Archiven gehören, eine ungeheuer niedrige Priorität zu geben. Beachten Sie, dass APT mit diesen APT-Einstellungen der Migration eines Releases vom Archiv <literal>testing</literal> zu <literal>stable</literal> und später zu <literal>oldstable</literal> folgen wird. Wenn Sie zum Beispiel dem Fortschritt in <literal>testing</literal> folgen möchten, obwohl der Codename sich ändert, sollten Sie die Beispielkonfigurationen oberhalb benutzen. <placeholder type="programlisting" id="0"/>
es: El siguiente fichero de preferencias de APT provocará que APT asigne una prioridad superior a la predeterminada (500) a todas las versiones de paquetes pertenecientes a un nombre de distribución especificado, y una prioridad prohibitivamente baja a las versiones de paquetes pertenecientes a otras distribuciones de <literal>Debian</literal>, nombres clave y archivos Debian. Tenga en cuenta que con esta preferencia, APT seguirá la migración de una publicación desde el archivo <literal>testing</literal> a <literal>stable</literal> y por último <literal>oldstable</literal>. Si desea seguir, por ejemplo, el progreso en <literal>testing</literal> obviando el nombre de la publicación, debería usar los ejemplos de configuración mencionados anteriormente. <placeholder type="programlisting" id="0"/>

source: With a suitable &sources-list; file and the above preferences file, any of the following commands will cause APT to upgrade to the latest version(s) in the release codenamed with <literal>&testing-codename;</literal>. <placeholder type="programlisting" id="0"/>
de: Mit einer geeigneten &sources-list;-Datei und der obigen Einstellungsdatei wird jeder der folgenden Befehle APT veranlassen, ein Upgrade auf die letzte(n) Version(en) im Release mit Codenamen <literal>&testing-codename;</literal> durchzuführen. <placeholder type="programlisting" id="0"/>
es: Con un fichero «&sources-list;» adecuado y el fichero de preferencias mostrado anteriormente, cualquiera de las siguientes órdenes provocará que APT actualice los paquetes a la última versión de la distribución llamada <literal>&testing-codename;</literal>. <placeholder type="programlisting" id="0"/>

source: apt-get install <replaceable>package</replaceable>/sid
de: apt-get install <replaceable>Paket</replaceable>/sid
es: apt-get install <replaceable>paquete</replaceable>/sid

source: The following command will cause APT to upgrade the specified package to the latest version from the <literal>sid</literal> distribution. Thereafter, <command>apt-get upgrade</command> will upgrade the package to the most recent <literal>&testing-codename;</literal> version if that is more recent than the installed version, otherwise, to the most recent <literal>sid</literal> version if that is more recent than the installed version. <placeholder type="programlisting" id="0"/>
de: Der folgende Befehl wird APT veranlassen, ein Upgrade des angegebenen Pakets auf die letzte Version der <literal>sid</literal>-Distribution durchzuführen. Danach wird <command>apt-get upgrade</command> ein Upgrade des Pakets auf die aktuellste <literal>&testing-codename;</literal>-Version durchführen, wenn diese aktueller als die installierte Version ist, andernfalls auf die aktuellste <literal>sid</literal>-Version, wenn diese aktueller als die installierte Version ist. <placeholder type="programlisting" id="0"/>
es: La siguiente orden hace que APT actualice un determinado paquete a la última versión de la distribución <literal>sid</literal>. Más tarde, <command>apt-get upgrade</command> actualizará el paquete a la última versión de la distribución<literal>&testing-codename;</literal> si es más reciente que la versión instalada. De otro modo, se instalará la versión más reciente de la distribución <literal>sid</literal> si es más reciente que la versión instalada. <placeholder type="programlisting" id="0"/>

source: Package resource list for APT
de: Paketressourcenliste für APT
es: Lista de los repositorios de paquetes para APT

source: The package resource list is used to locate archives of the package distribution system in use on the system. At this time, this manual page documents only the packaging system used by the Debian GNU/Linux system. This control file is <filename>/etc/apt/sources.list</filename>.
de: Die Paketquellenliste wird benutzt, um Archive des Paketverteilungssystems, das auf dem System benutzt wird, zu finden. Momentan dokumentiert diese Handbuchseite nur das vom Debian-GNU/Linux-System benutzte Paketierungssystem. Diese Steuerungsdatei ist <filename>/etc/apt/sources.list</filename>.
es: La lista de los repositorios de paquetes se usa para ubicar los archivos de Debian del sistema de distribución de paquetes en uso en el sistema. A día de hoy, esta página del manual documenta sólo el sistema de paquetes que usa Debian GNU/Linux. Este fichero de control está ubicado en <filename>/etc/apt/sources.list</filename>

source: The source list is designed to support any number of active sources and a variety of source media. The file lists one source per line, with the most preferred source listed first. The format of each line is: <literal>type uri args</literal> The first item, <literal>type</literal> determines the format for <literal>args</literal>. <literal>uri</literal> is a Universal Resource Identifier (URI), which is a superset of the more specific and well-known Universal Resource Locator, or URL. The rest of the line can be marked as a comment by using a #.
de: Die Quellenliste wurde entworfen, um eine beliebige Anzahl von aktiven Quellen und eine Vielzahl von Quellmedien zu unterstützen. Die Datei listet eine Quelle pro Zeile auf, wobei die bevorzugten Quellen zuerst aufgelistet sind. Das Format jeder Zeile lautet: <literal>Typ URI Argumente</literal>. Das erste Element <literal>Typ</literal> legt das Format für <literal>Argumente</literal> fest. <literal>URI</literal> ist ein universeller Quellenbezeichner »Universal Resource Identifier« (URI), der eine Obermenge des spezielleren und besser bekannten Universal Resource Locator (URL) ist. Der Rest der Zeile kann unter Verwendung von # als Kommentar markiert werden.
es: La lista de los repositorios está diseñada para gestionar cualquier número de fuentes y distintos tipos de procedencias. El fichero lista una fuente por línea, con la fuente de mayor prioridad en la primera línea. El formato de cada línea es: <literal>tipo uri argumentos</literal>. El primer elemento, <literal>tipo</literal>, determina el formato de <literal>argumentos</literal>. <literal>uri</literal> es «Universal Resource Identifier» (Identificador Universal de Recursos), un superconjunto de la más específica y bien conocida «Universal Resource Locator» (URL). Se puede marcar el resto de la línea como comentario usando #.

source: The <filename>/etc/apt/sources.list.d</filename> directory provides a way to add sources.list entries in separate files. The format is the same as for the regular <filename>sources.list</filename> file. File names need to end with <filename>.list</filename> and may only contain letters (a-z and A-Z), digits (0-9), underscore (_), hyphen (-) and period (.) characters. Otherwise APT will print a notice that it has ignored a file if the file doesn't match a pattern in the <literal>Dir::Ignore-Files-Silently</literal> configuration list - in this case it will be silently ignored.
de: Das Verzeichnis <filename>/etc/apt/sources.list.d</filename> stellt eine Möglichkeit bereit, sources.list-Einträge in separaten Dateien hinzuzufügen. Das Format ist das gleiche wie für die normale <filename>sources.list</filename>-Datei. Dateinamen müssen mit <filename>.list</filename> enden und können nur Buchstaben (a-z und A-Z), Ziffern (0-9), Unterstriche (_), Bindestriche (-) und Punkte (.) enthalten. Andernfalls wird APT einen Hinweis ausgeben, dass es eine Datei ignoriert hat, falls die Datei nicht auf ein Muster in der Konfigurationsliste <literal>Dir::Ignore-Files-Silently</literal> passt – in diesem Fall wird sie stillschweigend ignoriert.

source: The deb and deb-src types
de: Die Typen deb und deb-src
es: Los tipos «deb» y «deb-src»
