Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: <literal>Dir::Cache</literal> contains locations pertaining to local cache information, such as the two package caches <literal>srcpkgcache</literal> and <literal>pkgcache</literal> as well as the location to place downloaded archives, <literal>Dir::Cache::archives</literal>. Generation of caches can be turned off by setting their names to be blank. This will slow down startup but save disk space. It is probably preferred to turn off the pkgcache rather than the srcpkgcache. Like <literal>Dir::State</literal> the default directory is contained in <literal>Dir::Cache</literal>
de: <literal>Dir::Cache</literal> enthält Orte, die zu lokalen Zwischenspeicherinformationen gehören, so wie die beiden Paketzwischenspeicher <literal>srcpkgcache</literal> und <literal>pkgcache</literal>, sowie der Ort, an den heruntergeladene Archive platziert werden, <literal>Dir::Cache::archives</literal>. Die Generierung von Zwischenspeichern kann ausgeschaltet werden, indem ihre Namen leer gelassen werden. Dies wird den Start verlangsamen, aber Plattenplatz sparen. Es ist vermutlich vorzuziehen, statt des »pkgcache«s den »srcpkgcache« auszuschalten. Wie <literal>Dir::State</literal> ist das Standardverzeichnis in <literal>Dir::Cache</literal> enthalten.
es: <literal>Dir::Cache</literal> contiene las ubicaciones que afectan a la información de la caché local, como los dos cachés de paquetes <literal>srcpkgcache</literal> y <literal>pkgcache</literal>, así como a la ubicación dónde se guardan los ficheros descargados, <literal>Dir::Cache::archives</literal>. La generación de cachés se puede desactivar dejando sus nombres en blanco. Ésto hará que el arranque sea más lento, pero ahorrará espacio. Normalmente se prefiere deshabilitar pkgcache en vez de srcpkgcache. Al igual que con <literal>Dir::State</literal> el directorio predeterminado está en <literal>Dir::Cache</literal>

source: <literal>Dir::Etc</literal> contains the location of configuration files, <literal>sourcelist</literal> gives the location of the sourcelist and <literal>main</literal> is the default configuration file (setting has no effect, unless it is done from the config file specified by <envar>APT_CONFIG</envar>).
de: <literal>Dir::Etc</literal> enthält den Ort der Konfigurationsdateien, <literal>sourcelist</literal> gibt den Ort der Quellliste und <literal>main</literal> ist die Standardkonfigurationsdatei (Einstellung hat keine Auswirkung, außer wenn sie aus der in <envar>APT_CONFIG</envar> angegebenen Konfigurationsdatei erfolgt).
es: <literal>Dir::Etc</literal> contiene la ubicación de los ficheros de configuración, <literal>sourcelist</literal> proporciona la ubicación de sourcelist y <literal>main</literal> es el fichero de configuración predeterminado (esta opción de configuración no tiene ningún efecto a menos que se realice desde el fichero de configuración definido en <envar>APT_CONFIG</envar>).

source: The <literal>Dir::Parts</literal> setting reads in all the config fragments in lexical order from the directory specified. After this is done then the main config file is loaded.
de: Die <literal>Dir::Parts</literal>-Einstellung liest in allen Konfigurationsteilen in lexikalischer Reihenfolge vom angegebenen Verzeichnis. Nachdem dies geschehen ist, wird die Hauptkonfigurationsdatei geladen.
es: La opción <literal>Dir::Parts</literal> lee en todos los fragmentos de ficheros de configuración en orden léxico desde el directorio especificado. Al finalizar este proceso carga el fichero de configuración principal.

source: Binary programs are pointed to by <literal>Dir::Bin</literal>. <literal>Dir::Bin::Methods</literal> specifies the location of the method handlers and <literal>gzip</literal>, <literal>bzip2</literal>, <literal>lzma</literal>, <literal>dpkg</literal>, <literal>apt-get</literal> <literal>dpkg-source</literal> <literal>dpkg-buildpackage</literal> and <literal>apt-cache</literal> specify the location of the respective programs.
de: Auf binäre Programme wird von <literal>Dir::Bin</literal> verwiesen. <literal>Dir::Bin::Methods</literal> gibt den Ort des Methodensteuerungsprogramms an und <literal>gzip</literal>, <literal>bzip2</literal>, <literal>lzma</literal>, <literal>dpkg</literal>, <literal>apt-get</literal>, <literal>dpkg-source</literal>, <literal>dpkg-buildpackage</literal> und <literal>apt-cache</literal> geben den Ort des jeweiligen Programms an.
es: <literal>Dir::Bin</literal> apunta a los programas binarios. <literal>Dir::Bin::Methods</literal> define la ubicación de los gestores de los métodos y <literal>gzip</literal>, <literal>bzip2</literal>, <literal>lzma</literal>, <literal>dpkg</literal>, <literal>apt-get</literal>, <literal>dpkg-source</literal>, <literal>dpkg-buildpackage</literal> y <literal>apt-cache</literal> especifican la ubicación de sus respectivos programas.

source: The configuration item <literal>RootDir</literal> has a special meaning. If set, all paths in <literal>Dir::</literal> will be relative to <literal>RootDir</literal>, <emphasis>even paths that are specified absolutely</emphasis>. So, for instance, if <literal>RootDir</literal> is set to <filename>/tmp/staging</filename> and <literal>Dir::State::status</literal> is set to <filename>/var/lib/dpkg/status</filename>, then the status file will be looked up in <filename>/tmp/staging/var/lib/dpkg/status</filename>.
de: Das Konfigurationselement <literal>RootDir</literal> hat eine besondere Bedeutung. Falls es gesetzt ist, sind alle Pfad relativ zu <literal>RootDir</literal>, <emphasis>sogar Pfade, die absolut angegeben wurden</emphasis>. So wird zum Beispiel, wenn <literal>RootDir</literal> auf <filename>/tmp/staging</filename> und <literal>Dir::State::status</literal> auf <filename>/var/lib/dpkg/status</filename> gesetzt ist, nach der Statusdatei in <filename>/tmp/staging/var/lib/dpkg/status</filename> nachgesehen.
es: La opción de configuración <literal>RootDir</literal> tiene un significado especial. Si se define, todas las rutas de <literal>Dir::</literal> serán relativas a <literal>RootDir</literal>, <emphasis>incluso las rutas que se especifiquen de forma absoluta</emphasis>. De modo que, por ejemplo, si <literal>RootDir</literal> se define como <filename>/tmp/staging</filename> y <literal>Dir::State::status</literal> se define como <filename>/var/lib/dpkg/status</filename>, entonces el fichero de estado será <filename>/tmp/staging/var/lib/dpkg/status</filename>.

source: The <literal>Ignore-Files-Silently</literal> list can be used to specify which files APT should silently ignore while parsing the files in the fragment directories. Per default a file which end with <literal>.disabled</literal>, <literal>~</literal>, <literal>.bak</literal> or <literal>.dpkg-[a-z]+</literal> is silently ignored. As seen in the last default value these patterns can use regular expression syntax.
de: Die Liste <literal>Ignore-Files-Silently</literal> kann benutzt werden, um anzugeben welche Dateien APT beim Auswerten der Dateien im Verzeichnisteil stillschweigend ignorieren sollte. Standardmäßig werden Dateien, die auf <literal>.disabled</literal>, <literal>~</literal>, <literal>.bak</literal> oder <literal>.dpkg-[a-z]+</literal> endenn stillschweigend ignoriert. Wie bei den letzten Vorgabwerten gesehen, kann die Syntax für reguläre Ausdrücke verwandt werden.
es: La lista <literal>Ignore-Files-Silently</literal> se puede usar para definir qué fichero debería ignorar APT silenciosamente al analizar ficheros en los directorios de fragmentos. Por omisión, se ignora silenciosamente un fichero que termina con <literal>.disabled</literal>, <literal>~</literal>, <literal>.bak</literal> o <literal>.dpkg-[a-z]+</literal>. Como se puede ver con el último valor predeterminado, estos patrones pueden usar la sintaxis de expresiones regulares.

source: When APT is used as a &dselect; method several configuration directives control the default behaviour. These are in the <literal>DSelect</literal> section.
de: Wenn APT als eine &dselect;-Methode benutzt wird, steuern mehrere Konfigurationsdirektiven das Standardverhalten. Diese stehen im Abschnitt <literal>DSelect</literal>.
es: Varias directivas de configuración controlan el comportamiento predeterminado cuando APT se usa como método de &dselect;. Éstas se encuentran en la sección <literal>DSelect</literal>.

source: Cache Clean mode; this value may be one of always, prompt, auto, pre-auto and never. always and prompt will remove all packages from the cache after upgrading, prompt (the default) does so conditionally. auto removes only those packages which are no longer downloadable (replaced with a new version for instance). pre-auto performs this action before downloading new packages.
de: Zwischenspeicherbereinigungsmodus; Dieser Wert kann entweder »always«, »prompt«, »auto«, »pre-auto« oder »never« sein. »always« und »prompt« werden, nachdem das Upgrade durchgeführt wurde, alle Pakete aus dem Zwischenspeicher entfernen, »prompt« (die Vorgabe) tut dies bedingt. »auto« entfernt nur jene Pakete, die nicht länger heruntergeladen werden können (zum Beispiel, weil sie durch eine neue Version ersetzt wurden). »pre-auto« führt diese Aktion vor dem Herunterladen neuer Pakete durch.
es: Modo de limpieza del almacén, este valor puede ser «always», «prompt», «auto», «pre-auto» y «never». Los valores «always» y «prompt» borrarán todos los paquetes del almacén después de actualizar, «prompt» (el valor predeterminado) preguntará primero. El valor «auto» borrará sólo aquellos paquetes que ya no se pueden descargar (por ejemplo, los reemplazados por otra versión). El valor «pre-auto» realiza esta última acción antes de descargar los paquetes nuevos.

source: The contents of this variable is passed to &apt-get; as command line options when it is run for the install phase.
de: Die Inhalte dieser Variablen werden als Befehlszeilenoptionen an &apt-get; übermittelt, wenn es für die Installationsphase durchlaufen wird.
es: Los contenidos de esta variable se introducen a &apt-get; como opciones de la línea de ordenes al ejecutar la fase de instalación.

source: The contents of this variable is passed to &apt-get; as command line options when it is run for the update phase.
de: Die Inhalte dieser Variable werden als Befehlszeilenoptionen an &apt-get; übermittelt, wenn es für die Aktualisierungsphase durchlaufen wird.
es: Los contenidos de esta variable se introducen a &apt-get; como opciones de la línea de ordenes al ejecutar la fase de actualización.

source: If true the [U]pdate operation in &dselect; will always prompt to continue. The default is to prompt only on error.
de: Falls true, wird die Aktualisierungsoption [U] in &dselect; immer nachfragen, um fortzufahren. Vorgabe ist es, nur bei Fehlern nachzufragen.
es: Si es «true», la operación de «[U]pdate» (actualización) en &dselect; preguntará siempre antes de continuar. De forma predeterminada, sólo preguntará en caso de error.

source: How APT calls dpkg
de: Wie APT Dpkg aufruft
es: Cómo invoca APT a dpkg

source: Several configuration directives control how APT invokes &dpkg;. These are in the <literal>DPkg</literal> section.
de: Mehrere Konfigurationsdirektiven steuern, wie APT &dpkg; aufruft. Diese stehen im Abschnitt <literal>DPkg</literal>.
es: Varias directivas de configuración controlan cómo invoca APT a &dpkg;. Éstas se encuentran en la sección <literal>DPkg</literal>.

source: This is a list of options to pass to dpkg. The options must be specified using the list notation and each list item is passed as a single argument to &dpkg;.
de: Dies ist eine Liste von Optionen, die an Dpkg übermittelt werden. Die Optionen müssen unter Benutzung der Listenschreibweise angegeben werden und jedes Listenelement wird als einzelnes Argument an &dpkg; übermittelt.
es: Es una lista de opciones que se introducen a dpkg. Las opciones se deben especificar usando la notación de lista y cada elemento de la lista se introduce a &dpkg; como un sólo argumento.

source: This is a list of shell commands to run before/after invoking &dpkg;. Like <literal>options</literal> this must be specified in list notation. The commands are invoked in order using <filename>/bin/sh</filename>, should any fail APT will abort.
de: Dies ist eine Liste von Shell-Befehlen, die vor/nach dem Aufruf von &dpkg; ausgeführt werden. Wie <literal>options</literal> muss dies in Listenschreibweise angegeben werden. Die Befehle werden der Reihenfolge nach mit <filename>/bin/sh</filename> aufgerufen, sollte einer fehlschlagen, wird APT abgebrochen.
es: Es una lista de órdenes de la consola que se ejecutarán antes y/o después de invocar a &dpkg;. Como <literal>options</literal>, se debe especificar con notación de lista. Las órdenes se ejecutarán en orden usando <filename>/bin/sh</filename>, y APT finalizará en caso de fallo.

source: This is a list of shell commands to run before invoking dpkg. Like <literal>options</literal> this must be specified in list notation. The commands are invoked in order using <filename>/bin/sh</filename>, should any fail APT will abort. APT will pass to the commands on standard input the filenames of all .deb files it is going to install, one per line.
de: Dies ist eine Liste von Shell-Befehlen, die vor dem Aufruf von Dpkg ausgeführt werden. Wie <literal>options</literal> muss dies in Listenschreibweise angegeben werden. Die Befehle werden der Reihenfolge nach mit <filename>/bin/sh</filename> aufgerufen, sollte einer fehlschlagen, wird APT abgebrochen. APT wird den Befehlen auf der Standardeingabe die Dateinamen aller .deb-Dateien, die es installieren wird, übergeben, einen pro Zeile.
es: Es una lista de órdenes de la consola que se ejecutarán antes de invocar a &dpkg;. Como <literal>options</literal>, se debe especificar con notación de lista. Las órdenes se ejecutan en orden usando <filename>/bin/sh</filename>, y APT finalizará en caso de fallo. APT introducirá las órdenes, por la entrada estándar, de los nombres de fichero de todos los «.deb» que va a instalar, uno por línea.

source: Version 2 of this protocol dumps more information, including the protocol version, the APT configuration space and the packages, files and versions being changed. Version 2 is enabled by setting <literal>DPkg::Tools::options::cmd::Version</literal> to 2. <literal>cmd</literal> is a command given to <literal>Pre-Install-Pkgs</literal>.
de: Version 2 dieses Protokolls gibt mehr Informationen aus, einschließlich der Protokollversion, dem APT-Konfigurationsraum und den Paketen, Dateien und den Versionen, die geändert werden. Version 2 wird durch Setzen von <literal>DPkg::Tools::options::cmd::Version</literal> auf 2 eingeschaltet. <literal>cmd</literal> ist ein Befehl, der an <literal>Pre-Install-Pkgs</literal> gegeben wird.
es: La versión 2 de este protocolo vuelca más información, incluyendo la versión del protocolo, el espacio de configuración de APT y de los paquetes, los ficheros y las versiones que cambian. La versión 2 se habilita definiendo <literal>DPkg::Tools::Options::cmd::Version</literal> con el valor 2. <literal>cmd</literal> es una orden que se pasa a <literal>Pre-Install-Pkgs</literal>.

source: APT chdirs to this directory before invoking dpkg, the default is <filename>/</filename>.
de: APT wechselt mit chdir in dieses Verzeichnis, bevor Dpkg aufgerufen wird, die Vorgabe ist <filename>/</filename>.
es: APT cambia a este directorio antes de invocar a dpkg, el valor predeterminado es <filename>/</filename>.

source: These options are passed to &dpkg-buildpackage; when compiling packages, the default is to disable signing and produce all binaries.
de: Diese Optionen werden an &dpkg-buildpackage; beim Kompilieren von Paketen übermittelt. Standardmäßig wird das Signieren augeschaltet und alle Programme werden erstellt.
es: Estas opciones se introducen a &dpkg-buildpackage; cuando compila paquetes, el comportamiento predeterminado se limita a deshabilitar el firmado de paquetes y a producir todos los binarios.

source: dpkg trigger usage (and related options)
de: Dpkd-Trigger-Benutzung (und zugehöriger Optionen)
es: Uso del disparador de dpkg (y de las opciones relacionadas)

source: APT can call dpkg in a way so it can make aggressive use of triggers over multiple calls of dpkg. Without further options dpkg will use triggers only in between his own run. Activating these options can therefore decrease the time needed to perform the install / upgrade. Note that it is intended to activate these options per default in the future, but as it changes the way APT calling dpkg drastically it needs a lot more testing. <emphasis>These options are therefore currently experimental and should not be used in productive environments.</emphasis> Also it breaks the progress reporting so all frontends will currently stay around half (or more) of the time in the 100% state while it actually configures all packages.
de: APT kann Dpkg auf eine Art aufrufen, in der aggressiv Gebrauch von Triggern über mehrere Dpkg-Aufrufe hinweg gemacht wird. Ohne weitere Optionen wird Dpkg Trigger nur während seiner eigenen Ausführung benutzen. Diese Optionen zu benutzen, kann daher die zum Installieren/Upgrade benötigte Zeit verkürzen. Beachten Sie, dass geplant ist, diese Optionen in Zukunft standardmäßig zu aktivieren, aber da es die Art, wie APT Dpkg aufruft, drastisch ändert, benötigt es noch viele weitere Tests. <emphasis>Diese Optionen sind daher aktuell noch experimentell und sollten nicht in produktiven Umgebungen benutzt werden.</emphasis> Außerdem unterbricht es die Fortschrittsanzeige, so dass alle Oberflächen derzeit die halbe (oder mehr) Zeit auf dem Status 100% stehen, während tatsächlich alle Pakete konfiguriert werden.

source: Note that it is not guaranteed that APT will support these options or that these options will not cause (big) trouble in the future. If you have understand the current risks and problems with these options, but are brave enough to help testing them create a new configuration file and test a combination of options. Please report any bugs, problems and improvements you encounter and make sure to note which options you have used in your reports. Asking dpkg for help could also be useful for debugging proposes, see e.g. <command>dpkg --audit</command>. A defensive option combination would be <placeholder type="literallayout" id="0"/>
de: Beachten Sie, dass es nicht gewährleistet ist, dass APT diese Optionen unterstützen wird oder dass diese Optionen in der Zukunft keinen (großen) Ärger machen. Wenn Sie die allgemeinen Risiken und Probleme mit diesen Optionen verstanden haben, aber tapfer genug sind, sie testen zu helfen, erstellen Sie eine neue Konfigurationsdatei und testen Sie eine Kombination von Optionen. Bitte berichten Sie auf Englisch jegliche Fehler, Probleme und Verbesserungen, denen Sie begegnen und stellen Sie sicher, dass Sie alle von Ihnen benutzten Optionen in Ihren Berichten vermerken. Zum Zweck der Fehlersuche könnte es außerdem nützlich sein, Dpkg um Hilfe zu fragen. Lesen Sie z.B. <command>dpkg --audit</command>. Eine defensive Optionenkombination wäre <placeholder type="literallayout" id="0"/>
es: Tenga en cuenta que no se garantiza que APT permitirá usar estas opciones o que estas opciones no causen un (gran) problema en el futuro. Si ha entendido los riesgos y los problemas actuales con estas opciones pero es lo suficientemente valiente para ayudar a probarlas, cree un nuevo fichero de configuración y pruebe una combinación de las opciones. Por favor, informe de cualquier error, problema o mejora que encuentre y asegúrese de apuntar en sus informes qué opciones ha usado. Pedir ayuda a dpkg también puede ser útil por motivos de depuración, véase por ejemplo: <command>dpkg --audit</command>. Una combinación de opciones defensivas sería <placeholder type="literallayout" id="0"/>

source: Add the no triggers flag to all dpkg calls (except the ConfigurePending call). See &dpkg; if you are interested in what this actually means. In short: dpkg will not run the triggers when this flag is present unless it is explicitly called to do so in an extra call. Note that this option exists (undocumented) also in older apt versions with a slightly different meaning: Previously these option only append --no-triggers to the configure calls to dpkg - now apt will add these flag also to the unpack and remove calls.
de: Die keine-Trigger-Markierung zu allen Dpkg-Aufrufen hinzufügen (ausgenommen den ConfigurePending-Aufruf). Siehe &dpkg;, wenn Sie interessiert sind, was dies tatsächlich bedeutet. In Kürze: Dpkg wird die Trigger nicht ausführen, dann ist diese Markierung vorhanden, außer sie wird explizit aufgerufen, um dies in einem gesonderten Aufruf zu tun. Beachten Sie, dass diese Option außerdem in älteren APT-Versionen mit einer geringfügig anderen Bedeutung existiert (nicht dokumentiert): Vorher hing diese Option nur --no-triggers an die Konfigurationsaufrufe für Dpkg an – nun wird APT diese Markierung außerdem an die »unpack«- und »remove«-Aufrufe anhängen.
es: Añade a todas las llamadas a dpkg la opción sin disparadores («no triggers»), excepto a la llamada a «ConfigurePending». Consulte &dpkg; si está interesado en saber qué significa esto. De forma breve: dpkg no ejecutará los disparadores cuando está opción esté presente a menos que se ejecute explícitamente en una llamada adicional. Tenga en cuenta que esta opción también existe en versiones antiguas de apt (aunque sin documentar) con un significado diferente. Anteriormente sólo se añadía la opción «--no-triggers» a las llamadas de la configuración para dpkg, ahora apt también añadirá esta opción a las llamadas de desempaquetado y borrado.
