Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: The names of the configuration items are not case-sensitive. So in the previous example you could use <literal>dpkg::pre-install-pkgs</literal>.
de: Die Namen der Konfigurationselemente sind nicht von Groß- und Kleinschreibung abhängig. Deshalb könnten Sie im vorherigen Beispiel auch <literal>dpkg::pre-install-pkgs</literal> benutzen.
es: Los nombres de las opciones de configuración no diferencian mayúsculas de minúsculas. De modo que en el ejemplo anterior se podría haber usado <literal>dpkg::pre-install-pkgs</literal>.

source: Names for the configuration items are optional if a list is defined as it can be see in the <literal>DPkg::Pre-Install-Pkgs</literal> example above. If you don't specify a name a new entry will simply add a new option to the list. If you specify a name you can override the option as every other option by reassigning a new value to the option.
de: Namen für die Konfigurationsdatei sind optional, wenn eine Liste, wie sie im Beispiel <literal>DPkg::Pre-Install-Pkgs</literal> oberhalb gesehen werden kann, definiert ist. Wenn Sie keinen neuen Namen angeben, wird ein neuer Eintrag der Liste lediglich eine neue Option hinzufügen. Wenn Sie einen Namen eingeben, können Sie die Option, wie jede andere Option, überschreiben, indem Sie der Option erneut einen neuen Wert zuweisen.
es: Los nombres de las opciones de configuración son opcionales, si se define una lista como se puede ver en el ejemplo anterior de <literal>DPkg::Pre-Install-Pkgs</literal>. Si no se define un nombre, simplemente se añadirá una nueva opción a la lista. Si se define un nombre, se puede redefinir la opción como cualquier otra opción reasignando un nuevo valor a la opción.

source: Two specials are allowed, <literal>#include</literal> (which is deprecated and not supported by alternative implementations) and <literal>#clear</literal>: <literal>#include</literal> will include the given file, unless the filename ends in a slash, then the whole directory is included. <literal>#clear</literal> is used to erase a part of the configuration tree. The specified element and all its descendants are erased. (Note that these lines also need to end with a semicolon.)
de: Es sind die beiden Spezialfälle <literal>#include</literal> (das missbilligt ist und von alternativen Implementierungen nicht unterstützt wird) und <literal>#clear</literal> erlaubt: <literal>#include</literal> wird die angegebene Datei einfügen außer, wenn der Dateiname mit einem Schrägstrich endet, dann wird das ganze Verzeichnis eingefügt. <literal>#clear</literal> wird benutzt, um einen Teil des Konfigurationsbaums zu löschen. Das angegebene Element und alle davon absteigenden Elemente werden gelöscht. (Beachten Sie, dass diese Zeilen auch mit einem Semikolon enden müssen.)
es: Se permiten dos valores especiales, <literal>#include</literal> (ya obsoleto y no es compatible en implementaciones alternativas) y <literal>#clear</literal>. <literal>#include</literal> incluirá el fichero proporcionado, a menos que el final del nombre del fichero acabe en una barra, en este caso se incluirá el directorio entero. <literal>#clear</literal> se usa para borrar parte del árbol de configuración. El elemento especificado y sus descendientes se eliminarán. (Tenga en cuenta que estas líneas también necesitan acabar con punto y coma).

source: The #clear command is the only way to delete a list or a complete scope. Reopening a scope or the ::-style described below will <emphasis>not</emphasis> override previously written entries. Only options can be overridden by addressing a new value to it - lists and scopes can't be overridden, only cleared.
de: Der #clear-Befehl ist der einzige Weg, eine Liste oder einen kompletten Geltungsbereich zu löschen. Erneutes Öffnen eines Geltungsbereichs oder der unten beschriebene ::-Stil werden vorherige Einträge <emphasis>nicht</emphasis> überschreiben. Optionen können nur überschrieben werden, indem ein neuer Wert an sie adressiert wird – Listen und Geltungsbereiche können nicht überschrieben, sondern nur bereinigt werden.
es: La orden #clear ofrece la única manera de borrar una lista o un ámbito completo. Reabrir un ámbito o el estilo de dos puntos dobles («::») descrito a continuación <emphasis>no</emphasis> redefinirá las entradas escritas anteriormente. Sólo las opciones se pueden redefinir asignándolas un nuevo valor, las listas y los ámbitos no se pueden redefinir, sólo eliminar.

source: All of the APT tools take a -o option which allows an arbitrary configuration directive to be specified on the command line. The syntax is a full option name (<literal>APT::Get::Assume-Yes</literal> for instance) followed by an equals sign then the new value of the option. Lists can be appended too by adding a trailing :: to the list name. (As you might suspect: The scope syntax can't be used on the command line.)
de: Alle APT-Werkzeuge bringen eine Option -o mit, die es einer beliebigen Installationsdirektiven erlaubt, auf der Befehlszeile angegeben zu werden. Die Syntax ist ein vollständiger Optionsname (<literal>APT::Get::Assume-Yes</literal> zum Beispiel), gefolgt von einem Gleichheitszeichen und dann dem neuen Wert der Option. Listen können ebenfalls durch Anhängen von abschließenden :: zur Namensliste hinzugefügt werden. (Wenn Ihnen das merkwürdig vorkommt: Die Geltungsbereichs-Syntax kann nicht auf der Befehlszeile benutzt werden.)
es: Todas las herramientas de APT permiten la opción -o como una directriz arbitraria de configuración que se define en la línea de órdenes. La sintaxis es un nombre de opción completo (por ejemplo, <literal>APT::Get::Assume-Yes</literal>) seguido por signos de igualdad y el nuevo valor de la opción. También puede añadir listas añadiendo dos puntos dobles («::») al final del nombre de la lista. (Como ya podía imaginar, no puede usar la sintaxis de los ámbitos en la línea de órdenes).

source: Note that you can use :: only for appending one item per line to a list and that you should not use it in combination with the scope syntax. (The scope syntax implicit insert ::) Using both syntaxes together will trigger a bug which some users unfortunately relay on: An option with the unusual name "<literal>::</literal>" which acts like every other option with a name. These introduces many problems including that a user who writes multiple lines in this <emphasis>wrong</emphasis> syntax in the hope to append to a list will gain the opposite as only the last assignment for this option "<literal>::</literal>" will be used. Upcoming APT versions will raise errors and will stop working if they encounter this misuse, so please correct such statements now as long as APT doesn't complain explicit about them.
de: Beachten Sie, dass Sie :: nur benutzen können, um ein Element pro Zeile an eine Liste anzuhängen und dass Sie es nicht nicht in Verbindung mit einer Geltungsbereichs-Syntax benutzen sollten. (Die Geltungsbereichssysyntax fügt implizit :: ein) Die Benutzung der Syntax von beiden zusammen wird einen Fehler auslösen, den einige Anwender ungünstigerweise weitergeben an eine Option mit dem unüblichen Namen »<literal>::</literal>«, der wie jede andere Option mit einem Namen agiert. Dies leitet viele Probleme ein, einschließlich, dass der Anwender, der mehrere Zeilen in dieser <emphasis>falschen</emphasis> Syntax in der Hoffnung etwas an die Liste anzuhängen schreibt, das Gegenteil von nur der letzten Zuweisung zu diese Option »<literal>::</literal>« erreicht. Bevorstehende APT-Versionen werden Fehler ausgeben und die Arbeit stoppen, wenn sie auf diese falsche Verwendung stoßen. Korrigieren Sie deshalb nun solche Anweisungen, solange sich APT nicht explizit darüber beklagt.
es: Tenga en cuenta que puede usar los dos puntos dobles («::») sólo para añadir un elemento por línea a una lista, y que no debería usarlo en combinación con la sintaxis de los ámbitos. (La sintaxis de los ámbitos inserta de forma implícita los dos puntos dobles «::»). Usando ambas sintaxis juntas causará un error en el que algunos usuarios caen: Una opción con el inusual nombre de «<literal>::</literal>» que actúa como cualquier otra opción con un nombre. Esto introduce muchos problemas; por ejemplo, un usuario que escribiese varias líneas con esta sintaxis <emphasis>incorrecta</emphasis>, con la esperanza de añadir a una lista conseguiría lo opuesto ya que sólo se usará la última asignación de esta opción «<literal>::</literal>». Las próximas versiones de APT devolverán errores y dejarán de funcionar si encuentran este fallo, así que corrija estas declaraciones ahora mientras APT no se queja explícitamente de ellos.

source: The APT Group
de: Die APT-Gruppe
es: El grupo APT

source: This group of options controls general APT behavior as well as holding the options for all of the tools.
de: Diese Gruppe von Optionen steuert das allgemeine Verhalten von APT, ebenso wie es die Optionen für alle Werkzeuge enthält.
es: Este grupo de opciones controla el comportamiento general de APT así como mantiene las opciones para todas las herramientas.

source: System Architecture; sets the architecture to use when fetching files and parsing package lists. The internal default is the architecture apt was compiled for.
de: Systemarchitektur; Setzt die Architektur die benutzt wird, wenn Dateien heruntergeladen und Paketlisten ausgewertet werden. Die interne Vorgabe ist die Architektur für die APT kompiliert wurde.
es: La arquitectura del sistema, define la arquitectura a usar al obtener los ficheros y analizar las listas de paquetes. El valor predeterminado es la arquitectura para la que apt se compiló.

source: All Architectures the system supports. Processors implementing the <literal>amd64</literal> are e.g. also able to execute binaries compiled for <literal>i386</literal>; This list is use when fetching files and parsing package lists. The internal default is always the native architecture (<literal>APT::Architecture</literal>) and all foreign architectures it can retrieve by calling <command>dpkg --print-foreign-architectures</command>.
de: Alle Architekturen, die das System unterstützt. Prozessoren, die <literal>amd64</literal> implementieren sind beispielsweise ebenso in der Lage, Programme auszuführen, die für <literal>i386</literal> kompiliert wurden. Diese Liste wird benutzt, wenn Dateien abgerufen und Paketlisten ausgewertet werden. Die interne Vorgabe ist immer die native Architektur (<literal>APT::Architecture</literal>) und alle fremden Architekturen, die durch Aufruf von <command>dpkg --print-foreign-architectures</command> abgefragt werden können.

source: Default release to install packages from if more than one version available. Contains release name, codename or release version. Examples: 'stable', 'testing', 'unstable', '&stable-codename;', '&testing-codename;', '4.0', '5.0*'. See also &apt-preferences;.
de: Standard-Release von dem Pakete installiert werden, wenn mehr als eine Version verfügbar ist. Enthält Release-Name, Codename oder Release-Version. Beispiele: »stable«, »testing, »unstable«, »&stable-codename;«, »&testing-codename;«, »4.0«, »5.0*«. Siehe auch &apt-preferences;.
es: La versión predeterminada de la que se instalarán los paquetes, si hay más de una versión disponible. Contiene el nombre de la versión, ya sea el nombre en código o el número de la versión. Por ejemplo: «stable», «testing», «unstable», «&stable-codename;», «&testing-codename;», «4.0», «5.0*». Vea también &apt-preferences;.

source: Ignore Held packages; This global option causes the problem resolver to ignore held packages in its decision making.
de: Halten von Paketen ignorieren; Diese globale Option veranlasst den Problemlöser, gehaltene Pakete beim Treffen von Entscheidungen zu ignorieren.
es: Ignora paquetes retenidos, esta opción global causa que el solucionador de problemas ignore los paquetes retenidos en la toma de decisiones.

source: Defaults to on. When turned on the autoclean feature will remove any packages which can no longer be downloaded from the cache. If turned off then packages that are locally installed are also excluded from cleaning - but note that APT provides no direct means to reinstall them.
de: Standardmäßig auf on (ein). Wenn es auf on gesetzt wird, wird die automatische Bereinigungsfunktion alle Pakete entfernen, die nicht länger aus dem Zwischenspeicher heruntergeladen werden können. Wenn es auf off gesetzt wird, dann werden außerden die Pakete, die lokal installiert sind, vom Bereinigen ausgeschlossen – beachten Sie jedoch, dass APT keine direkten Möglichkeiten bereitstellt, um sie erneut zu installieren.
es: Activo de forma predeterminada. Cuando se activa la función «autoclean», ésta eliminará cualquier paquete del almacén que ya no se pueda descargar. Si se desactiva, entonces los paquetes que están localmente instalados son excluidos de la limpieza - tenga en cuenta que APT no proporciona ningún mecanismo directo para reinstalarlos.

source: Defaults to on which will cause APT to install essential and important packages as fast as possible in the install/upgrade operation. This is done to limit the effect of a failing &dpkg; call: If this option is disabled APT does treat an important package in the same way as an extra package: Between the unpacking of the important package A and his configuration can then be many other unpack or configuration calls, e.g. for package B which has no relation to A, but causes the dpkg call to fail (e.g. because maintainer script of package B generates an error) which results in a system state in which package A is unpacked but unconfigured - each package depending on A is now no longer guaranteed to work as their dependency on A is not longer satisfied. The immediate configuration marker is also applied to all dependencies which can generate a problem if the dependencies e.g. form a circle as a dependency with the immediate flag is comparable with a Pre-Dependency. So in theory it is possible that APT encounters a situation in which it is unable to perform immediate configuration, errors out and refers to this option so the user can deactivate the immediate configuration temporarily to be able to perform an install/upgrade again. Note the use of the word "theory" here as this problem was only encountered by now in real world a few times in non-stable distribution versions and was caused by wrong dependencies of the package in question or by a system in an already broken state, so you should not blindly disable this option as the mentioned scenario above is not the only problem immediate configuration can help to prevent in the first place. Before a big operation like <literal>dist-upgrade</literal> is run with this option disabled it should be tried to explicitly <literal>install</literal> the package APT is unable to configure immediately, but please make sure to report your problem also to your distribution and to the APT team with the buglink below so they can work on improving or correcting the upgrade process.
de: Standardmäßig »on«, wodurch APT veranlasst wird, »essential«- oder »important«-Pakete so schnell wie möglich in der »install«-/»upgrade«-Operation zu installieren. Dies wird getan, um den Effekt eines gescheiterterten &dpkg;-Aufrufs zu begrenzen: Wenn diese Option ausgeschaltet ist, behandelt APT ein »important«-Paket auf die gleiche Weise wie ein »extra«-Paket: Zwischen dem Entpacken des »important«-Pakets A und seiner Konfiguration können dann viele andere Entpack- oder Konfigurationsaufrufe liegen, z.B. für Paket B, das keine Beziehung zu A hat, aber den dpkg-Aufruf zum Scheitern bringt (z.B. weil das Betreuerskript von Paket B Fehler generiert), die als Ergebnis einen Systemstatus haben, in dem Paket A entpackt, aber nicht konfiguriert ist und für kein von A abhängendes Paket länger gewährleistet ist, dass es funktioniert, weil die Abhängigkeit zu A nicht länger befriedigt wird. Das unmittelbare Konfigurationskennzeichen wird außerdem auf alle Abhängigkeiten angewandt, was zu einem Problem führen könnten, falls die Abhängigkeiten z.B. einen Kreis bilden, so dass eine Abhängigkeit mit der Unmittelbarmarkierung mit einer Vorabhängigkeit vergleichbar ist. So ist es theoretisch möglich, dass APT einer Situation begegnet, in der keine unmittelbare Konfiguration durchgeführt, ein Fehler ausgegeben und sich auf diese Option bezogen werden kann, so dass der Anwender die unmittelbare Konfiguration zeitweise deaktivieren kann, um in der Lage zu sein, erneut ein »install«/»upgrade« durchzuführen. Beachten Sie, dass hier das Wort »theoretisch« benutzt wird, denn dieses Problem ist bis jetzt in der Realität nur ein paar mal in unstabilen Distributionsversionen aufgetreten und wurde durch falsche Abhängigkeiten des fraglichen Pakets ausgelöst oder durch ein System in bereits kaputtem Status, so dass Sie diese Option nicht unbesehen abschalten sollten, da das oben erwähnte Szenario nicht das einzige unmittelbare Problem ist, das die Konfiguration überhaupt verhindern sollte. Bevor eine große Operation wie <literal>dist-upgrade</literal> mit dieser ausgeschalteten Option ausgeführt wird, sollte explizit versucht werden, <literal>install</literal> des Pakets durchzuführen. APT ist nicht in der Lage unmittelbar zu konfigurieren, aber stellen Sie sicher, dass Sie Ihr Problem außerdem an Ihre Distribution und an das APT-Team berichten mit nachstehendem Fehlerverweis, so dass es am Verbessern oder Korrigieren des Upgrade-Prozesses arbeiten kann.
es: Activo de forma predeterminada, hará que APT instale los paquetes esenciales e importantes tan rápido como le sea posible al instalar y/o actualizar. Esto se hace para limitar el efecto de un fallo en la ejecución de &dpkg;. Si esta opción está desactivada, APT trata los paquetes importantes del mismo modo que un paquete adicional: entre desempaquetar un paquete importante A y su configuración puede haber muchos otros desempaquetados y configuraciones. Por ejemplo, el paquete B que no tiene relación con A, pero que hace que la ejecución de dpkg falle (ya sea porque el script del mantenedor del paquete B genera un error) generará un estado del sistema en el que el paquete A está desempaquetado pero no configurado; no se garantiza el funcionamiento de cada paquete que depende de A ya que su dependencia con A no está satisfecha. El marcador de configuración inmediata se aplicará a todas las dependencias que puedan generar un problema si las dependencias, por ejemplo, forman un círculo vicioso como dependencia con la marca de configuración inmediata, lo cual lo califica casi como Pre-Dependencia. Así, en teoría es posible que APT encuentre una situación en la que es incapaz de llevar a cabo una configuración inmediata, devuelva un error y mencione esta opción para que así el usuario pueda desactivar la configuración inmediata temporalmente para llevar a cabo una vez más la instalación y/o actualización. Observe el uso de la expresión «en teoría», ya que esta situación sólo se ha visto algunas veces con versiones de distribución no estables, y causadas por dependencias incorrectas del paquete en cuestión o en un sistema ya roto. Por ello, no debería desactivar ciegamente esta opción ya que la situación mencionada anteriormente no es el único problema que la configuración inmediata puede resolver. Antes de llevar a cabo una operación grande como <literal>dist-upgrade</literal> con esta opción desactivada debería intentar un <literal>install</literal> con el paquete que APT es incapaz de configurar inmediatamente, pero asegúrese de informar del fallo a su distribución y al equipo de APT mediante el enlace a informes de fallo a continuación para que así puedan mejorar o corregir el proceso de actualización.

source: Never Enable this option unless you -really- know what you are doing. It permits APT to temporarily remove an essential package to break a Conflicts/Conflicts or Conflicts/Pre-Depend loop between two essential packages. SUCH A LOOP SHOULD NEVER EXIST AND IS A GRAVE BUG. This option will work if the essential packages are not tar, gzip, libc, dpkg, bash or anything that those packages depend on.
de: Schalten Sie diese Option niemals ein, außer wenn Sie -wirklich- wissen, was Sie tun. Es erlaubt APT temporär ein essentielles Paket zu entfernen, um eine Conflicts/Conflicts- oder Conflicts/Pre-Depend-Schleife zwischen zwei essentiellen Paketen zu unterbrechen. SOLCH EINE SCHLEIFE SOLLTE NIEMALS EXISTIEREN UND IST EIN SCHWERWIEGENDER FEHLER. Diese Option wird funktionieren, wenn die essentiellen Pakete nicht tar, gzip, libc, dpkg, bash oder etwas, was davon abhängt, sind.
es: Nunca active esta opción a menos que usted (realmente) sepa lo que está haciendo. Esto permite a APT eliminar temporalmente un paquete esencial para eliminar conflictos o bucles conflicto/pre-dependencia entre dos paquetes esenciales. EL BUCLE NO DEBERÍA EXISTIR NUNCA COMO TAL Y ES UN ERROR GRAVE. Esta opción funcionará si el paquete esencial no es ni tar, ni gzip, ni libc, ni dpkg, ni bash, ni cualquier otro del que dependan estos paquetes.

source: Cache-Start, Cache-Grow and Cache-Limit
de: Cache-Start, Cache-Grow und Cache-Limit
es: Cache-Start, Cache-Grow y Cache-Limit
