Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: <literal>depends</literal> shows a listing of each dependency a package has and all the possible other packages that can fulfill that dependency.
de: <literal>depends</literal> zeigt eine Liste von jeder Abhängigkeit, die ein Paket hat und alle möglichen anderen Pakete, die die Abhängigkeit erfüllen können.
es: <literal>depends</literal> muestra una lista de todas la dependencias de un paquete y de todos los demás paquetes que la pueden satisfacer.

source: rdepends <replaceable>pkg(s)</replaceable>
de: rdepends <replaceable>Paket(e)</replaceable>
es: rdepends <replaceable>paquete(s)</replaceable>

source: <literal>rdepends</literal> shows a listing of each reverse dependency a package has.
de: <literal>rdepends</literal> zeigt eine Liste von jeder Rückwärtsabhängigkeit, die ein Paket hat.
es: <literal>rdepends</literal> muestra las dependencias inversas de un paquete.

source: pkgnames <replaceable>[ prefix ]</replaceable>
de: pkgnames <replaceable>[ Präfix ]</replaceable>
es: pkgnames <replaceable>[ prefijo ]</replaceable>

source: This command prints the name of each package APT knows. The optional argument is a prefix match to filter the name list. The output is suitable for use in a shell tab complete function and the output is generated extremely quickly. This command is best used with the <option>--generate</option> option.
de: Dieser Befehl gibt den Namen jedes Paketes aus, das APT kennt. Das optionale Argument ist ein passendes Präfix, um die Namensliste zu filtern. Die Ausgabe ist geeignet für die Benutzung in der Tabulatorvervollständigung in der Shell. Die Ausgabe wird extrem schnell generiert. Dieser Befehl wird am besten mit der <option>--generate</option>-Option benutzt.
es: Esta orden muestra el nombre de todos los paquetes que APT conoce. El argumento opcional es un prefijo para filtrar la lista de nombres. La salida es apropiada para su uso junto con la función de completado automático mediante tabulador en un intérprete de órdenes y se genera de forma extremadamente rápida. El mejor uso de la orden es con la opción <option>--generate</option>.

source: Note that a package which APT knows of is not necessarily available to download, installable or installed, e.g. virtual packages are also listed in the generated list.
de: Beachten Sie, dass ein Paket, das APT kennt, nicht notwendigerweise zum Herunterladen verfügbar, installierbar oder installiert ist, virtuelle Pakete sind z.B. auch in der generierten Liste aufgeführt.
es: Tenga en cuenta que un paquete que conoce APT puede no estar necesariamente disponible para descargar, instalar o instalado, por ejemplo: los paquetes virtuales también aparecen en la lista generada.

source: dotty <replaceable>pkg(s)</replaceable>
de: dotty <replaceable>Paket(e)</replaceable>
es: dotty <replaceable>paquete(s)</replaceable>

source: <literal>dotty</literal> takes a list of packages on the command line and generates output suitable for use by dotty from the <ulink url="http://www.research.att.com/sw/tools/graphviz/">GraphViz</ulink> package. The result will be a set of nodes and edges representing the relationships between the packages. By default the given packages will trace out all dependent packages; this can produce a very large graph. To limit the output to only the packages listed on the command line, set the <literal>APT::Cache::GivenOnly</literal> option.
de: <literal>dotty</literal> nimmt eine Paketliste auf der Befehlszeile entgegen und generiert eine Ausgabe, die für die Benutzung durch dotty aus dem Paket <ulink url="http://www.research.att.com/sw/tools/graphviz/">GraphViz</ulink> geeignet ist. Das Ergebnis ist eine Zusammenstellung von Knoten und Kanten, die die Beziehung zwischen Paketen darstellen. Standardmäßig werden alle abhängigen Pakete ausfindig gemacht. Dies kann zu einem sehr großen Schaubild führen. Um die Ausgabe auf die Pakete zu beschränken, die auf der Befehlszeile eingegeben wurden, setzen Sie die Option <literal>APT::Cache::GivenOnly</literal>.
es: <literal>dotty</literal> toma una lista de paquetes de la línea de ordenes y genera una salida apropiada para su uso con dotty, del paquete <ulink url="http://www.research.att.com/sw/tools/graphviz/">GraphViz</ulink>. El resultado será un conjunto de nodos y uniones representando las relaciones entre los paquetes. De forma predeterminada, los paquetes proporcionados mostrarán todas sus dependencias, lo que puede producir un grafo muy grande. Para limitar la salida sólo a los paquetes listados en la línea de órdenes, active la opción <literal>APT::Cache::GivenOnly</literal>.

source: The resulting nodes will have several shapes; normal packages are boxes, pure provides are triangles, mixed provides are diamonds, missing packages are hexagons. Orange boxes mean recursion was stopped [leaf packages], blue lines are pre-depends, green lines are conflicts.
de: Die resultierenden Knoten haben mehrere Formen. Normale Pakete sind Kästchen, reine Bereitstellungen sind Dreiecke, gemischte Bereitstellungen sind Diamanten, fehlende Pakete sind Sechsecke. Orange Kästchen bedeuten, dass die Rekursion beendet wurde [Blattpakete], blaue Linien sind Pre-depends, grüne Linien sind Konflikte.
es: Los nodos resultantes tendrán varias formas: los paquetes normales son cajas, los paquetes virtuales puros son triángulos, los paquetes virtuales mixtos son diamantes y los paquetes no encontrados son hexágonos. Las cajas naranjas simbolizan que el recorrido se detuvo en paquetes que ningún otro declara como dependencia, las líneas azules son pre-dependencias y las líneas verdes son conflictos.

source: Caution, dotty cannot graph larger sets of packages.
de: Vorsicht, dotty kann keine größeren Zusammenstellungen von Paketen grafisch darstellen.
es: Tenga cuidado, dotty no puede dibujar grandes conjuntos de paquetes.

source: xvcg <replaceable>pkg(s)</replaceable>
de: xvcg <replaceable>Paket(e)</replaceable>
es: xvcg <replaceable>paquete(s)</replaceable>

source: The same as <literal>dotty</literal>, only for xvcg from the <ulink url="http://rw4.cs.uni-sb.de/users/sander/html/gsvcg1.html">VCG tool</ulink>.
de: Das gleiche wie <literal>dotty</literal>, nur für xvcg vom <ulink url="http://rw4.cs.uni-sb.de/users/sander/html/gsvcg1.html">VCG-Werkzeug</ulink>.
es: Lo mismo que <literal>dotty</literal>, sólo para xvcg de la <ulink url="http://rw4.cs.uni-sb.de/users/sander/html/gsvcg1.html">herramienta VCG</ulink>.

source: policy <replaceable>[ pkg(s) ]</replaceable>
de: policy <replaceable>[ Paket(e) ]</replaceable>
es: policy <replaceable>[ paquete(s) ]</replaceable>

source: <literal>policy</literal> is meant to help debug issues relating to the preferences file. With no arguments it will print out the priorities of each source. Otherwise it prints out detailed information about the priority selection of the named package.
de: <literal>policy</literal> ist dazu gedacht, bei Fragen der Fehlersuche, die sich auf die Einstellungsdatei beziehen, zu helfen. Ohne Argumente gibt es die Prioritäten von jeder Quelle aus. Ansonsten gibt es umfangreiche Informationen über die Prioritätenauswahl der genannten Pakete aus.
es: <literal>policy</literal> está pensado para ayudar a depurar asuntos relacionados con el fichero de preferencias. Sin argumentos mostrará las prioridades de cada fuente. De forma alternativa, muestra una información detallada acerca de la prioridad de selección del paquete nombrado.

source: madison <replaceable>[ pkg(s) ]</replaceable>
de: madison <replaceable>[ Paket(e) ]</replaceable>
es: madison <replaceable>[ paquete(s) ]</replaceable>

source: <literal>apt-cache</literal>'s <literal>madison</literal> command attempts to mimic the output format and a subset of the functionality of the Debian archive management tool, <literal>madison</literal>. It displays available versions of a package in a tabular format. Unlike the original <literal>madison</literal>, it can only display information for the architecture for which APT has retrieved package lists (<literal>APT::Architecture</literal>).
de: <literal>apt-cache</literal>s <literal>madison</literal>-Befehl versucht das Ausgabeformat und eine Untermenge der Funktionalität des Debian-Archivververwaltungswerkzeuges <literal>madison</literal> nachzuahmen. Es zeigt verfügbare Versionen eines Pakets in Tabellenform. Anders als das Original <literal>madison</literal>, kann es nur Informationen für die Architektur anzeigen, für die APT Paketlisten heruntergeladen hat (<literal>APT::Architecture</literal>).
es: La orden <literal>madison</literal> de <literal>apt-cache</literal> intenta imitar el formato de salida y parte de la funcionalidad de la herramienta para la gestión del archivo de Debian, <literal>madison</literal>. Muestra las versiones disponibles de un determinado paquete en un formato tabular. A diferencia del <literal>madison</literal> original, sólo puede mostrar información para la arquitectura para la que APT obtuvo las listas de paquetes (<literal>APT::Architecture</literal>).

source: options
de: Optionen
es: Opciones

source: Select the file to store the package cache. The package cache is the primary cache used by all operations. Configuration Item: <literal>Dir::Cache::pkgcache</literal>.
de: Wählt die Datei zum Speichern des Paketzwischenspeichers. Der Paketzwischenspeicher ist der primäre Zwischenspeicher, der von allen Operationen benutzt wird. Konfigurationselement: <literal>Dir::Cache::pkgcache</literal>.
es: Define el fichero donde guardar la caché de paquetes. La caché de paquetes es la caché primaria usada para todas las operaciones. Opción de configuración: <literal>Dir::Cache::pkgcache</literal>.

source: Select the file to store the source cache. The source is used only by <literal>gencaches</literal> and it stores a parsed version of the package information from remote sources. When building the package cache the source cache is used to avoid reparsing all of the package files. Configuration Item: <literal>Dir::Cache::srcpkgcache</literal>.
de: Wählt die Datei zum Speichern des Quellenzwischenspeichers. Die Quelle wird nur von <literal>gencaches</literal> benutzt und sie speichert eine ausgewertete Version der Paketinformationen von entfernt liegenden Quellen. Wenn der Paketzwischenspeicher gebildet wird, wird der Quellenzwischenspeicher benutzt, um ein erneutes Auswerten aller Paketdateien zu vermeiden. Konfigurationselement: <literal>Dir::Cache::srcpkgcache</literal>.
es: Escoge el fichero para guardar la caché fuente. Sólo <literal>gencaches</literal> usa esta caché y guarda una versión analizada de la información de los paquetes de las fuentes remotas. Cuando se genera la caché de paquetes la caché fuente se usa para evitar analizar todos los ficheros de paquetes. Opción de configuración: <literal>Dir::Cache::srcpkgcache</literal>.

source: Quiet; produces output suitable for logging, omitting progress indicators. More q's will produce more quietness up to a maximum of 2. You can also use <option>-q=#</option> to set the quietness level, overriding the configuration file. Configuration Item: <literal>quiet</literal>.
de: Still; erzeugt eine Ausgabe, die für Protokollierung geeignet ist und Fortschrittsanzeiger weglässt. Mehr »q«s unterdrücken mehr Ausgaben, bis zu einem Maximum von 2. Sie können außerdem <option>-q=#</option> benutzen, um die Stillestufe zu setzen, was die Konfigurationsdatei überschreibt. Konfigurationselement: <literal>quiet</literal>.
es: Produce una salida adecuada para su almacenamiento, omitiendo los indicadores de progreso. Más «q» producirán una salida más silenciosa, hasta un máximo de dos. También se puede usar <option>-q=#</option> para definir el nivel de silencio, ignorando el fichero de configuración. Opción de configuración: <literal>quiet</literal>.

source: Print only important dependencies; for use with unmet and depends. Causes only Depends and Pre-Depends relations to be printed. Configuration Item: <literal>APT::Cache::Important</literal>.
de: Nur wichtige Abhängigkeiten ausgeben. Zur Benutzung mit unmet und depends. Veranlasst, dass nur Depends- und Pre-Depends-Beziehungen ausgegeben werden. Konfigurationselement: <literal>APT::Cache::Important</literal>.
es: Muestra sólo las dependencias importantes, se usa junto con unmet y depends. Hace que sólo se muestren las dependencias y pre-dependencias. Opción de configuración: <literal>APT::Cache::Important</literal>.

source: Print full package records when searching. Configuration Item: <literal>APT::Cache::ShowFull</literal>.
de: Gibt die vollständigen Paketdatensätze beim Suchen aus. Konfigurationselement: <literal>APT::Cache::ShowFull</literal>.
es: Muestra todos los campos de información cuando se realiza una búsqueda. Opción de configuración: <literal>APT::Cache::ShowFull</literal>.

source: Print full records for all available versions. This is the default; to turn it off, use <option>--no-all-versions</option>. If <option>--no-all-versions</option> is specified, only the candidate version will displayed (the one which would be selected for installation). This option is only applicable to the <literal>show</literal> command. Configuration Item: <literal>APT::Cache::AllVersions</literal>.
de: Gibt die vollständigen Datensätze für alle verfügbaren Versionen aus. Dies ist die Vorgabe. Um sie auszuschalten, benutzen Sie <option>--no-all-versions</option>. Wenn <option>--no-all-versions</option> angegeben ist, wird nur die Anwärterversion angezeigt (die, die zur Installation ausgewählt würde). Diese Option ist nur für den <literal>show</literal>-Befehl anwendbar. Konfigurationselement: <literal>APT::Cache::AllVersions</literal>.
es: Muestra los campos completos de todas las versiones disponibles. Es el comportamiento predeterminado, para desactivarlo use <option>--no-all-versions</option>. Si se especifica <option>--no-all-versions</option>, sólo se muestra la versión candidata (la que se escogería para instalar). Esta opción sólo se aplica a la orden <literal>show</literal>. Opción de configuración: <literal>APT::Cache::AllVersions</literal>.

source: Perform automatic package cache regeneration, rather than use the cache as it is. This is the default; to turn it off, use <option>--no-generate</option>. Configuration Item: <literal>APT::Cache::Generate</literal>.
de: Führt das Neuerstellen des Paketzwischenspeichers aus, anstatt den Zwischenspeicher so zu benutzen, wie er ist. Das ist die Vorgabe. Um sie auszuschalten benutzen Sie <option>--no-generate</option>. Konfigurationselement: <literal>APT::Cache::Generate</literal>.
es: Realiza una regeneración completa de la caché de paquetes, en vez de usarla tal y como está. Esta es la opción predeterminada, para desactivarla use <option>--no-generate</option>. Opción de configuración: <literal>APT::Cache::Generate</literal>.

source: Only search on the package names, not the long descriptions. Configuration Item: <literal>APT::Cache::NamesOnly</literal>.
de: Durchsucht nur die Paketnamen, nicht die Langbeschreibungen. Konfigurationselement: <literal>APT::Cache::NamesOnly</literal>.
es: Sólo busca en los nombres de paquetes, no en las descripciones largas. Opción de configuración: <literal>APT::Cache::NamesOnly</literal>.

source: Make <literal>pkgnames</literal> print all names, including virtual packages and missing dependencies. Configuration Item: <literal>APT::Cache::AllNames</literal>.
de: Lässt <literal>pkgnames</literal> alle Namen, einschließlich virtueller Pakete und fehlender Abhängigkeiten, ausgeben. Konfigurationselement: <literal>APT::Cache::AllNames</literal>.
es: Hace que <literal>pkgnames</literal> muestre todos los nombres, incluyendo los paquetes virtuales y las dependencias no encontradas. Opción de configuración: <literal>APT::Cache::AllNames</literal>.

source: Make <literal>depends</literal> and <literal>rdepends</literal> recursive so that all packages mentioned are printed once. Configuration Item: <literal>APT::Cache::RecurseDepends</literal>.
de: Macht <literal>depends</literal> und <literal>rdepends</literal> rekursiv, so dass alle erwähnten Pakete einmal ausgegeben werden. Konfigurationselement: <literal>APT::Cache::RecurseDepends</literal>.
es: Hace que <literal>depends</literal> y <literal>rdepends</literal> sean recursivos de modo que todos los paquetes mencionados se muestran sólo una vez. Opción de configuración <literal>APT::Cache::RecurseDepends</literal>.

source: Limit the output of <literal>depends</literal> and <literal>rdepends</literal> to packages which are currently installed. Configuration Item: <literal>APT::Cache::Installed</literal>.
de: Begrenzt die Ausgabe von <literal>depends</literal> und <literal>rdepends</literal> auf Pakete, die aktuell installiert sind. Konfigurationselement: <literal>APT::Cache::Installed</literal>.
es: Limita la salida de <literal>depends</literal> y <literal>rdepends</literal> a paquetes actualmente instalados. Opción de configuración: <literal>APT::Cache::Installed</literal>.

source: Files
de: Dateien
es: Ficheros

source: See Also
de: Siehe auch
es: Véase también

source: Diagnostics
de: Diagnose
es: Diagnósticos

source: <command>apt-cache</command> returns zero on normal operation, decimal 100 on error.
de: <command>apt-cache</command> gibt bei normalen Operationen 0 zurück, dezimal 100 bei Fehlern.
es: <command>apt-cache</command> devuelve cero si no hay ningún error, y el valor 100 en caso de error.

source: &apt-author.jgunthorpe; &apt-author.team; &apt-email; &apt-product; <date>14 February 2004</date>
de: &apt-author.jgunthorpe; &apt-author.team; &apt-email; &apt-product; <date>14. Februar 2004</date>
es: &apt-author.jgunthorpe; &apt-author.team; &apt-email; &apt-product; <date>14 de Febrero de 2004</date>

source: APT CDROM management utility
de: APT-CDROM-Verwaltungswerkzeug
es: Herramienta de APT para la gestión de discos ópticos

source: <command>apt-cdrom</command> <arg><option>-hvrmfan</option></arg> <arg><option>-d=<replaceable>cdrom mount point</replaceable></option></arg> <arg><option>-o=<replaceable>config string</replaceable></option></arg> <arg><option>-c=<replaceable>file</replaceable></option></arg> <group> <arg>add</arg> <arg>ident</arg> </group>
de: <command>apt-cdrom</command> <arg><option>-hvrmfan</option></arg> <arg><option>-d=<replaceable>CD-ROM-Einhängepunkt</replaceable></option></arg><arg><option>-o=<replaceable>Konfigurationszeichenkette</replaceable></option></arg><arg><option>-c=<replaceable>Datei</replaceable></option></arg><group><arg>hinzufügen</arg><arg>Identifikation</arg></group>
es: <command>apt-cdrom</command> <arg><option>-hvrmfan</option></arg> <arg><option>-d=<replaceable>punto-de-montaje</replaceable></option></arg> <arg><option>-o=<replaceable>cadena-de-configuración</replaceable></option></arg> <arg><option>-c=<replaceable>fichero</replaceable></option></arg> <group> <arg>add</arg> <arg>ident</arg> </group>

source: <command>apt-cdrom</command> is used to add a new CDROM to APTs list of available sources. <command>apt-cdrom</command> takes care of determining the structure of the disc as well as correcting for several possible mis-burns and verifying the index files.
de: <command>apt-cdrom</command> wird benutzt, um eine neue CD-ROM zu APTs Liste der verfügbaren Quellen hinzuzufügen. <command>apt-cdrom</command> kümmert sich um die festgestellte Struktur des Mediums, sowie die Korrektur für mehrere mögliche Fehlbrennungen und prüft die Indexdateien.
es: <command>apt-cdrom</command> se usa para añadir un disco óptico a la lista de fuentes disponibles de APT. <command>apt-cdrom</command> examina la estructura del disco, corrige los posibles errores de grabación y verifica los ficheros de índice.

source: It is necessary to use <command>apt-cdrom</command> to add CDs to the APT system, it cannot be done by hand. Furthermore each disk in a multi-cd set must be inserted and scanned separately to account for possible mis-burns.
de: Es ist notwendig, <command>apt-cdrom</command> zu benutzen, um CDs zum APT-System hinzuzufügen. Dies kann nicht manuell erfolgen. Weiterhin muss jedes Medium in einer Zusammenstellung aus mehreren CDs einzeln eingelegt und gescannt werden, um auf mögliche Fehlbrennungen zu testen.
es: Es necesario usar <command>apt-cdrom</command> para añadir los discos al sistema APT, no se puede hacer manualmente. Además, debe insertar y analizar cada disco de un conjunto de discos por separado, para poder detectar los posibles errores de grabación.

source: <literal>add</literal> is used to add a new disc to the source list. It will unmount the CDROM device, prompt for a disk to be inserted and then proceed to scan it and copy the index files. If the disc does not have a proper <filename>disk</filename> directory you will be prompted for a descriptive title.
de: <literal>add</literal> wird benutzt, um ein neues Medium zur Quellenliste hinzuzufügen. Es wird das CD-ROM-Gerät aushängen, verlangen, dass ein Medium eingelegt wird und dann mit den Einlesen und Kopieren der Indexdateien fortfahren. Wenn das Medium kein angemessenes <filename>disk</filename>-Verzeichnis hat, werden Sie nach einem aussagekräftigen Titel gefragt.
es: <literal>add</literal> añade un disco nuevo a la lista de fuentes. Desmontará el dispositivo del disco y pedirá que se inserte un disco para iniciar el análisis y copiado de los ficheros de índice. Si el disco no contiene un directorio <filename>disk</filename> apropiado, se le pedirá un título descriptivo.

source: APT uses a CDROM ID to track which disc is currently in the drive and maintains a database of these IDs in <filename>&statedir;/cdroms.list</filename>
de: APT benutzt eine CD-ROM-ID, um nachzuverfolgen, welches Medium gerade im Laufwerk ist und verwaltet eine Datenbank mit diesen IDs in <filename>&statedir;/cdroms.list</filename>
es: APT usa un identificador de CDROM para reconocer qué disco está actualmente en la unidad lectora y mantiene una lista de estos identificadores en <filename>&statedir;/cdroms.list</filename>

source: A debugging tool to report the identity of the current disc as well as the stored file name
de: Ein Fehlersuchwerkzeug, um die Identität des aktuellen Mediums sowie den gespeicherten Dateinamen zu berichten.
es: Una herramienta de depuración para informar de la identidad del disco actual así como del nombre del fichero guardado.

source: Unless the <option>-h</option>, or <option>--help</option> option is given one of the commands below must be present. <placeholder type="variablelist" id="0"/>
de: Außer wenn die Option <option>-h</option> oder <option>--help</option> angegeben wurde, muss einer der beiden Befehle unterhalb gegeben sein. <placeholder type="variablelist" id="0"/>
es: Se debe proporcionar alguna de las siguientes órdenes, a menos que se proporcione una de las opciones <option>-h</option> o <option>--help</option>. <placeholder type="variablelist" id="0"/>

source: Options
de: Optionen
es: Opciones

source: Mount point; specify the location to mount the cdrom. This mount point must be listed in <filename>/etc/fstab</filename> and properly configured. Configuration Item: <literal>Acquire::cdrom::mount</literal>.
de: Einhängepunkt. Gibt den Ort an, an dem die CD-ROM eingehängt wird. Dieser Einhängepunkt muss in <filename>/etc/fstab</filename> eingetragen und angemessen konfiguriert sein. Konfigurationselement: <literal>Acquire::cdrom::mount</literal>.
es: Punto de montaje. Define el lugar donde se debe montar el disco óptico. El punto de montaje debe aparecer en <filename>/etc/fstab</filename> y estar correctamente configurado. Opción de configuración: <literal>Acquire::cdrom::mount</literal>.
