Repository: anbangr/trusted-apt
Catalog: doc/po/*.po
Languages: de, es

source: Output all the data received from &dpkg; on the status file descriptor and any errors encountered while parsing it.
de: Alle von &dpkg; empfangenen Daten über einen Status-Datei-Deskriptor und alle während deren Auswertung gefundenen Fehler ausgeben.
es: Muestra todos los datos recibidos de &dpkg; en el descriptor del fichero de estado y cualquier error encontrado durante el análisis.

source: Generate a trace of the algorithm that decides the order in which <literal>apt</literal> should pass packages to &dpkg;.
de: Eine Aufzeichnung des Algorithmus generieren, der über die Reihenfolge entscheidet, in der <literal>apt</literal> Pakete an &dpkg; weiterleiten soll.
es: Genera una traza del algoritmo que decide el orden en el que <literal>apt</literal> debería entregar los paquetes a &dpkg;.

source: Output status messages tracing the steps performed when invoking &dpkg;.
de: Statusmeldungen ausgeben, die die Schritte nachverfolgen, die beim Aufruf von &dpkg; ausgeführt werden.
es: Muestra los mensajes de estado siguiendo los pasos realizados al invocar a &dpkg;.

source: Output the priority of each package list on startup.
de: Die Priorität jeder Paketliste beim Start ausgeben.
es: Muestra la prioridad de cada lista de paquetes al iniciarse.

source: Trace the execution of the dependency resolver (this applies only to what happens when a complex dependency problem is encountered).
de: Die Ausführung des Abhängigkeitenverfolgers aufzeichnen (dies wird nur auf das angewandt, was geschieht, wenn ein komplexes Abhängigkeitsproblem aufgetreten ist).
es: Muestra la ejecución del solucionador de dependencias (esto se aplica sólo a lo que ocurre cuando se encuentra un problema de dependencias complejo).

source: Display a list of all installed packages with their calculated score used by the pkgProblemResolver. The description of the package is the same as described in <literal>Debug::pkgDepCache::Marker</literal>
de: Eine Liste aller installierten Pakete mit ihren berechneten Bewertungen, die vom pkgProblemResolver benutzt werden, ausgeben. Die Beschreibung des Pakets ist die gleiche, wie in <literal>Debug::pkgDepCache::Marker</literal> beschrieben.
es: Muestra una lista de todos los paquetes instalados con sus puntuaciones calculadas y usadas por pkgProblemResolver. La descripción del paquete es la misma que la descrita en <literal>Debug::pkgDepCache::Marker</literal>.

source: Print information about the vendors read from <filename>/etc/apt/vendors.list</filename>.
de: Die Informationen über die in <filename>/etc/apt/vendors.list</filename> gelesenen Anbieter ausgeben.
es: Muestra la información de los proveedores extraída de <filename>/etc/apt/vendors.list</filename>.

source: &configureindex; is a configuration file showing example values for all possible options.
de: &configureindex; ist eine Konfigurationsdatei, die Beispielwerte für alle möglichen Optionen zeigen.
es: &configureindex; es un fichero de configuración de ejemplo que muestra valores de ejemplo para todas las opciones posibles.

source: &apt-author.team; &apt-email; &apt-product; <date>16 February 2010</date>
de: &apt-author.team; &apt-email; &apt-product; <date>16. Februar 2010</date>
es: &apt-author.team; &apt-email; &apt-product; <date>16 de Febrero 2010</date>

source: Preference control file for APT
de: Voreinstellungssteuerdatei für APT
es: Fichero de preferencias de APT

source: The APT preferences file <filename>/etc/apt/preferences</filename> and the fragment files in the <filename>/etc/apt/preferences.d/</filename> folder can be used to control which versions of packages will be selected for installation.
de: Die APT-Einstellungsdatei <filename>/etc/apt/preferences</filename> und Teildateien im Verzeichnis <filename>/etc/apt/preferences.d/</filename> können benutzt werden, um zu steuern, welche Versionen von Paketen zur Installation ausgewählt werden.
es: El fichero de preferencias de APT <filename>/etc/apt/preferences</filename> y los segmentos de fichero dentro del directorio <filename>/etc/apt/preferences.d/</filename> se pueden usar para controlar las versiones de los paquetes seleccionados para su instalación.

source: Several versions of a package may be available for installation when the &sources-list; file contains references to more than one distribution (for example, <literal>stable</literal> and <literal>testing</literal>). APT assigns a priority to each version that is available. Subject to dependency constraints, <command>apt-get</command> selects the version with the highest priority for installation. The APT preferences file overrides the priorities that APT assigns to package versions by default, thus giving the user control over which one is selected for installation.
de: Es könnten mehrere Versionen eines Pakets zur Installation verfügbar sein, wenn die Datei &sources-list; Bezüge zu mehr als einer Distribution enthält (zum Beispiel <literal>stable</literal> und <literal>testing</literal>). APT weist jeder verfügbaren Version eine Priorität zu. Je nach Abhängigkeitsbedingungen wählt <command>apt-get</command> die Version mit der höchsten Priorität zur Installation aus. Die APT-Einstellungsdatei überschreibt die Prioritäten, die APT den Paketversionen standardmäßig zuweist, was dem Anwender die Kontrolle darüber gibt, welche zur Installation ausgewählt wird.
es: Puede disponer de varias versiones de un mismo paquete cuando el fichero &sources-list; contiene referencias a más de una distribución (por ejemplo, «<literal>stable</literal>» (estable) y «<literal>testing</literal>» (en pruebas)). APT asigna una prioridad a cada versión disponible, y limitado por las dependencias, <command>apt-get</command> selecciona la versión con mayor prioridad. El fichero de preferencias de APT modifica las prioridades asignadas por APT, dando control al usuario sobre qué versión se seleccionará para su instalación.

source: Several instances of the same version of a package may be available when the &sources-list; file contains references to more than one source. In this case <command>apt-get</command> downloads the instance listed earliest in the &sources-list; file. The APT preferences file does not affect the choice of instance, only the choice of version.
de: Es könnten mehrere Instanzen der gleichen Version eines Paketes verfügbar sein, wenn die Datei &sources-list; Bezüge zu mehr als einer Distribution enthält. In diesem Fall lädt <command>apt-get</command> die Instanz herunter, die in der Datei &sources-list; als erstes aufgelistet ist. Die APT-Einstellungsdatei beeinflusst die Wahl der Instanz nicht, nur die Wahl der Version.
es: Puede que estén disponibles varios ejemplares de la misma versión de un paquete cuando el fichero «&sources-list;» contenga referencias a más de una fuente. En este caso <command>apt-get</command> descarga el ejemplar que aparezca listado primero en el fichero «&sources-list;». El fichero de preferencias de APT no modifica la elección del ejemplar, sólo la elección de la versión.

source: Preferences are a strong power in the hands of a system administrator but they can become also their biggest nightmare if used without care! APT will not questioning the preferences so wrong settings will therefore lead to uninstallable packages or wrong decisions while upgrading packages. Even more problems will arise if multiply distribution releases are mixed without a good understanding of the following paragraphs. Packages included in a specific release aren't tested in and therefore doesn't always work as expected in older or newer releases or together with other packages from different releases. You have been warned.
de: Eigenschaften sind in der Hand eines Systemadministrator ein große Stärke, können aber auch sein größter Albtraum werden, wenn sie unvorsichtig benutzt werden. APT wird die Eigenschaften nicht abfragen, so dass deshalb falsche Einstellungen zu nicht installierbaren Paketen oder falschen Entscheidungen während des Upgrades führen. Sogar noch mehr Probleme treten auf, wenn mehrere Distributions-Release ohne gutes Verständnis der folgenden Absätze gemischt werden. Pakete, die in einem speziellen Release enthalten sind, sind nicht in älteren und neueren Releases oder zusammen mit Paketen unterschiedlicher Releases getestet und funktionieren daher erwartungsgemäß nicht. Sind wurden gewarnt.
es: Las preferencias («preferences») son un gran poder en las manos de un administrador de sistemas, ¡pero también se pueden convertir en su mayor pesadilla si se usan sin cuidado! APT no se cuestionará si las preferencias contienen opciones erróneas, y por ello puede llevar a paquetes no instalables o tomar decisiones erróneas al actualizar paquetes. Pueden surgir más problemas si se mezclan varias publicaciones de distribución sin un correcto entendimiento de los siguientes párrafos. Los paquetes incluidos en una distribución específica no se revisan en combinación con otras distribuciones más antiguas o más recientes, y puede que no funcionen como esperado. Queda avisado.

source: APT's Default Priority Assignments
de: APTs Standardprioritätszuweisungen
es: ¿Cómo asigna APT las prioridades?

source: <command>apt-get install -t testing <replaceable>some-package</replaceable></command>
de: <command>apt-get install -t testing <replaceable>irgendein_Paket</replaceable></command>
es: <command>apt-get install -t testing <replaceable>paquete</replaceable></command>

source: If there is no preferences file or if there is no entry in the file that applies to a particular version then the priority assigned to that version is the priority of the distribution to which that version belongs. It is possible to single out a distribution, "the target release", which receives a higher priority than other distributions do by default. The target release can be set on the <command>apt-get</command> command line or in the APT configuration file <filename>/etc/apt/apt.conf</filename>. Note that this has precedence over any general priority you set in the <filename>/etc/apt/preferences</filename> file described later, but not over specifically pinned packages. For example, <placeholder type="programlisting" id="0"/> <placeholder type="programlisting" id="1"/>
de: Wenn es keine Einstellungsdatei gibt oder es in der Datei keinen Eintrag gibt, der sich auf eine bestimmte Version bezieht, dann ist die dieser Version zugewiesene Priorität, die Priorität der Distribution zu der die Version gehört. Es ist möglich eine Distribution auszuzeichnen, »das Ziel-Release«, die eine höhere Priorität erhält, als dies andere Distributionen standardmäßig tun. Das Ziel-Release kann auf der <command>apt-get</command>-Befehlszeile oder in der APT-Konfigurationsdatei <filename>/etc/apt/apt.conf</filename> gesetzt werden. Beachten Sie, dass dies Vorrang vor einer allgemeinen Priorität hat, die Sie, wie später beschrieben, in der Datei <filename>/etc/apt/preferences</filename> setzen, aber nicht vor bestimmten mit Pinning gewichteten Paketen. Beispielsweise <placeholder type="programlisting" id="0"/> <placeholder type="programlisting" id="1"/>
es: De no existir el fichero de preferencias, o si no hay ninguna entrada en éste que se pueda aplicar a una determinada versión, se asigna a la versión la prioridad de la distribución a la que pertenece. Es posible seleccionar una distribución, la &gt;&gt;distribución objetivo&lt;&lt; (n. t. del inglés <emphasis>target release</emphasis>), que recibe una prioridad predefinida mayor que el resto. La distribución objetivo se puede definir en la línea de órdenes al ejecutar <command>apt-get</command> o en el fichero de configuración de APT <filename>/etc/apt/apt.conf</filename>. Tenga en cuenta que esto tiene preferencia sobre cualquier otra prioridad definida en <filename>/etc/apt/preferencias</filename>, pero que no afecta al anclaje de paquetes específicos. Por ejemplo, <placeholder type="programlisting" id="0"/><placeholder type="programlisting" id="1"/>

source: priority 1
de: Priorität 1

source: to the versions coming from archives which in their <filename>Release</filename> files are marked as "NotAutomatic: yes" but <emphasis>not</emphasis> as "ButAutomaticUpgrades: yes" like the debian <literal>experimental</literal> archive.
de: zu den Versionen, die von Archiven kommen, die in deren <filename>Release</filename>-Dateien als »NotAutomatic: yes« markiert sind, aber <emphasis>nicht</emphasis> als »ButAutomaticUpgrades: yes« wie das Archiv <literal>experimental</literal> von Debian.

source: priority 100
de: Priorität 100
es: prioridad 100

source: to the version that is already installed (if any) and to the versions coming from archives which in their <filename>Release</filename> files are marked as "NotAutomatic: yes" and "ButAutomaticUpgrades: yes" like the debian backports archive since <literal>squeeze-backports</literal>.
de: zu der Version, die bereits installiert ist (wenn dies der Fall ist) und zu Versionen, die von Archiven kommen, die in deren <filename>Release</filename>-Dateien als »NotAutomatic: yes« und »ButAutomaticUpgrades: yes« markiert sind, wie das Debian-Backports-Archiv seit <literal>squeeze-backports</literal>.

source: priority 500
de: Priorität 500
es: prioridad 500

source: to the versions that are not installed and do not belong to the target release.
de: zu den Versionen, die nicht installiert sind und die nicht zum Ziel-Release gehören.
es: a las versiones que ni están instaladas ni pertenecen a la distribución objetivo.

source: priority 990
de: Priorität 990
es: prioridad 990

source: to the versions that are not installed and belong to the target release.
de: zu den Versionen, die nicht installiert sind und zum Ziel-Release gehören.
es: a las versiones que no están instaladas y que pertenecen a la distribución objetivo.

source: If the target release has been specified then APT uses the following algorithm to set the priorities of the versions of a package. Assign: <placeholder type="variablelist" id="0"/>
de: Wenn das Ziel-Release angegeben wurde, dann benutzt APT den folgenden Algorithmus, um die Prioritäten der Versionen eines Paketes zu setzen. Zuweisung: <placeholder type="variablelist" id="0"/>
es: Si se ha especificado una distribución objetivo, APT usa el siguiente algoritmo para establecer las prioridades de cada versión de un paquete. Asignar: <placeholder type="variablelist" id="0"/>

source: If the target release has not been specified then APT simply assigns priority 100 to all installed package versions and priority 500 to all uninstalled package versions, except versions coming from archives which in their <filename>Release</filename> files are marked as "NotAutomatic: yes" - these versions get the priority 1 or priority 100 if it is additionally marked as "ButAutomaticUpgrades: yes".
de: Wenn das Ziel-Release nicht angegeben wurde, dann weist APT einfach allen installierten Paketversionen eine Priorität von 100 und allen nicht installierten Paketversionen eine Priorität von 500 zu, außer wenn Versionen aus Archiven kommen, die in deren <filename>Release</filename>-Dateien mit »NotAutomatic: yes« markiert sind – diese Versionen erhalten die Priorität 1 oder die Priorität 100, falls sie zusätzlich als »ButAutomaticUpgrades: yes« markiert sind.

source: APT then applies the following rules, listed in order of precedence, to determine which version of a package to install.
de: APT wendet dann die folgenden Regeln an, aufgelistet in der Reihenfolge ihres Vorrangs, um zu bestimmen in welcher Version das Paket zu installieren ist.
es: APT aplica las siguientes normas, expuestas por orden de precedencia, para determinar qué versión del paquete debe instalar.

source: Never downgrade unless the priority of an available version exceeds 1000. ("Downgrading" is installing a less recent version of a package in place of a more recent version. Note that none of APT's default priorities exceeds 1000; such high priorities can only be set in the preferences file. Note also that downgrading a package can be risky.)
de: Führen Sie niemals ein Downgrade durch, außer wenn die Priorität verfügbarer Pakete 1000 übersteigt. (»Downgrading« ist das Installieren einer weniger aktuellen Version, an Stelle einer aktuelleren Version. Beachten Sie, dass keine Standardpriorität von APT 1000 übersteigt. So hohe Prioritäten können nur durch die Einstellungsdatei gesetzt werden. Beachten Sie außerdem, dass Downgrading eines Paketes riskant sein kann.)
es: Nunca instala una versión anterior de un paquete en lugar de la instalada a menos que la prioridad de la versión disponible supere 1000 («Desactualizar» significa instalar una versión menos reciente de un paquete. Tenga en cuenta que ninguna de las prioridades que asigna APT por omisión superan 1000; éstas prioridades sólo se pueden establecer mediante el fichero de preferencias. Observe que instalar una versión anterior del paquete puede ser peligroso).

source: Install the highest priority version.
de: Die Version mit der höchsten Priorität installieren.
es: Instala la versión de mayor prioridad.

source: If two or more versions have the same priority, install the most recent one (that is, the one with the higher version number).
de: Wenn zwei oder mehr Versionen die gleiche Priorität haben, wird die aktuellste installiert (das ist die mit der höheren Versionsnummer).
es: Si dos o más versiones tienen la misma prioridad, instala la más reciente (esto es, la que tiene un número de versión mayor).

source: If two or more versions have the same priority and version number but either the packages differ in some of their metadata or the <literal>--reinstall</literal> option is given, install the uninstalled one.
de: Wenn zwei oder mehr Versionen die gleiche Priorität und Versionsnummer haben, die Pakete sich aber entweder in ihren Metadaten unterscheiden oder die Option <literal>--reinstall</literal> angegeben wurde, wird die nicht installierte installiert.
es: Si dos o más versiones tienen la misma prioridad y número de versión, pero o bien difieren en su meta-información o se ha introducido la opción <literal>--reinstall</literal>, se instalará la que no está instalada.

source: In a typical situation, the installed version of a package (priority 100) is not as recent as one of the versions available from the sources listed in the &sources-list; file (priority 500 or 990). Then the package will be upgraded when <command>apt-get install <replaceable>some-package</replaceable></command> or <command>apt-get upgrade</command> is executed.
de: In einer typischen Situation ist die Version eines Paketes (Priorität 100) nicht so aktuell, wie eine der verfügbaren Versionen, die in der Quellliste der Datei &sources-list; steht (Priorität 500 oder 990). Dann wird ein Upgrade des Pakets durchgeführt, wenn <command>apt-get install <replaceable>irgendein_Paket</replaceable></command> oder <command>apt-get upgrade</command> ausgeführt wird.
es: Generalmente, la versión instalada del paquete (prioridad 100) no es tan reciente como la disponible a través de las fuentes en «&sources-list;» (prioridad 500 o 990). En este caso, el paquete se actualizará al ejecutar <command>apt-get install <replaceable>paquete</replaceable></command> o <command>apt-get upgrade</command>.

source: More rarely, the installed version of a package is <emphasis>more</emphasis> recent than any of the other available versions. The package will not be downgraded when <command>apt-get install <replaceable>some-package</replaceable></command> or <command>apt-get upgrade</command> is executed.
de: Seltener ist die installierte Version eines Pakets <emphasis>neuer</emphasis>, als jede andere der verfügbaren Versionen. Für das Paket wird kein Downgrade durchgeführt, wenn <command>apt-get install <replaceable>irgendein_Paket</replaceable></command> oder <command>apt-get upgrade</command> ausgeführt wird.
es: Rara vez la versión instalada de un paquete es <emphasis>más</emphasis> reciente que cualquiera de las versiones disponibles. En éste caso no se instalará la versión anterior del paquete al ejecutar <command>apt-get install <replaceable>paquete</replaceable></command> o <command>apt-get upgrade</command>.

source: Sometimes the installed version of a package is more recent than the version belonging to the target release, but not as recent as a version belonging to some other distribution. Such a package will indeed be upgraded when <command>apt-get install <replaceable>some-package</replaceable></command> or <command>apt-get upgrade</command> is executed, because at least <emphasis>one</emphasis> of the available versions has a higher priority than the installed version.
de: Manchmal ist die installierte Version eines Pakets aktueller, als die Version, die zum Ziel-Release gehört, aber nicht so aktuell, wie eine Version, die zu einer anderen Distribution gehört. Für ein derartiges Paket wird tatsächlich ein Upgrade durchgeführt, wenn <command>apt-get install <replaceable>irgendein_Paket</replaceable></command> oder <command>apt-get upgrade</command> ausgeführt wird, weil mindestens <emphasis>eine</emphasis> der verfügbaren Versionen eine höhere Priorität als die installierte Version hat.
es: A veces, la versión instalada de un paquete es más reciente que la versión perteneciente a la distribución objetivo, pero no tan reciente como la versión de otra distribución. Este tipo de paquetes se actualizarán al ejecutar <command>apt-get install <replaceable>paquete</replaceable></command> o <command>apt-get upgrade</command> porque al menos <emphasis>uno</emphasis> de los ejemplares disponibles tiene una prioridad mayor que la versión instalada.

source: The Effect of APT Preferences
de: Die Auswirkungen von APT-Einstellungen
es: El efecto de las preferencias sobre APT

source: The APT preferences file allows the system administrator to control the assignment of priorities. The file consists of one or more multi-line records separated by blank lines. Records can have one of two forms, a specific form and a general form.
de: Die APT-Einstellungsdatei erlaubt einem Systemverwalter die Zuweisung von Prioritäten zu steuern. Die Datei besteht aus einem oder mehreren mehrzeiligen Datensätzen, die durch leere Zeilen getrennt sind. Datensätze können eine von zwei Gestalten haben, eine spezielle Gestalt oder eine allgemeine Gestalt.
es: El fichero de preferencias de APT permite al administrador del sistema controlar la asignación de prioridades. El fichero consiste en uno o más registros de varias líneas separados entre sí por espacios en blanco. Los registros pueden tener una de estos dos formatos: el específico o el general.

source: The specific form assigns a priority (a "Pin-Priority") to one or more specified packages and specified version or version range. For example, the following record assigns a high priority to all versions of the <filename>perl</filename> package whose version number begins with "<literal>5.8</literal>". Multiple packages can be separated by spaces.
de: Die spezielle Form weist die Priorität (eine »Pin-Priorität«) einem oder mehreren angegebenen Paketen und angegebenen Versionen oder Versionsbereichen zu. Der folgende Datensatz weist zum Beispiel allen Versionen des <filename>perl</filename>-Pakets eine höhere Priorität zu, deren Versionsnummer mit »<literal>5.8</literal>« beginnt. Mehrere Pakete können durch Leerzeichen getrennt werden.
es: El formato «específico» asigna una prioridad («Pin-Priority») a un paquete concreto y afecta a una versión especificada o rango de versiones. Por ejemplo, el siguiente registro asigna una prioridad alta a todas las versiones del paquete <filename>perl</filename> cuyo número de versión empiece con «<literal>5.8</literal>». Puede especificar varios paquetes separados por espacios.
